{
  "barbarian": {
    "name": "Barbarian",
    "description": "A fierce warrior of primitive background who can enter a battle rage",
    "hitDie": 12,
    "primaryAbility": ["str"],
    "dumpStat": "int",
    "savingThrows": ["str", "con"],
    "skillChoices": 2,
    "skillOptions": ["animal_handling", "athletics", "intimidation", "nature", "perception", "survival"],
    "armorProficiencies": ["light", "medium", "shields"],
    "weaponProficiencies": ["simple", "martial"],
    "startingEquipment": {
      "choices": [
        {
          "choose": 1,
          "from": [
            "Greataxe",
            "Any Martial Melee Weapon"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Two Handaxes",
            "Any Simple Weapon"
          ]
        }
      ],
      "given": ["Explorer's Pack", "Four Javelins"]
    },
    "startingGold": {
      "dice": "2d4",
      "multiplier": 10,
      "average": 50
    },
    "features": [
      "Rage - In battle, you fight with primal ferocity. Gain bonus damage and resistance to physical damage",
      "Unarmored Defense - While not wearing armor, your AC equals 10 + DEX modifier + CON modifier"
    ],
    "subclasses": [
      {
        "name": "Path of the Berserker",
        "description": "Channel rage into violent fury",
        "featuresByLevel": {
          "3": [{"name": "Frenzy", "description": "You can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion."}],
          "6": [{"name": "Mindless Rage", "description": "You can't be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage."}],
          "10": [{"name": "Intimidating Presence", "description": "You can use your action to frighten someone with your menacing presence. Choose one creature you can see within 30 feet. If the creature can see or hear you, it must succeed on a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the end of your next turn. On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn."}],
          "14": [{"name": "Retaliation", "description": "When you take damage from a creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature."}]
        }
      },
      {
        "name": "Path of the Totem Warrior",
        "description": "Draw upon animal spirits for power",
        "totemOptions": ["Bear", "Eagle", "Elk", "Tiger", "Wolf"],
        "featuresByLevel": {
          "3": [{"name": "Spirit Seeker", "description": "You gain the ability to cast Beast Sense and Speak with Animals spells, but only as rituals."}, {"name": "Totem Spirit", "description": "Choose a totem spirit. Bear: While raging, you have resistance to all damage except psychic damage. Eagle: While raging, other creatures have disadvantage on opportunity attack rolls against you, and you can take the Dash action as a bonus action. Wolf: While raging, your friends have advantage on melee attack rolls against any creature within 5 feet of you that is hostile to you."}],
          "6": [{"name": "Aspect of the Beast", "description": "Choose an aspect. Bear: Your carrying capacity doubles, and you have advantage on Strength checks made to push, pull, lift, or break objects. Eagle: You can see up to 1 mile away with no difficulty, and no disadvantage on Perception checks at long distances. Wolf: You can track other creatures while traveling at a fast pace, and you can move stealthily while traveling at a normal pace."}],
          "10": [{"name": "Spirit Walker", "description": "You can cast the Commune with Nature spell, but only as a ritual. When you do so, a spiritual version of one of the animals you chose for Totem Spirit or Aspect of the Beast appears to you to convey the information you seek."}],
          "14": [{"name": "Totemic Attunement", "description": "Choose an attunement. Bear: While raging, any creature within 5 feet of you that's hostile to you has disadvantage on attack rolls against targets other than you. Eagle: While raging, you have a flying speed equal to your current walking speed. Wolf: While raging, you can use a bonus action to knock a Large or smaller creature prone when you hit it with a melee weapon attack."}]
        }
      },
      {
        "name": "Path of the Ancestral Guardian",
        "description": "Call upon ancestor spirits to protect allies",
        "featuresByLevel": {
          "3": [{"name": "Ancestral Protectors", "description": "Spectral warriors appear when you enter your rage. The first creature you hit with an attack on your turn becomes the target of the warriors, which hinder its attacks. Until the start of your next turn, that target has disadvantage on any attack roll that isn't against you, and when the target hits a creature other than you with an attack, that creature has resistance to the damage dealt by the attack."}],
          "6": [{"name": "Spirit Shield", "description": "If you are raging and another creature you can see within 30 feet of you takes damage, you can use your reaction to reduce that damage by 2d6. At 10th level, the reduction increases to 3d6, and at 14th level to 4d6."}],
          "10": [{"name": "Consult the Spirits", "description": "You can cast Augury or Clairvoyance, without using a spell slot or material components. Your spell save DC for these spells equals 8 + your proficiency bonus + your Wisdom modifier. Once you cast either spell in this way, you can't use this feature again until you finish a short or long rest."}],
          "14": [{"name": "Vengeful Ancestors", "description": "Your ancestral spirits grow powerful enough to retaliate. When you use your Spirit Shield to reduce the damage of an attack, the attacker takes an amount of force damage equal to the damage that your Spirit Shield prevents."}]
        }
      },
      {
        "name": "Path of the Storm Herald",
        "description": "Channel elemental fury in an aura",
        "stormAuras": ["Desert (Fire)", "Sea (Lightning)", "Tundra (Cold)"],
        "featuresByLevel": {
          "3": [{"name": "Storm Aura", "description": "You emanate a stormy, magical aura while you rage. The aura extends 10 feet from you in every direction, but not through total cover. Your aura has an effect that activates when you enter your rage, and you can activate the effect again on each of your turns as a bonus action. Choose an environment: Desert (each creature of your choice in your aura takes 2 fire damage), Sea (you can choose one creature in your aura; it must make a Dexterity save or take 1d6 lightning damage), or Tundra (each creature of your choice in your aura gains 2 temporary hit points)."}],
          "6": [{"name": "Storm Soul", "description": "The storm grants you benefits even when your aura isn't active. Desert: You have resistance to fire damage, and you don't suffer the effects of extreme heat. Sea: You have resistance to lightning damage, you can breathe underwater, and you have a swimming speed of 30 feet. Tundra: You have resistance to cold damage, and you don't suffer the effects of extreme cold."}],
          "10": [{"name": "Shielding Storm", "description": "You learn to use your mastery of the storm to protect others. Each creature of your choice has the damage resistance you gained from the Storm Soul feature while the creature is in your Storm Aura."}],
          "14": [{"name": "Raging Storm", "description": "The power of the storm you channel grows mightier. Desert: Immediately after a creature in your aura hits you with an attack, you can use your reaction to force that creature to make a Dexterity save. On a failed save, the creature takes fire damage equal to half your barbarian level. Sea: When you hit a creature in your aura with an attack, you can use your reaction to force that creature to make a Strength save or be knocked prone. Tundra: Whenever the effect of your Storm Aura is activated, you can choose one creature you can see in the aura. That creature must succeed on a Strength save, or its speed is reduced to 0 until the start of your next turn."}]
        }
      },
      {
        "name": "Path of the Zealot",
        "description": "Warrior fueled by divine fury",
        "featuresByLevel": {
          "3": [{"name": "Divine Fury", "description": "While you're raging, the first creature you hit on each of your turns with a weapon attack takes extra damage equal to 1d6 + half your barbarian level. The extra damage is necrotic or radiant (your choice when you gain this feature)."}, {"name": "Warrior of the Gods", "description": "Your soul is marked for endless battle. If a spell, such as Raise Dead, has the sole effect of restoring you to life (but not undeath), the caster doesn't need material components to cast the spell on you."}],
          "6": [{"name": "Fanatical Focus", "description": "If you fail a saving throw while raging, you can reroll it, and you must use the new roll. You can use this ability only once per rage."}],
          "10": [{"name": "Zealous Presence", "description": "You can channel divine power to inspire zealotry in others. As a bonus action, you unleash a battle cry infused with divine energy. Up to ten other creatures of your choice within 60 feet of you that can hear you gain advantage on attack rolls and saving throws until the start of your next turn. Once you use this feature, you can't use it again until you finish a long rest."}],
          "14": [{"name": "Rage Beyond Death", "description": "While you're raging, having 0 hit points doesn't knock you unconscious. You still must make death saving throws, and you suffer the normal effects of taking damage while at 0 hit points. However, if you would die due to failing death saving throws, you don't die until your rage ends, and you die then only if you still have 0 hit points."}]
        }
      },
      {
        "name": "Path of the Beast",
        "description": "Transform into a bestial form when raging",
        "featuresByLevel": {
          "3": [{"name": "Form of the Beast", "description": "When you enter your rage, you can transform, revealing the bestial power within you. Until the rage ends, you manifest a natural weapon: Bite (1d8 piercing, regain HP equal to your proficiency bonus once per turn when you damage a creature at less than half your max HP), Claws (1d6 slashing each, can make one additional claw attack when you take the Attack action), or Tail (1d8 piercing, 10-foot reach, can use reaction to add 1d8 to your AC against one attack)."}],
          "6": [{"name": "Bestial Soul", "description": "The feral power within you increases. Your natural weapons count as magical. You can also alter your form to help you adapt to your surroundings. When you finish a short or long rest, choose one benefit: swimming speed equal to your walking speed and breathe underwater, climbing speed equal to your walking speed and climb difficult surfaces, or extend your jump distance by feet equal to your ability check."}],
          "10": [{"name": "Infectious Fury", "description": "When you hit a creature with your natural weapons while raging, the beast within you can curse your target with rabid fury. The target must succeed on a Wisdom saving throw (DC equal to 8 + your Constitution modifier + your proficiency bonus) or suffer one of the following effects (your choice): The target must use its reaction to make a melee attack against another creature of your choice, or the target takes 2d12 psychic damage. You can use this feature a number of times equal to your proficiency bonus."}],
          "14": [{"name": "Call the Hunt", "description": "When you enter your rage, you can choose a number of other willing creatures you can see within 30 feet of you equal to your Constitution modifier (minimum of one creature). You gain 5 temporary hit points for each creature that accepts this feature. Until the rage ends, the chosen creatures can use a d6 each time they deal damage with an attack."}]
        }
      },
      {
        "name": "Path of Wild Magic",
        "description": "Channel raw magical energy through rage",
        "featuresByLevel": {
          "3": [{"name": "Magic Awareness", "description": "As an action, you can open your awareness to the presence of concentrated magic. Until the end of your next turn, you know the location of any spell or magic item within 60 feet of you that isn't behind total cover. You can use this feature a number of times equal to your proficiency bonus."}, {"name": "Wild Surge", "description": "When you enter your rage, roll on the Wild Magic table to determine the magical effect produced. The effect lasts for the duration of your rage, unless otherwise specified."}],
          "6": [{"name": "Bolstering Magic", "description": "You can harness your wild magic to bolster yourself or a companion. As an action, you can touch one creature (which can be yourself) and confer one of the following benefits of your choice: For 10 minutes, the creature can roll a d3 whenever making an attack roll or ability check and add the number rolled to the d20 roll, or roll a d3. The creature regains one expended spell slot, the level of which equals the number rolled or lower (creature's choice). Once a creature receives this benefit, that creature can't receive it again until after a long rest."}],
          "10": [{"name": "Unstable Backlash", "description": "When you are imperiled during your rage, the magic within you can lash out. Immediately after you take damage or fail a saving throw while raging, you can use your reaction to roll on the Wild Magic table and immediately produce the effect rolled. This effect replaces your current Wild Magic effect."}],
          "14": [{"name": "Controlled Surge", "description": "Whenever you roll on the Wild Magic table, you can roll the die twice and choose which of the two effects to unleash. If you roll the same number on both dice, you can ignore the number and choose any effect on the table."}]
        }
      },
      {
        "name": "Path of the Mountain",
        "description": "Barbarians who follow this path draw strength from the mountains themselves, becoming as immovable and enduring as stone",
        "source": "Hoard of Heroes",
        "featuresByLevel": {
          "3": [{"name": "Mountain Stance", "description": "While raging, you can root yourself to the ground as a bonus action. Until the start of your next turn, you can't be moved against your will, you have advantage on Strength checks and saving throws, and any creature that hits you with a melee attack takes bludgeoning damage equal to your Constitution modifier."}, {"name": "Stone's Endurance", "description": "You can focus yourself to occasionally shrug off injury. When you take damage, you can use your reaction to roll a d12. Add your Constitution modifier to the number rolled, and reduce the damage by that total. You can use this feature a number of times equal to your proficiency bonus."}],
          "6": [{"name": "Avalanche Strike", "description": "While raging, once per turn when you hit a creature with a melee weapon attack, you can force that creature to make a Strength saving throw (DC equal to 8 + your proficiency bonus + your Strength modifier). On a failed save, the creature is knocked prone and takes additional bludgeoning damage equal to your rage damage bonus."}],
          "10": [{"name": "Heart of the Mountain", "description": "You gain resistance to cold damage. Additionally, while raging, you have resistance to all damage except psychic damage (this replaces the normal rage resistance to bludgeoning, piercing, and slashing damage). You also ignore difficult terrain."}],
          "14": [{"name": "Living Landslide", "description": "While raging, as an action, you can move up to your speed in a straight line. Each creature in your path must make a Dexterity saving throw (DC equal to 8 + your proficiency bonus + your Strength modifier). On a failed save, a creature takes 4d10 bludgeoning damage and is knocked prone. On a successful save, the creature takes half damage and isn't knocked prone. Once you use this feature, you can't use it again until you finish a short or long rest."}]
        }
      }
    ]
  },
  "bard": {
    "name": "Bard",
    "description": "An inspiring magician whose power echoes the music of creation",
    "hitDie": 8,
    "primaryAbility": ["cha"],
    "dumpStat": "str",
    "savingThrows": ["dex", "cha"],
    "skillChoices": 3,
    "skillOptions": ["acrobatics", "animal_handling", "arcana", "athletics", "deception", "history", "insight", "intimidation", "investigation", "medicine", "nature", "perception", "performance", "persuasion", "religion", "sleight_of_hand", "stealth", "survival"],
    "armorProficiencies": ["light"],
    "weaponProficiencies": ["simple", "hand crossbows", "longswords", "rapiers", "shortswords"],
    "toolProficiencies": ["Three musical instruments of your choice"],
    "startingEquipment": {
      "choices": [
        {
          "choose": 1,
          "from": [
            "Rapier",
            "Longsword",
            "Any Simple Weapon"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Diplomat's Pack",
            "Entertainer's Pack"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Lute",
            "Any Other Musical Instrument"
          ]
        }
      ],
      "given": ["Leather Armor", "Dagger"]
    },
    "startingGold": {
      "dice": "5d4",
      "multiplier": 10,
      "average": 125
    },
    "spellcasting": {
      "ability": "cha",
      "spellsKnown": "Limited known",
      "cantripsKnown": [2, 2, 2, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4],
      "spellsKnownByLevel": [4, 5, 6, 7, 8, 9, 10, 11, 12, 14, 15, 15, 16, 18, 19, 19, 20, 22, 22, 22]
    },
    "features": [
      "Spellcasting - You can cast bard spells using Charisma as your spellcasting ability",
      "Bardic Inspiration - You can inspire others through stirring words or music"
    ],
    "subclasses": [
      {
        "name": "College of Lore",
        "description": "Master of knowledge and secrets",
        "bonusProficiencies": ["Three skills of your choice"],
        "featuresByLevel": {
          "3": [{"name": "Bonus Proficiencies", "description": "You gain proficiency with three skills of your choice."}, {"name": "Cutting Words", "description": "When a creature that you can see within 60 feet of you makes an attack roll, an ability check, or a damage roll, you can use your reaction to expend one of your uses of Bardic Inspiration, rolling a Bardic Inspiration die and subtracting the number rolled from the creature's roll. You can choose to use this feature after the creature makes its roll, but before the DM determines whether the attack roll or ability check succeeds or fails, or before the creature deals its damage."}],
          "6": [{"name": "Additional Magical Secrets", "description": "You learn two spells of your choice from any class. A spell you choose must be of a level you can cast, or a cantrip. The chosen spells count as bard spells for you but don't count against the number of bard spells you know."}],
          "14": [{"name": "Peerless Skill", "description": "When you make an ability check, you can expend one use of Bardic Inspiration. Roll a Bardic Inspiration die and add the number rolled to your ability check. You can choose to do so after you roll the die for the ability check, but before the DM tells you whether you succeed or fail."}]
        }
      },
      {
        "name": "College of Valor",
        "description": "Warrior poet who inspires allies in combat",
        "bonusProficiencies": ["Medium Armor", "Shields", "Martial Weapons"],
        "featuresByLevel": {
          "3": [{"name": "Bonus Proficiencies", "description": "You gain proficiency with medium armor, shields, and martial weapons."}, {"name": "Combat Inspiration", "description": "A creature that has a Bardic Inspiration die from you can roll that die and add the number rolled to a weapon damage roll it just made. Alternatively, when an attack roll is made against the creature, it can use its reaction to roll the Bardic Inspiration die and add the number rolled to its AC against that attack."}],
          "6": [{"name": "Extra Attack", "description": "You can attack twice, instead of once, whenever you take the Attack action on your turn."}],
          "14": [{"name": "Battle Magic", "description": "When you use your action to cast a bard spell, you can make one weapon attack as a bonus action."}]
        }
      },
      {
        "name": "College of Glamour",
        "description": "Beguiling performer who uses fey magic",
        "featuresByLevel": {
          "3": [{"name": "Mantle of Inspiration", "description": "As a bonus action, you can expend one use of your Bardic Inspiration to grant yourself a wondrous appearance. When you do so, choose a number of creatures you can see and who can see you within 60 feet of you, up to a number equal to your Charisma modifier (minimum of one). Each of them gains 5 temporary hit points. When a creature gains these temporary hit points, it can immediately use its reaction to move up to its speed, without provoking opportunity attacks. The number of temporary hit points increases when you reach certain levels: 8 at 5th level, 11 at 10th level, and 14 at 15th level."}, {"name": "Enthralling Performance", "description": "You can charge your performance with seductive, fey magic. If you perform for at least 1 minute, you can attempt to inspire wonder in your audience. At the end of the performance, choose a number of humanoids within 60 feet of you who watched and listened to all of it, up to a number equal to your Charisma modifier (minimum of one). Each target must succeed on a Wisdom saving throw or be charmed by you."}],
          "6": [{"name": "Mantle of Majesty", "description": "You gain the ability to cloak yourself in a fey magic that makes others want to serve you. As a bonus action, you cast Command, without expending a spell slot, and you take on an appearance of unearthly beauty for 1 minute or until your concentration ends. During this time, you can cast Command as a bonus action on each of your turns, without expending a spell slot. Any creature charmed by you automatically fails its saving throw against the Command you cast with this feature."}],
          "14": [{"name": "Unbreakable Majesty", "description": "You gain an otherworldly aspect to your appearance that makes you look more lovely and fierce. As a bonus action, you can assume a magically majestic presence for 1 minute or until you are incapacitated. For the duration, whenever any creature tries to attack you for the first time on a turn, the attacker must make a Charisma saving throw. On a failed save, it can't attack you on this turn, and it must choose a new target for its attack or the attack is wasted. On a successful save, it can attack you on this turn, but it has disadvantage on any saving throw it makes against your spells on your next turn."}]
        }
      },
      {
        "name": "College of Swords",
        "description": "Blade master who combines steel and song",
        "bonusProficiencies": ["Medium Armor", "Scimitar"],
        "featuresByLevel": {
          "3": [{"name": "Bonus Proficiencies", "description": "You gain proficiency with medium armor and the scimitar. If you're proficient with a simple or martial melee weapon, you can use it as a spellcasting focus for your bard spells."}, {"name": "Fighting Style", "description": "Choose a fighting style: Dueling (+2 damage with one-handed melee weapon when no other weapon) or Two-Weapon Fighting (add ability modifier to off-hand damage)."}, {"name": "Blade Flourish", "description": "Whenever you take the Attack action on your turn, your walking speed increases by 10 feet until the end of the turn, and if a weapon attack that you make as part of this action hits a creature, you can use one of the following Blade Flourish options of your choice. You can use only one Blade Flourish option per turn: Defensive Flourish, Slashing Flourish, or Mobile Flourish."}],
          "6": [{"name": "Extra Attack", "description": "You can attack twice, instead of once, whenever you take the Attack action on your turn."}],
          "14": [{"name": "Master's Flourish", "description": "Whenever you use a Blade Flourish option, you can roll a d6 and use it instead of expending a Bardic Inspiration die."}]
        }
      },
      {
        "name": "College of Whispers",
        "description": "Master of fear and manipulation",
        "featuresByLevel": {
          "3": [{"name": "Psychic Blades", "description": "When you hit a creature with a weapon attack, you can expend one use of your Bardic Inspiration to deal an additional 2d6 psychic damage to that target. You can do so only once per round on your turn. The psychic damage increases when you reach certain levels: 3d6 at 5th level, 5d6 at 10th level, and 8d6 at 15th level."}],
          "6": [{"name": "Words of Terror", "description": "If you speak to a humanoid alone for at least 1 minute, you can attempt to seed paranoia in its mind. At the end of the conversation, the target must succeed on a Wisdom saving throw or be frightened of you or another creature of your choice. The target is frightened in this way for 1 hour, until it is attacked or damaged, or until it witnesses its allies being attacked or damaged. If the target succeeds on its saving throw, the target has no hint that you tried to frighten it."}],
          "14": [{"name": "Mantle of Whispers", "description": "When a humanoid dies within 30 feet of you, you can magically capture its shadow using your reaction. You retain this shadow until you use it or you finish a long rest. You can use the shadow as an action. When you do so, it vanishes, magically transforming into a disguise that appears on you. You now look like the dead person, but healthy and alive. This disguise lasts for 1 hour or until you end it as a bonus action."}, {"name": "Shadow Lore", "description": "As an action, you magically whisper a phrase that only one creature of your choice within 30 feet of you can hear. The target must make a Wisdom saving throw against your spell save DC. It automatically succeeds if it doesn't share a language with you or if it can't hear you. On a successful save, your whisper sounds like unintelligible mumbling and has no effect. On a failed save, the target is charmed by you for the next 8 hours or until you or your allies attack it, damage it, or force it to make a saving throw. It interprets the whispers as a description of its most mortifying secret."}]
        }
      },
      {
        "name": "College of Eloquence",
        "description": "Master orator whose words sway minds",
        "featuresByLevel": {
          "3": [{"name": "Silver Tongue", "description": "You are a master at saying the right thing at the right time. When you make a Charisma (Persuasion) or Charisma (Deception) check, you can treat a d20 roll of 9 or lower as a 10."}, {"name": "Unsettling Words", "description": "You can spin words laced with magic that unsettle a creature and cause it to doubt itself. As a bonus action, you can expend one use of your Bardic Inspiration and choose one creature you can see within 60 feet of you. Roll the Bardic Inspiration die. The creature must subtract the number rolled from the next saving throw it makes before the start of your next turn."}],
          "6": [{"name": "Unfailing Inspiration", "description": "Your inspiring words are so persuasive that others feel driven to succeed. When a creature adds one of your Bardic Inspiration dice to its ability check, attack roll, or saving throw and the roll fails, the creature can keep the Bardic Inspiration die."}, {"name": "Universal Speech", "description": "You have gained the ability to make your speech intelligible to any creature. As an action, choose one or more creatures within 60 feet of you, up to a number equal to your Charisma modifier (minimum of one creature). The chosen creatures can magically understand you, regardless of the language you speak, for 1 hour."}],
          "14": [{"name": "Infectious Inspiration", "description": "When you successfully inspire someone, the power of your eloquence can now spread to someone else. When a creature within 60 feet of you adds one of your Bardic Inspiration dice to its ability check, attack roll, or saving throw and the roll succeeds, you can use your reaction to encourage a different creature (other than yourself) that can hear you within 60 feet of you, giving it a Bardic Inspiration die without expending any of your Bardic Inspiration uses."}]
        }
      },
      {
        "name": "College of Creation",
        "description": "Channel the Song of Creation to manifest reality",
        "featuresByLevel": {
          "3": [{"name": "Mote of Potential", "description": "When you give a creature a Bardic Inspiration die, you can utter a note from the Song of Creation to create a Tiny mote of potential, which orbits within 5 feet of that creature. The mote is intangible and invulnerable, and it lasts until the Bardic Inspiration die is lost. The mote looks like a musical note, a star, a flower, or another symbol of art or life that you choose. Ability Check: Roll the Bardic Inspiration die twice and use the higher roll. Attack Roll: The mote thunderously shatters and each creature of your choice within 5 feet must make a Constitution save or take thunder damage equal to the roll of the Bardic Inspiration die. Saving Throw: Roll the Bardic Inspiration die twice and use the higher roll."}, {"name": "Performance of Creation", "description": "As an action, you can channel the magic of the Song of Creation to create one nonmagical item of your choice in an unoccupied space within 10 feet of you. The item must appear on a surface or in a liquid that can support it. The gp value of the item can't be more than 20 times your bard level, and the item must be Medium or smaller. The item glimmers softly, and a creature can faintly hear music when touching it. The created item disappears after a number of hours equal to your proficiency bonus."}],
          "6": [{"name": "Animating Performance", "description": "As an action, you can animate one Large or smaller nonmagical item within 30 feet of you that isn't being worn or carried. The animate item uses the Dancing Item stat block. It is friendly to you and your companions and obeys your commands. It lasts for 1 hour, until it is reduced to 0 hit points, or until you die. You can have only one item animated by this feature at a time."}],
          "14": [{"name": "Creative Crescendo", "description": "When you use your Performance of Creation feature, you can create more than one item at once. The number of items equals your Charisma modifier (minimum of two items). If you create an item that would exceed that number, you choose which of the previously created items disappears. Only one of these items can be of the maximum size you can create; the rest must be Small or Tiny."}]
        }
      },
      {
        "name": "College of Spirits",
        "description": "Channel spirits through tales and séances",
        "featuresByLevel": {
          "3": [{"name": "Guiding Whispers", "description": "You can reach out to spirits to guide you and others. You learn the Guidance cantrip, which doesn't count against the number of bard cantrips you know. For you, it has a range of 60 feet when you cast it."}, {"name": "Spiritual Focus", "description": "You can use a candle, crystal ball, skull, spirit board, or tarokka deck as a spellcasting focus for your bard spells. When you cast a bard spell that deals damage or restores hit points through the focus, roll a d6, and you gain a bonus to one damage or healing roll of the spell equal to the number rolled."}, {"name": "Tales from Beyond", "description": "You reach out to spirits who tell their tales through you. While you are holding your Spiritual Focus, you can use a bonus action to expend one use of your Bardic Inspiration and roll on the Spirit Tales table using your Bardic Inspiration die to determine the tale the spirits direct you to tell. You retain the tale in mind until you bestow the tale's effect or you finish a short or long rest."}],
          "6": [{"name": "Spirit Session", "description": "Spirits provide you with supernatural insights. You can conduct an hour-long ritual channeling spirits using your Spiritual Focus. You can conduct the ritual during a short or long rest, and it can be done at the same time. At the end of the ritual, you temporarily learn one spell of your choice from any class. The spell must be of a level equal to the number of creatures that conducted the ritual or less, and it must be of a level you can cast, and it must be in the school of divination or necromancy. The spell counts as a bard spell for you but doesn't count against the number of bard spells you know."}],
          "14": [{"name": "Mystical Connection", "description": "You now have the ability to nudge the spirits to a tale you want. Whenever you roll on the Spirit Tales table, you can roll the die twice and choose which of the two effects to bestow. If you roll the same number on both dice, you can ignore the number and choose any effect on the table."}]
        }
      },
      {
        "name": "College of Mirrors",
        "description": "Bards of the College of Mirrors use illusion magic to create duplicates of themselves, confusing enemies and performing impossible feats",
        "source": "Hoard of Heroes",
        "featuresByLevel": {
          "3": [{"name": "Mirror Image Mastery", "description": "You learn the Mirror Image spell, which doesn't count against the number of bard spells you know. When you cast Mirror Image, you create four duplicates instead of three, and each duplicate has AC equal to 10 + your Dexterity modifier + your proficiency bonus."}, {"name": "Reflective Performance", "description": "When you use your Bardic Inspiration, you can create an illusory duplicate of the target that lasts until the start of your next turn. The duplicate appears in an unoccupied space within 5 feet of the target and can distract enemies. Attack rolls against the target have disadvantage while the duplicate exists."}],
          "6": [{"name": "Hall of Mirrors", "description": "As an action, you can expend a use of Bardic Inspiration to create an illusory zone of mirrors in a 20-foot cube centered on a point you can see within 60 feet. The area becomes difficult terrain for creatures other than you. Creatures in the area have disadvantage on attack rolls, and you have advantage on attack rolls against creatures in the area. The zone lasts for 1 minute or until you lose concentration (as if concentrating on a spell)."}],
          "14": [{"name": "Perfect Reflection", "description": "When a creature you can see targets you with an attack, you can use your reaction to swap places with one of your Mirror Image duplicates. The attack targets the duplicate instead. Additionally, when your last Mirror Image duplicate is destroyed, you can use your reaction to cast Mirror Image without expending a spell slot. You can use this feature a number of times equal to your Charisma modifier, and you regain all expended uses when you finish a long rest."}]
        }
      }
    ]
  },
  "cleric": {
    "name": "Cleric",
    "description": "A priestly champion who wields divine magic in service of a higher power",
    "hitDie": 8,
    "primaryAbility": ["wis"],
    "dumpStat": "int",
    "savingThrows": ["wis", "cha"],
    "skillChoices": 2,
    "skillOptions": ["history", "insight", "medicine", "persuasion", "religion"],
    "armorProficiencies": ["light", "medium", "shields"],
    "weaponProficiencies": ["simple"],
    "startingEquipment": {
      "choices": [
        {
          "choose": 1,
          "from": [
            "Mace",
            "Warhammer (if proficient)"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Scale Mail",
            "Leather Armor",
            "Chain Mail (if proficient)"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Light Crossbow and 20 Bolts",
            "Any Simple Weapon"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Priest's Pack",
            "Explorer's Pack"
          ]
        }
      ],
      "given": ["Shield", "Holy Symbol"]
    },
    "startingGold": {
      "dice": "5d4",
      "multiplier": 10,
      "average": 125
    },
    "spellcasting": {
      "ability": "wis",
      "spellsKnown": "All prepared",
      "cantripsKnown": [3, 3, 3, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
    },
    "features": [
      "Spellcasting - You can cast cleric spells using Wisdom as your spellcasting ability",
      "Divine Domain - Choose a domain related to your deity"
    ],
    "subclasses": [
      {
        "name": "Life Domain",
        "description": "Master of healing and preservation of life",
        "bonusProficiencies": ["Heavy Armor"],
        "domainSpells": {
          "1": ["Bless", "Cure Wounds"],
          "3": ["Lesser Restoration", "Spiritual Weapon"],
          "5": ["Beacon of Hope", "Revivify"],
          "7": ["Death Ward", "Guardian of Faith"],
          "9": ["Mass Cure Wounds", "Raise Dead"]
        },
        "featuresByLevel": {
          "1": [{"name": "Bonus Proficiency", "description": "You gain proficiency with heavy armor."}, {"name": "Disciple of Life", "description": "Your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points, the creature regains additional hit points equal to 2 + the spell's level."}],
          "2": [{"name": "Channel Divinity: Preserve Life", "description": "As an action, you present your holy symbol and evoke healing energy that restores a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet, dividing those hit points among them (can't restore more than half their max HP)."}],
          "6": [{"name": "Blessed Healer", "description": "When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell's level."}],
          "8": [{"name": "Divine Strike", "description": "Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage. At 14th level, the extra damage increases to 2d8."}],
          "17": [{"name": "Supreme Healing", "description": "When you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die."}]
        }
      },
      {
        "name": "War Domain",
        "description": "Warrior priest who excels in battle",
        "bonusProficiencies": ["Heavy Armor", "Martial Weapons"],
        "domainSpells": {
          "1": ["Divine Favor", "Shield of Faith"],
          "3": ["Magic Weapon", "Spiritual Weapon"],
          "5": ["Crusader's Mantle", "Spirit Guardians"],
          "7": ["Freedom of Movement", "Stoneskin"],
          "9": ["Flame Strike", "Hold Monster"]
        },
        "featuresByLevel": {
          "1": [{"name": "Bonus Proficiencies", "description": "You gain proficiency with martial weapons and heavy armor."}, {"name": "War Priest", "description": "When you use the Attack action, you can make one weapon attack as a bonus action. You can use this feature a number of times equal to your Wisdom modifier (minimum once), regaining all uses after a long rest."}],
          "2": [{"name": "Channel Divinity: Guided Strike", "description": "When you make an attack roll, you can use your Channel Divinity to gain a +10 bonus to the roll. You make this choice after you see the roll, but before the DM says whether the attack hits or misses."}],
          "6": [{"name": "Channel Divinity: War God's Blessing", "description": "When a creature within 30 feet makes an attack roll, you can use your reaction to grant that creature a +10 bonus to the roll, using your Channel Divinity."}],
          "8": [{"name": "Divine Strike", "description": "Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type dealt by the weapon. At 14th level, the extra damage increases to 2d8."}],
          "17": [{"name": "Avatar of Battle", "description": "You gain resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks."}]
        }
      },
      {
        "name": "Trickery Domain",
        "description": "Master of illusion and deception",
        "bonusProficiencies": [],
        "domainSpells": {
          "1": ["Charm Person", "Disguise Self"],
          "3": ["Mirror Image", "Pass without Trace"],
          "5": ["Blink", "Dispel Magic"],
          "7": ["Dimension Door", "Polymorph"],
          "9": ["Dominate Person", "Modify Memory"]
        },
        "featuresByLevel": {
          "1": [{"name": "Blessing of the Trickster", "description": "You can use your action to touch a willing creature other than yourself to give it advantage on Dexterity (Stealth) checks. This blessing lasts for 1 hour or until you use this feature again."}],
          "2": [{"name": "Channel Divinity: Invoke Duplicity", "description": "As an action, you create a perfect illusion of yourself that lasts for 1 minute. You can cast spells as though you were in the illusion's space and gain advantage on attack rolls against creatures within 5 feet of both you and the illusion."}],
          "6": [{"name": "Channel Divinity: Cloak of Shadows", "description": "As an action, you become invisible until the end of your next turn. You become visible if you attack or cast a spell."}],
          "8": [{"name": "Divine Strike", "description": "Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 poison damage. At 14th level, the extra damage increases to 2d8."}],
          "17": [{"name": "Improved Duplicity", "description": "You can create up to four duplicates of yourself instead of one when you use Invoke Duplicity. You can move any number of them up to 30 feet as a bonus action."}]
        }
      },
      {
        "name": "Knowledge Domain",
        "description": "Scholar who collects and shares divine knowledge",
        "bonusProficiencies": ["Two languages of your choice"],
        "bonusSkills": ["Choose two from: Arcana, History, Nature, Religion (expertise)"],
        "domainSpells": {
          "1": ["Command", "Identify"],
          "3": ["Augury", "Suggestion"],
          "5": ["Nondetection", "Speak with Dead"],
          "7": ["Arcane Eye", "Confusion"],
          "9": ["Legend Lore", "Scrying"]
        },
        "featuresByLevel": {
          "1": [{"name": "Blessings of Knowledge", "description": "You learn two languages of your choice. You also become proficient in two skills of your choice from: Arcana, History, Nature, or Religion. Your proficiency bonus is doubled for checks using either skill."}],
          "2": [{"name": "Channel Divinity: Knowledge of the Ages", "description": "As an action, you gain proficiency with one skill or tool of your choice for 10 minutes."}],
          "6": [{"name": "Channel Divinity: Read Thoughts", "description": "You can use your Channel Divinity to read a creature's thoughts. You can then use your access to the creature's mind to command it (as Suggestion spell)."}],
          "8": [{"name": "Potent Spellcasting", "description": "You add your Wisdom modifier to the damage you deal with any cleric cantrip."}],
          "17": [{"name": "Visions of the Past", "description": "You can call up visions of the past. Object Reading or Area Reading for up to a number of minutes equal to your Wisdom score."}]
        }
      },
      {
        "name": "Light Domain",
        "description": "Bearer of divine radiance who banishes darkness",
        "bonusProficiencies": [],
        "bonusCantrips": ["Light"],
        "domainSpells": {
          "1": ["Burning Hands", "Faerie Fire"],
          "3": ["Flaming Sphere", "Scorching Ray"],
          "5": ["Daylight", "Fireball"],
          "7": ["Guardian of Faith", "Wall of Fire"],
          "9": ["Flame Strike", "Scrying"]
        },
        "featuresByLevel": {
          "1": [{"name": "Bonus Cantrip", "description": "You gain the Light cantrip if you don't already know it."}, {"name": "Warding Flare", "description": "When you are attacked by a creature within 30 feet that you can see, you can use your reaction to impose disadvantage on the attack roll. You can use this feature a number of times equal to your Wisdom modifier (minimum once)."}],
          "2": [{"name": "Channel Divinity: Radiance of the Dawn", "description": "As an action, you present your holy symbol and dispel magical darkness within 30 feet. Each hostile creature within 30 feet must make a Constitution saving throw, taking 2d10 + your cleric level radiant damage on a failed save, or half as much on a successful one."}],
          "6": [{"name": "Improved Flare", "description": "You can use your Warding Flare feature when a creature you can see within 30 feet attacks a creature other than you."}],
          "8": [{"name": "Potent Spellcasting", "description": "You add your Wisdom modifier to the damage you deal with any cleric cantrip."}],
          "17": [{"name": "Corona of Light", "description": "As an action, you activate an aura of sunlight that lasts for 1 minute. You emit bright light in a 60-foot radius and dim light 30 feet beyond that. Enemies in the bright light have disadvantage on saving throws against spells that deal fire or radiant damage."}]
        }
      },
      {
        "name": "Nature Domain",
        "description": "Servant of the gods of nature, flora, and fauna",
        "bonusProficiencies": ["Heavy Armor"],
        "bonusSkills": ["Choose one from: Animal Handling, Nature, Survival"],
        "domainSpells": {
          "1": ["Animal Friendship", "Speak with Animals"],
          "3": ["Barkskin", "Spike Growth"],
          "5": ["Plant Growth", "Wind Wall"],
          "7": ["Dominate Beast", "Grasping Vine"],
          "9": ["Insect Plague", "Tree Stride"]
        },
        "featuresByLevel": {
          "1": [{"name": "Acolyte of Nature", "description": "You learn one druid cantrip of your choice. You also gain proficiency in one of the following skills: Animal Handling, Nature, or Survival."}, {"name": "Bonus Proficiency", "description": "You gain proficiency with heavy armor."}],
          "2": [{"name": "Channel Divinity: Charm Animals and Plants", "description": "As an action, you present your holy symbol and invoke the name of your deity. Each beast or plant creature that can see you within 30 feet must make a Wisdom saving throw. On a failed save, the creature is charmed by you for 1 minute or until it takes damage."}],
          "6": [{"name": "Dampen Elements", "description": "When you or a creature within 30 feet takes acid, cold, fire, lightning, or thunder damage, you can use your reaction to grant resistance to that damage."}],
          "8": [{"name": "Divine Strike", "description": "Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 cold, fire, or lightning damage (your choice). At 14th level, the extra damage increases to 2d8."}],
          "17": [{"name": "Master of Nature", "description": "You gain the ability to command animals and plant creatures. While creatures are charmed by your Charm Animals and Plants feature, you can take a bonus action to verbally command what they do on their next turn."}]
        }
      },
      {
        "name": "Tempest Domain",
        "description": "Wrath of the storm, commanding thunder and lightning",
        "bonusProficiencies": ["Heavy Armor", "Martial Weapons"],
        "domainSpells": {
          "1": ["Fog Cloud", "Thunderwave"],
          "3": ["Gust of Wind", "Shatter"],
          "5": ["Call Lightning", "Sleet Storm"],
          "7": ["Control Water", "Ice Storm"],
          "9": ["Destructive Wave", "Insect Plague"]
        },
        "featuresByLevel": {
          "1": [{"name": "Bonus Proficiencies", "description": "You gain proficiency with martial weapons and heavy armor."}, {"name": "Wrath of the Storm", "description": "When a creature within 5 feet of you that you can see hits you with an attack, you can use your reaction to cause the creature to make a Dexterity saving throw. The creature takes 2d8 lightning or thunder damage (your choice) on a failed save, or half as much on a successful one. You can use this feature a number of times equal to your Wisdom modifier (minimum once)."}],
          "2": [{"name": "Channel Divinity: Destructive Wrath", "description": "When you roll lightning or thunder damage, you can use your Channel Divinity to deal maximum damage instead of rolling."}],
          "6": [{"name": "Thunderbolt Strike", "description": "When you deal lightning damage to a Large or smaller creature, you can also push it up to 10 feet away from you."}],
          "8": [{"name": "Divine Strike", "description": "Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 thunder damage. At 14th level, the extra damage increases to 2d8."}],
          "17": [{"name": "Stormborn", "description": "You have a flying speed equal to your current walking speed whenever you are not underground or indoors."}]
        }
      },
      {
        "name": "Forge Domain",
        "description": "Divine smith who creates magical items",
        "bonusProficiencies": ["Heavy Armor", "Smith's Tools"],
        "domainSpells": {
          "1": ["Identify", "Searing Smite"],
          "3": ["Heat Metal", "Magic Weapon"],
          "5": ["Elemental Weapon", "Protection from Energy"],
          "7": ["Fabricate", "Wall of Fire"],
          "9": ["Animate Objects", "Creation"]
        },
        "featuresByLevel": {
          "1": [{"name": "Bonus Proficiencies", "description": "You gain proficiency with heavy armor and smith's tools."}, {"name": "Blessing of the Forge", "description": "At the end of a long rest, you can touch one nonmagical object that is a suit of armor or a simple or martial weapon. Until the end of your next long rest or until you die, the object becomes a magic item, granting a +1 bonus to AC (if armor) or attack and damage rolls (if weapon)."}],
          "2": [{"name": "Channel Divinity: Artisan's Blessing", "description": "You conduct an hour-long ritual to craft a nonmagical item that must include some metal: a simple or martial weapon, a suit of armor, ten pieces of ammunition, a set of tools, or another metal object. At the end of the ritual, you create the item (worth up to 100 gp)."}],
          "6": [{"name": "Soul of the Forge", "description": "You gain resistance to fire damage. While wearing heavy armor, you gain a +1 bonus to AC."}],
          "8": [{"name": "Divine Strike", "description": "Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 fire damage. At 14th level, the extra damage increases to 2d8."}],
          "17": [{"name": "Saint of Forge and Fire", "description": "You gain immunity to fire damage. While wearing heavy armor, you have resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks."}]
        }
      },
      {
        "name": "Grave Domain",
        "description": "Guardian of the line between life and death",
        "bonusProficiencies": [],
        "domainSpells": {
          "1": ["Bane", "False Life"],
          "3": ["Gentle Repose", "Ray of Enfeeblement"],
          "5": ["Revivify", "Vampiric Touch"],
          "7": ["Blight", "Death Ward"],
          "9": ["Antilife Shell", "Raise Dead"]
        },
        "featuresByLevel": {
          "1": [{"name": "Circle of Mortality", "description": "When you would normally roll one or more dice to restore hit points with a spell to a creature at 0 hit points, you instead use the highest number possible for each die. In addition, you learn the Spare the Dying cantrip, which has a range of 30 feet for you."}, {"name": "Eyes of the Grave", "description": "As an action, you can magically sense the presence of undead within 60 feet that aren't behind total cover. You can use this feature a number of times equal to your Wisdom modifier."}],
          "2": [{"name": "Channel Divinity: Path to the Grave", "description": "As an action, you choose one creature you can see within 30 feet, cursing it until the end of your next turn. The next time you or an ally hits the cursed creature with an attack, the creature has vulnerability to all of that attack's damage."}],
          "6": [{"name": "Sentinel at Death's Door", "description": "As a reaction when you or a creature within 30 feet suffers a critical hit, you can turn that hit into a normal hit. You can use this feature a number of times equal to your Wisdom modifier."}],
          "8": [{"name": "Potent Spellcasting", "description": "You add your Wisdom modifier to the damage you deal with any cleric cantrip."}],
          "17": [{"name": "Keeper of Souls", "description": "When an enemy you can see dies within 60 feet of you, you or one creature of your choice within 60 feet regains hit points equal to the enemy's number of Hit Dice. You can use this feature only if you aren't incapacitated."}]
        }
      },
      {
        "name": "Order Domain",
        "description": "Voice of divine authority who commands obedience",
        "bonusProficiencies": ["Heavy Armor", "Intimidation or Persuasion"],
        "domainSpells": {
          "1": ["Command", "Heroism"],
          "3": ["Hold Person", "Zone of Truth"],
          "5": ["Mass Healing Word", "Slow"],
          "7": ["Compulsion", "Locate Creature"],
          "9": ["Commune", "Dominate Person"]
        },
        "featuresByLevel": {
          "1": [{"name": "Bonus Proficiencies", "description": "You gain proficiency with heavy armor. You also gain proficiency in the Intimidation or Persuasion skill (your choice)."}, {"name": "Voice of Authority", "description": "If you cast a spell with a spell slot of 1st level or higher and target an ally, that ally can use their reaction immediately after the spell to make one weapon attack against a creature of your choice that you can see."}],
          "2": [{"name": "Channel Divinity: Order's Demand", "description": "As an action, you present your holy symbol and each creature of your choice that can see or hear you within 30 feet must succeed on a Wisdom saving throw or be charmed by you until the end of your next turn or until it takes damage. You can also cause any charmed creatures to drop what they are holding."}],
          "6": [{"name": "Embodiment of the Law", "description": "If you cast a spell of the enchantment school using a spell slot of 1st level or higher, you can change the spell's casting time to 1 bonus action for this casting (if it's normally 1 action). You can use this feature a number of times equal to your Wisdom modifier."}],
          "8": [{"name": "Divine Strike", "description": "Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 psychic damage. At 14th level, the extra damage increases to 2d8."}],
          "17": [{"name": "Order's Wrath", "description": "Enemies you deal Divine Strike damage to are cursed until the start of your next turn. The next time an ally hits the cursed creature with an attack, the target also takes 2d8 psychic damage, and the curse ends."}]
        }
      },
      {
        "name": "Peace Domain",
        "description": "Emissary of harmony who strengthens bonds",
        "bonusProficiencies": [],
        "bonusSkills": ["Insight, Performance, or Persuasion"],
        "domainSpells": {
          "1": ["Heroism", "Sanctuary"],
          "3": ["Aid", "Warding Bond"],
          "5": ["Beacon of Hope", "Sending"],
          "7": ["Aura of Purity", "Otiluke's Resilient Sphere"],
          "9": ["Greater Restoration", "Rary's Telepathic Bond"]
        },
        "featuresByLevel": {
          "1": [{"name": "Implement of Peace", "description": "You gain proficiency in the Insight, Performance, or Persuasion skill (your choice)."}, {"name": "Emboldening Bond", "description": "You can forge an empowering bond among people. As an action, choose a number of willing creatures within 30 feet equal to your proficiency bonus. For 10 minutes, when a bonded creature makes an attack roll, ability check, or saving throw, it can add a d4 to the roll (once per turn). You can use this feature a number of times equal to your proficiency bonus."}],
          "2": [{"name": "Channel Divinity: Balm of Peace", "description": "As an action, you move up to your speed without provoking opportunity attacks, and when you move within 5 feet of any other creature, you can restore a number of hit points to that creature equal to 2d6 + your Wisdom modifier. A creature can receive this healing only once."}],
          "6": [{"name": "Protective Bond", "description": "When a creature affected by your Emboldening Bond is about to take damage, a second bonded creature within 30 feet can use its reaction to teleport to an unoccupied space within 5 feet of the first creature and take all the damage instead."}],
          "8": [{"name": "Potent Spellcasting", "description": "You add your Wisdom modifier to the damage you deal with any cleric cantrip."}],
          "17": [{"name": "Expansive Bond", "description": "The benefits of your Emboldening Bond and Protective Bond features now work when the creatures are within 60 feet of each other. Moreover, when a creature uses Protective Bond to take someone else's damage, the creature has resistance to that damage."}]
        }
      },
      {
        "name": "Twilight Domain",
        "description": "Guardian who brings comfort and protection in darkness",
        "bonusProficiencies": ["Heavy Armor", "Martial Weapons"],
        "darkvision": 300,
        "domainSpells": {
          "1": ["Faerie Fire", "Sleep"],
          "3": ["Moonbeam", "See Invisibility"],
          "5": ["Aura of Vitality", "Leomund's Tiny Hut"],
          "7": ["Aura of Life", "Greater Invisibility"],
          "9": ["Circle of Power", "Mislead"]
        },
        "featuresByLevel": {
          "1": [{"name": "Bonus Proficiencies", "description": "You gain proficiency with martial weapons and heavy armor."}, {"name": "Eyes of Night", "description": "You can see through the deepest gloom. You have darkvision out to a range of 300 feet. As an action, you can magically share this darkvision with willing creatures you can see within 10 feet (up to your Wisdom modifier). The shared darkvision lasts for 1 hour."}],
          "2": [{"name": "Channel Divinity: Twilight Sanctuary", "description": "As an action, you present your holy symbol and a sphere of twilight emanates from you (30-foot radius). It lasts for 1 minute, moving with you. At the end of each of your turns, each creature (including you) of your choice in the sphere gains temporary hit points equal to 1d6 + your cleric level, or ends one effect causing it to be charmed or frightened."}],
          "6": [{"name": "Steps of Night", "description": "You can draw on the mystical power of night to rise into the air. As a bonus action when you are in dim light or darkness, you can magically give yourself a flying speed equal to your walking speed for 1 minute. You can use this feature a number of times equal to your proficiency bonus."}],
          "8": [{"name": "Divine Strike", "description": "Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage. At 14th level, the extra damage increases to 2d8."}],
          "17": [{"name": "Twilight Shroud", "description": "The twilight that you summon offers a protective embrace: you and your allies have half cover while in the sphere created by your Twilight Sanctuary."}]
        }
      },
      {
        "name": "Death Domain",
        "description": "Dark priest who wields necrotic power",
        "bonusProficiencies": ["Martial Weapons"],
        "domainSpells": {
          "1": ["False Life", "Ray of Sickness"],
          "3": ["Blindness/Deafness", "Ray of Enfeeblement"],
          "5": ["Animate Dead", "Vampiric Touch"],
          "7": ["Blight", "Death Ward"],
          "9": ["Antilife Shell", "Cloudkill"]
        },
        "featuresByLevel": {
          "1": [{"name": "Bonus Proficiency", "description": "You gain proficiency with martial weapons."}, {"name": "Reaper", "description": "You learn one necromancy cantrip of your choice from any spell list. When you cast a necromancy cantrip that normally targets only one creature, the spell can instead target two creatures within range and within 5 feet of each other."}],
          "2": [{"name": "Channel Divinity: Touch of Death", "description": "When you hit a creature with a melee attack, you can use your Channel Divinity to deal extra necrotic damage equal to 5 + twice your cleric level."}],
          "6": [{"name": "Inescapable Destruction", "description": "Your ability to channel negative energy becomes more potent. Necrotic damage dealt by your cleric spells and Channel Divinity options ignores resistance to necrotic damage."}],
          "8": [{"name": "Divine Strike", "description": "Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 necrotic damage. At 14th level, the extra damage increases to 2d8."}],
          "17": [{"name": "Improved Reaper", "description": "When you cast a necromancy spell of 1st through 5th level that targets only one creature, the spell can instead target two creatures within range and within 5 feet of each other."}]
        }
      },
      {
        "name": "Revelry Domain",
        "description": "Clerics of the Revelry Domain serve deities of celebration, joy, wine, and festivity, spreading merriment and using the power of revelry to bolster allies and confound enemies",
        "source": "Hoard of Heroes",
        "domainSpells": {
          "1": ["Charm Person", "Heroism"],
          "3": ["Calm Emotions", "Suggestion"],
          "5": ["Hypnotic Pattern", "Create Food and Water"],
          "7": ["Compulsion", "Confusion"],
          "9": ["Dream", "Modify Memory"]
        },
        "featuresByLevel": {
          "1": [{"name": "Bonus Proficiency", "description": "You gain proficiency in the Performance skill and with brewer's supplies."}, {"name": "Intoxicating Presence", "description": "Your divine connection to revelry allows you to spread joy. As an action, choose a creature within 30 feet. That creature must make a Wisdom saving throw or become charmed by you for 1 minute. While charmed in this way, the creature has disadvantage on Wisdom checks and its speed is reduced by 10 feet. The creature can repeat the saving throw at the end of each of its turns. You can use this feature a number of times equal to your Wisdom modifier."}],
          "2": [{"name": "Channel Divinity: Toast to Good Fortune", "description": "As an action, you raise a drink (or mime the gesture) and invoke your deity's blessing. Choose a number of creatures you can see within 30 feet equal to your Wisdom modifier (minimum 1). Each creature gains temporary hit points equal to 2d6 + your cleric level and has advantage on their next attack roll or saving throw made within the next minute."}],
          "6": [{"name": "Spirit of the Party", "description": "You and allies within 10 feet of you are immune to the frightened condition while you are conscious. Additionally, when you or an ally within 10 feet fails a saving throw against being charmed, you can use your reaction to grant advantage on a reroll."}],
          "8": [{"name": "Potent Spellcasting", "description": "You add your Wisdom modifier to the damage you deal with any cleric cantrip."}],
          "17": [{"name": "Divine Bacchanal", "description": "As an action, you can create an area of divine revelry in a 30-foot radius centered on yourself that lasts for 1 minute. Allies in the area have advantage on saving throws against being charmed or frightened and regain 10 hit points at the start of their turns. Enemies in the area have disadvantage on attack rolls and must succeed on a Wisdom saving throw at the start of their turns or be incapacitated until the start of their next turn. Once you use this feature, you can't use it again until you finish a long rest."}]
        }
      }
    ]
  },
  "druid": {
    "name": "Druid",
    "description": "A priest of the Old Faith, wielding the powers of nature and adopting animal forms",
    "hitDie": 8,
    "primaryAbility": ["wis"],
    "dumpStat": "str",
    "savingThrows": ["int", "wis"],
    "skillChoices": 2,
    "skillOptions": ["arcana", "animal_handling", "insight", "medicine", "nature", "perception", "religion", "survival"],
    "armorProficiencies": ["light (non-metal)", "medium (non-metal)", "shields (non-metal)"],
    "weaponProficiencies": ["clubs", "daggers", "darts", "javelins", "maces", "quarterstaffs", "scimitars", "sickles", "slings", "spears"],
    "toolProficiencies": ["Herbalism kit"],
    "startingEquipment": {
      "choices": [
        {
          "choose": 1,
          "from": [
            "Wooden Shield",
            "Any Simple Weapon"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Scimitar",
            "Any Simple Melee Weapon"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Explorer's Pack"
          ]
        }
      ],
      "given": ["Leather Armor", "Druidic Focus"]
    },
    "startingGold": {
      "dice": "2d4",
      "multiplier": 10,
      "average": 50
    },
    "spellcasting": {
      "ability": "wis",
      "spellsKnown": "All prepared",
      "cantripsKnown": [2, 2, 2, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]
    },
    "features": [
      "Spellcasting - You can cast druid spells using Wisdom as your spellcasting ability",
      "Druidic - You know Druidic, the secret language of druids",
      "Wild Shape - You can magically assume the shape of a beast"
    ],
    "subclasses": [
      {
        "name": "Circle of the Land",
        "description": "Mystic whose power comes from the land itself",
        "landTypes": ["Arctic", "Coast", "Desert", "Forest", "Grassland", "Mountain", "Swamp", "Underdark"],
        "featuresByLevel": {
          "2": [{"name": "Bonus Cantrip", "description": "You learn one additional druid cantrip of your choice."}, {"name": "Natural Recovery", "description": "During a short rest, you can recover expended spell slots. The spell slots can have a combined level that is equal to or less than half your druid level (rounded up), and none of the slots can be 6th level or higher. You can't use this feature again until you finish a long rest."}],
          "3": [{"name": "Circle Spells", "description": "Your mystical connection to the land infuses you with the ability to cast certain spells. You gain access to circle spells connected to the land where you became a druid. These spells are always prepared and don't count against your prepared spells."}],
          "6": [{"name": "Land's Stride", "description": "Moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard. You have advantage on saving throws against plants that are magically created or manipulated to impede movement."}],
          "10": [{"name": "Nature's Ward", "description": "You can't be charmed or frightened by elementals or fey, and you are immune to poison and disease."}],
          "14": [{"name": "Nature's Sanctuary", "description": "Creatures of the natural world sense your connection to nature and become hesitant to attack you. When a beast or plant creature attacks you, that creature must make a Wisdom saving throw against your druid spell save DC. On a failed save, the creature must choose a different target, or the attack automatically misses."}]
        }
      },
      {
        "name": "Circle of the Moon",
        "description": "Fierce guardian who can transform into powerful beasts",
        "featuresByLevel": {
          "2": [{"name": "Combat Wild Shape", "description": "You can use Wild Shape as a bonus action, rather than as an action. Additionally, while you are transformed by Wild Shape, you can use a bonus action to expend one spell slot to regain 1d8 hit points per level of the spell slot expended."}, {"name": "Circle Forms", "description": "You can transform into a beast with a challenge rating as high as 1 (ignoring the Max. CR column of the Beast Shapes table). Starting at 6th level, you can transform into a beast with a challenge rating as high as your druid level divided by 3, rounded down."}],
          "6": [{"name": "Primal Strike", "description": "Your attacks in beast form count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage."}],
          "10": [{"name": "Elemental Wild Shape", "description": "You can expend two uses of Wild Shape at the same time to transform into an air elemental, an earth elemental, a fire elemental, or a water elemental."}],
          "14": [{"name": "Thousand Forms", "description": "You have learned to use magic to alter your physical form in more subtle ways. You can cast the Alter Self spell at will."}]
        }
      },
      {
        "name": "Circle of Dreams",
        "description": "Guardian of the dreaming world with ties to the Feywild",
        "featuresByLevel": {
          "2": [{"name": "Balm of the Summer Court", "description": "You have a pool of fey energy represented by a number of d6s equal to your druid level. As a bonus action, you can choose a creature you can see within 120 feet and spend a number of those dice equal to half your druid level or less. Roll the spent dice and add them together. The target regains a number of hit points equal to the total. The target also gains 1 temporary hit point per die spent. You regain all expended dice when you finish a long rest."}],
          "6": [{"name": "Hearth of Moonlight and Shadow", "description": "At the start of a rest, you can create a 30-foot-radius sphere of magic in an area. Within the sphere, you and your allies gain a +5 bonus to Dexterity (Stealth) and Wisdom (Perception) checks, and any light from open flames in the sphere (a campfire, torches, or the like) isn't visible outside it. The sphere vanishes at the end of the rest or when you leave the sphere."}],
          "10": [{"name": "Hidden Paths", "description": "You can use the hidden, magical pathways that some fey use to traverse space in the blink of an eye. As a bonus action, you can teleport up to 60 feet to an unoccupied space you can see. Alternatively, you can use your action to teleport one willing creature you touch up to 30 feet to an unoccupied space you can see. You can use this feature a number of times equal to your Wisdom modifier (minimum of once)."}],
          "14": [{"name": "Walker in Dreams", "description": "The magic of the Feywild grants you the ability to travel mentally or physically through dreamlands. When you finish a short rest, you can cast one of the following spells, without expending a spell slot or requiring material components: Dream (with you as the messenger), Scrying, or Teleportation Circle. This use of Teleportation Circle is special. Rather than opening a portal to a permanent teleportation circle, it opens a portal to the last location where you finished a long rest on your current plane of existence."}]
        }
      },
      {
        "name": "Circle of the Shepherd",
        "description": "Protector of nature's creatures and summoner of spirits",
        "featuresByLevel": {
          "2": [{"name": "Speech of the Woods", "description": "You gain the ability to converse with beasts and many fey. You learn to speak, read, and write Sylvan. In addition, beasts can understand your speech, and you gain the ability to decipher their noises and motions."}, {"name": "Spirit Totem", "description": "As a bonus action, you can magically summon an incorporeal spirit to a point you can see within 60 feet of you. The spirit creates an aura in a 30-foot radius around that point. It counts as neither a creature nor an object, though it has the spectral appearance of the creature it represents. You can use this feature a number of times equal to your proficiency bonus. Choose Bear Spirit (temp HP, advantage on Strength checks), Hawk Spirit (advantage on Perception, advantage on attack rolls), or Unicorn Spirit (advantage on detecting creatures, healing bonus when you cast healing spells)."}],
          "6": [{"name": "Mighty Summoner", "description": "Beasts and fey that you conjure are more resilient than normal. Any beast or fey summoned or created by a spell that you cast gains the following benefits: the creature appears with more hit points than normal: 2 extra hit points per Hit Die it has, and the damage from its natural weapons is considered magical."}],
          "10": [{"name": "Guardian Spirit", "description": "Your Spirit Totem safeguards the beasts and fey that you call forth with your magic. When a beast or fey that you summoned or created with a spell ends its turn in your Spirit Totem aura, that creature regains a number of hit points equal to half your druid level."}],
          "14": [{"name": "Faithful Summons", "description": "The nature spirits you commune with protect you when you are the most defenseless. If you are reduced to 0 hit points or are incapacitated against your will, you can immediately gain the benefits of Conjure Animals as if it were cast using a 9th-level spell slot. It summons four beasts of your choice that are challenge rating 2 or lower. The conjured beasts appear within 20 feet of you."}]
        }
      },
      {
        "name": "Circle of Spores",
        "description": "Druid who draws power from decay and fungal growth",
        "circleSpells": {
          "2": ["Chill Touch (cantrip)"],
          "3": ["Blindness/Deafness", "Gentle Repose"],
          "5": ["Animate Dead", "Gaseous Form"],
          "7": ["Blight", "Confusion"],
          "9": ["Cloudkill", "Contagion"]
        },
        "featuresByLevel": {
          "2": [{"name": "Halo of Spores", "description": "You are surrounded by invisible, necrotic spores that are harmless until you unleash them on a creature nearby. When a creature you can see moves into a space within 10 feet of you or starts its turn there, you can use your reaction to deal 1d4 necrotic damage to that creature unless it succeeds on a Constitution saving throw. The necrotic damage increases to 1d6 at 6th level, 1d8 at 10th level, and 1d10 at 14th level."}, {"name": "Symbiotic Entity", "description": "You can use your Wild Shape to awaken spores that infuse you with power for 10 minutes. You gain 4 temporary hit points for each level you have in this class. While this feature is active, you gain the following benefits: When you deal your Halo of Spores damage, roll the damage die a second time and add it to the total. Your melee weapon attacks deal an extra 1d6 necrotic damage to any target they hit."}],
          "6": [{"name": "Fungal Infestation", "description": "Your spores gain the ability to infest a corpse and animate it. If a beast or a humanoid that is Small or Medium dies within 10 feet of you, you can use your reaction to animate it, causing it to stand up immediately with 1 hit point. The creature uses the zombie stat block. It remains animate for 1 hour, after which time it collapses and dies. You can use this feature a number of times equal to your Wisdom modifier."}],
          "10": [{"name": "Spreading Spores", "description": "You gain the ability to seed an area with deadly spores. As a bonus action while your Symbiotic Entity feature is active, you can hurl spores up to 30 feet away, where they swirl in a 10-foot cube for 1 minute. The spores disappear early if you use this feature again, if you dismiss them as a bonus action, or if your Symbiotic Entity feature is no longer active. Whenever a creature moves into the cube or starts its turn there, that creature takes your Halo of Spores damage."}],
          "14": [{"name": "Fungal Body", "description": "The fungal spores in your body alter you: you can't be blinded, deafened, frightened, or poisoned, and any critical hit against you counts as a normal hit instead, unless you're incapacitated."}]
        }
      },
      {
        "name": "Circle of Stars",
        "description": "Druid who draws power from starlight and constellations",
        "featuresByLevel": {
          "2": [{"name": "Star Map", "description": "You've created a star chart as part of your study. While holding this map, you have these benefits: You know the Guidance cantrip. You have the Guiding Bolt spell prepared (doesn't count against your prepared spells and you can cast it without expending a spell slot a number of times equal to your proficiency bonus)."}, {"name": "Starry Form", "description": "As a bonus action, you can expend a use of Wild Shape to take on a starry form for 10 minutes. You shed bright light in a 10-foot radius and dim light for an additional 10 feet. Choose Archer (bonus action ranged spell attack dealing radiant damage), Chalice (when you cast a healing spell, you or another creature within 30 feet regains hit points), or Dragon (treat any roll of 9 or lower on Intelligence or Wisdom checks or Constitution saves to maintain concentration as a 10)."}],
          "6": [{"name": "Cosmic Omen", "description": "You learn to use your star map to divine the will of the cosmos. Whenever you finish a long rest, you can consult your Star Map for omens. When you do so, roll a die. Until you finish your next long rest, you can use a reaction to add or subtract the number rolled to a creature's attack roll, saving throw, or ability check (Weal or Woe based on roll)."}],
          "10": [{"name": "Twinkling Constellations", "description": "The constellations of your Starry Form improve. The 1d8 of the Archer and the Chalice becomes 2d8, and while the Dragon is active, you also have a flying speed of 20 feet and can hover. Moreover, at the start of each of your turns while in your Starry Form, you can change which constellation glimmers on your body."}],
          "14": [{"name": "Full of Stars", "description": "While in your Starry Form, you become partially incorporeal, giving you resistance to bludgeoning, piercing, and slashing damage."}]
        }
      },
      {
        "name": "Circle of Wildfire",
        "description": "Druid who understands fire's role in nature's cycle",
        "circleSpells": {
          "2": ["Burning Hands", "Cure Wounds"],
          "3": ["Flaming Sphere", "Scorching Ray"],
          "5": ["Plant Growth", "Revivify"],
          "7": ["Aura of Life", "Fire Shield"],
          "9": ["Flame Strike", "Mass Cure Wounds"]
        },
        "featuresByLevel": {
          "2": [{"name": "Summon Wildfire Spirit", "description": "You can summon the primal spirit bound to your soul. As an action, you can expend one use of your Wild Shape feature to summon your wildfire spirit, rather than assuming a beast form. The spirit appears in an unoccupied space of your choice that you can see within 30 feet. Each creature within 10 feet of the spirit (other than you) when it appears must succeed on a Dexterity saving throw or take 2d6 fire damage."}],
          "6": [{"name": "Enhanced Bond", "description": "The bond with your wildfire spirit enhances your destructive and restorative spells. Whenever you cast a spell that deals fire damage or restores hit points while your wildfire spirit is summoned, roll a d8, and you gain a bonus equal to the number rolled to one damage or healing roll of the spell. In addition, when you cast a spell with a range other than self, the spell can originate from you or your wildfire spirit."}],
          "10": [{"name": "Cauterizing Flames", "description": "When a Small or larger creature dies within 30 feet of you or your wildfire spirit, a harmless spectral flame springs forth in the dead creature's space and flickers there for 1 minute. When a creature you can see enters that space, you can use your reaction to extinguish the spectral flame there and either heal the creature or deal fire damage to it. You can use this reaction a number of times equal to your proficiency bonus."}],
          "14": [{"name": "Blazing Revival", "description": "The bond with your wildfire spirit can save you from death. If the spirit is within 120 feet of you when you are reduced to 0 hit points and thereby fall unconscious, you can cause the spirit to drop to 0 hit points. You then regain half your hit points and immediately rise to your feet. Once you use this feature, you can't use it again until you finish a long rest."}]
        }
      },
      {
        "name": "Circle of Sand",
        "description": "Druids of the Circle of Sand draw their power from the harsh beauty of deserts, commanding sand, wind, and the scorching sun to protect the natural world",
        "source": "Hoard of Heroes",
        "circleSpells": {
          "2": ["Create or Destroy Water", "Burning Hands"],
          "3": ["Blur", "Dust Devil"],
          "5": ["Wall of Sand", "Meld into Stone"],
          "7": ["Hallucinatory Terrain", "Fire Shield"],
          "9": ["Insect Plague", "Wall of Stone"]
        },
        "featuresByLevel": {
          "2": [{"name": "Sand Shape", "description": "You can expend a use of Wild Shape to transform into a swirling elemental of sand rather than a beast. While in this form, you have resistance to nonmagical bludgeoning, piercing, and slashing damage, you can move through spaces as narrow as 1 inch without squeezing, and you have a burrow speed equal to your walking speed. You can use your action to create a 10-foot radius cloud of sand around yourself that lightly obscures the area until the start of your next turn."}],
          "6": [{"name": "Desert's Embrace", "description": "You gain resistance to fire damage. Additionally, you and creatures of your choice within 10 feet of you ignore difficult terrain caused by sand, dust, or loose earth. You also don't suffer the effects of extreme heat."}],
          "10": [{"name": "Sandstorm", "description": "As an action, you can create a sandstorm in a 30-foot radius centered on yourself that lasts for 1 minute or until you dismiss it (no action required). The area is heavily obscured for creatures other than you. Each creature other than you that starts its turn in the area or enters it for the first time on a turn must make a Constitution saving throw, taking 3d6 slashing damage on a failed save, or half as much on a successful one. Once you use this feature, you can't use it again until you finish a long rest."}],
          "14": [{"name": "One with the Desert", "description": "While in your Sand Shape form, you gain immunity to fire damage and the blinded condition. You can also cast spells while in Sand Shape without needing material components. Additionally, when you use your Sandstorm feature, you can choose a number of creatures equal to your Wisdom modifier to be unaffected by it."}]
        }
      }
    ]
  },
  "fighter": {
    "name": "Fighter",
    "description": "A master of martial combat, skilled with a variety of weapons and armor",
    "hitDie": 10,
    "primaryAbility": ["str", "dex"],
    "dumpStat": "int",
    "savingThrows": ["str", "con"],
    "skillChoices": 2,
    "skillOptions": ["acrobatics", "animal_handling", "athletics", "history", "insight", "intimidation", "perception", "survival"],
    "armorProficiencies": ["light", "medium", "heavy", "shields"],
    "weaponProficiencies": ["simple", "martial"],
    "startingEquipment": {
      "choices": [
        {
          "choose": 1,
          "from": [
            "Chain Mail",
            "Leather Armor, Longbow, and 20 Arrows"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Martial Weapon and Shield",
            "Two Martial Weapons"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Light Crossbow and 20 Bolts",
            "Two Handaxes"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Dungeoneer's Pack",
            "Explorer's Pack"
          ]
        }
      ]
    },
    "startingGold": {
      "dice": "5d4",
      "multiplier": 10,
      "average": 125
    },
    "features": [
      "Fighting Style - Choose a fighting style that grants combat bonuses",
      "Second Wind - Regain hit points as a bonus action once per short rest"
    ],
    "subclasses": [
      {
        "name": "Champion",
        "description": "Master of physical combat, excelling in critical hits",
        "featuresByLevel": {
          "3": [{"name": "Improved Critical", "description": "Your weapon attacks score a critical hit on a roll of 19 or 20."}],
          "7": [{"name": "Remarkable Athlete", "description": "You can add half your proficiency bonus (round up) to any Strength, Dexterity, or Constitution check you make that doesn't already use your proficiency bonus. In addition, when you make a running long jump, the distance you can cover increases by a number of feet equal to your Strength modifier."}],
          "10": [{"name": "Additional Fighting Style", "description": "You can choose a second option from the Fighting Style class feature."}],
          "15": [{"name": "Superior Critical", "description": "Your weapon attacks score a critical hit on a roll of 18-20."}],
          "18": [{"name": "Survivor", "description": "You attain the pinnacle of resilience in battle. At the start of each of your turns, you regain hit points equal to 5 + your Constitution modifier if you have no more than half of your hit points left. You don't gain this benefit if you have 0 hit points."}]
        }
      },
      {
        "name": "Battle Master",
        "description": "Tactical warrior who uses maneuvers in combat",
        "featuresByLevel": {
          "3": [{"name": "Combat Superiority", "description": "You learn maneuvers that are fueled by special dice called superiority dice. You learn three maneuvers of your choice. You have four superiority dice, which are d8s. A superiority die is expended when you use it. You regain all of your expended superiority dice when you finish a short or long rest. At 7th level you learn two additional maneuvers and gain another superiority die, and at 15th level you learn two more and gain another die."}, {"name": "Student of War", "description": "You gain proficiency with one type of artisan's tools of your choice."}],
          "7": [{"name": "Know Your Enemy", "description": "If you spend at least 1 minute observing or interacting with another creature outside combat, you can learn certain information about its capabilities compared to your own: Strength score, Dexterity score, Constitution score, Armor Class, Current hit points, Total class levels (if any), and Fighter class levels (if any)."}],
          "10": [{"name": "Improved Combat Superiority", "description": "Your superiority dice turn into d10s."}],
          "15": [{"name": "Relentless", "description": "When you roll initiative and have no superiority dice remaining, you regain one superiority die."}],
          "18": [{"name": "Superior Combat Superiority", "description": "Your superiority dice turn into d12s."}]
        }
      },
      {
        "name": "Eldritch Knight",
        "description": "Fighter who supplements martial prowess with magic",
        "spellcasting": {"ability": "int", "schools": ["Abjuration", "Evocation"]},
        "featuresByLevel": {
          "3": [{"name": "Spellcasting", "description": "You learn to cast spells. You learn two cantrips of your choice from the wizard spell list. You learn three 1st-level wizard spells of your choice, two of which must be abjuration or evocation spells. Intelligence is your spellcasting ability for these spells."}, {"name": "Weapon Bond", "description": "You learn a ritual that creates a magical bond between yourself and one weapon. Once you have bonded a weapon to yourself, you can't be disarmed of that weapon unless you are incapacitated. If it is on the same plane of existence, you can summon that weapon as a bonus action on your turn, causing it to teleport instantly to your hand."}],
          "7": [{"name": "War Magic", "description": "When you use your action to cast a cantrip, you can make one weapon attack as a bonus action."}],
          "10": [{"name": "Eldritch Strike", "description": "When you hit a creature with a weapon attack, that creature has disadvantage on the next saving throw it makes against a spell you cast before the end of your next turn."}],
          "15": [{"name": "Arcane Charge", "description": "When you use Action Surge, you can teleport up to 30 feet to an unoccupied space you can see. You can teleport before or after the additional action."}],
          "18": [{"name": "Improved War Magic", "description": "When you use your action to cast a spell, you can make one weapon attack as a bonus action."}]
        }
      },
      {
        "name": "Cavalier",
        "description": "Mounted warrior who excels at protecting allies",
        "featuresByLevel": {
          "3": [{"name": "Bonus Proficiency", "description": "You gain proficiency in one of the following skills of your choice: Animal Handling, History, Insight, Performance, or Persuasion. Alternatively, you learn one language of your choice."}, {"name": "Born to the Saddle", "description": "Mounting or dismounting a creature costs you only 5 feet of movement. In addition, you have advantage on saving throws made to avoid falling off your mount. If you fall off your mount and descend no more than 10 feet, you can land on your feet if you're not incapacitated."}, {"name": "Unwavering Mark", "description": "When you hit a creature with a melee weapon attack, you can mark the creature until the end of your next turn. A marked creature has disadvantage on any attack roll that doesn't target you. If a creature marked by you deals damage to anyone other than you, you can make a special melee weapon attack against the marked creature as a bonus action on your next turn."}],
          "7": [{"name": "Warding Maneuver", "description": "You can use your reaction to make a creature within 5 feet of you that is hit by an attack have the attack deal half damage. If the attack would have reduced the creature to 0 hit points, it instead remains at 1 hit point. You can use this feature a number of times equal to your Constitution modifier."}],
          "10": [{"name": "Hold the Line", "description": "Creatures provoke an opportunity attack from you when they move 5 feet or more while within your reach, and if you hit a creature with an opportunity attack, the target's speed is reduced to 0 until the end of the current turn."}],
          "15": [{"name": "Ferocious Charger", "description": "If you move at least 10 feet in a straight line right before attacking a creature and you hit it with the attack, that target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + your Strength modifier) or be knocked prone."}],
          "18": [{"name": "Vigilant Defender", "description": "You respond to danger with extraordinary vigilance. In combat, you get a special reaction that you can take once on every creature's turn, except your turn. You can use this special reaction only to make an opportunity attack, and you can't use it on the same turn that you take your normal reaction."}]
        }
      },
      {
        "name": "Samurai",
        "description": "Warrior with iron will and devastating precision",
        "featuresByLevel": {
          "3": [{"name": "Bonus Proficiency", "description": "You gain proficiency in one of the following skills of your choice: History, Insight, Performance, or Persuasion. Alternatively, you learn one language of your choice."}, {"name": "Fighting Spirit", "description": "Your intensity in battle can shield you and help you strike true. As a bonus action on your turn, you can give yourself advantage on weapon attack rolls until the end of the current turn. When you do so, you also gain 5 temporary hit points. The temporary hit points increase when you reach certain levels: 10 at 10th level and 15 at 15th level. You can use this feature three times."}],
          "7": [{"name": "Elegant Courtier", "description": "Your discipline and attention to detail allow you to excel in social situations. Whenever you make a Charisma (Persuasion) check, you gain a bonus to the check equal to your Wisdom modifier. You also gain proficiency in Wisdom saving throws. If you already have this proficiency, you instead gain proficiency in Intelligence or Charisma saving throws."}],
          "10": [{"name": "Tireless Spirit", "description": "When you roll initiative and have no uses of Fighting Spirit remaining, you regain one use."}],
          "15": [{"name": "Rapid Strike", "description": "You learn to trade accuracy for swift strikes. If you take the Attack action on your turn and have advantage on an attack roll against one of the targets, you can forgo the advantage for that roll to make an additional weapon attack against that target, as part of the same action. You can do so no more than once per turn."}],
          "18": [{"name": "Strength Before Death", "description": "If you take damage that reduces you to 0 hit points and doesn't kill you outright, you can use your reaction to delay falling unconscious, and you can immediately take an extra turn, interrupting the current turn. While you have 0 hit points during that extra turn, taking damage causes death saving throw failures as normal. Once the extra turn ends, you fall unconscious if you still have 0 hit points."}]
        }
      },
      {
        "name": "Echo Knight",
        "description": "Manifest echoes of yourself from alternate timelines",
        "featuresByLevel": {
          "3": [{"name": "Manifest Echo", "description": "You can use a bonus action to magically manifest an echo of yourself in an unoccupied space you can see within 15 feet of you. This echo is a magical, translucent, gray image of you that lasts until it is destroyed, until you dismiss it as a bonus action, until you manifest another echo, or until you're incapacitated. Your echo has AC = 14 + your proficiency bonus, 1 hit point, and immunity to all conditions. When you take the Attack action on your turn, any attack you make with that action can originate from your space or the echo's space."}, {"name": "Unleash Incarnation", "description": "You can heighten your echo's fury. Whenever you take the Attack action, you can make one additional melee attack from the echo's position. You can use this feature a number of times equal to your Constitution modifier."}],
          "7": [{"name": "Echo Avatar", "description": "You can temporarily transfer your consciousness to your echo. As an action, you can see through your echo's eyes and hear through its ears. During this time, you are deafened and blinded. You can sustain this effect for up to 10 minutes, and you can end it at any time. While your echo is being used in this way, it can be up to 1,000 feet away from you without being destroyed."}],
          "10": [{"name": "Shadow Martyr", "description": "You can make your echo throw itself in front of an attack directed at another creature that you can see. Before the attack roll is made, you can use your reaction to teleport the echo to an unoccupied space within 5 feet of the targeted creature. The attack roll that triggered the reaction is instead made against your echo."}],
          "15": [{"name": "Reclaim Potential", "description": "You've learned to absorb the fleeting magic of your echo. When an echo of yours is destroyed by taking damage, you can gain a number of temporary hit points equal to 2d6 + your Constitution modifier, provided you don't already have temporary hit points. You can use this feature a number of times equal to your Constitution modifier."}],
          "18": [{"name": "Legion of One", "description": "You can use a bonus action to create two echoes with your Manifest Echo feature, and these echoes can coexist. If you try to create a third echo, the previous two echoes are destroyed. Anything you can do from one echo's position can be done from the other's instead. In addition, when you roll initiative and have no uses of Unleash Incarnation remaining, you regain one use."}]
        }
      },
      {
        "name": "Rune Knight",
        "description": "Channel the power of giant runes",
        "featuresByLevel": {
          "3": [{"name": "Bonus Proficiencies", "description": "You gain proficiency with smith's tools, and you learn to speak, read, and write Giant."}, {"name": "Rune Carver", "description": "You can use magic runes to enhance your gear. You learn two runes of your choice, from among the runes described below. You can inscribe each rune you know onto one object. Whenever you finish a long rest, you can touch a number of objects equal to the number of runes you know, and you inscribe a different rune onto each of the objects."}, {"name": "Giant's Might", "description": "You have learned how to imbue yourself with the might of giants. As a bonus action, you magically gain the following benefits for 1 minute: If you are smaller than Large, you become Large, along with anything you are wearing. You have advantage on Strength checks and Strength saving throws. Once on each of your turns, one of your attacks with a weapon or an unarmed strike can deal an extra 1d6 damage to a target on a hit."}],
          "7": [{"name": "Runic Shield", "description": "You learn to invoke your rune magic to protect your allies. When another creature you can see within 60 feet of you is hit by an attack roll, you can use your reaction to force the attacker to reroll the d20 and use the new roll. You can use this feature a number of times equal to your proficiency bonus."}],
          "10": [{"name": "Great Stature", "description": "The magic of your runes permanently alters you. When you gain this feature, roll 3d4. You grow a number of inches in height equal to the roll. Moreover, the extra damage you deal with your Giant's Might feature increases to 1d8."}],
          "15": [{"name": "Master of Runes", "description": "You can invoke each rune you know from your Rune Carver feature twice, rather than once, and you regain all expended uses when you finish a short or long rest."}],
          "18": [{"name": "Runic Juggernaut", "description": "You learn how to amplify your rune-powered transformation. As a result, the extra damage you deal with the Giant's Might feature increases to 1d10. Moreover, when you use that feature, your size can increase to Huge, and while you are that size, your reach increases by 5 feet."}]
        }
      },
      {
        "name": "Psi Warrior",
        "description": "Awaken psionic powers to augment combat abilities",
        "featuresByLevel": {
          "3": [{"name": "Psionic Power", "description": "You harbor a wellspring of psionic energy within yourself. This energy is represented by your Psionic Energy dice, which are each a d6. You have a number of these dice equal to twice your proficiency bonus. You can use them for: Protective Field (reduce damage to yourself or allies), Psionic Strike (add force damage to attacks), or Telekinetic Movement (move objects or creatures)."}, {"name": "Protective Field", "description": "When you or another creature you can see within 30 feet of you takes damage, you can use your reaction to expend one Psionic Energy die, roll the die, and reduce the damage taken by the number rolled plus your Intelligence modifier (minimum reduction of 1)."}],
          "7": [{"name": "Telekinetic Adept", "description": "You have mastered new ways to use your telekinetic abilities. You can cast Telekinesis, requiring no components, and your spellcasting ability for the spell is Intelligence. You can also propel weapons telekinetically: when you hit with a weapon attack, you can push the target 10 feet away or toward you."}],
          "10": [{"name": "Guarded Mind", "description": "The psionic energy flowing through you has bolstered your mind. You have resistance to psychic damage. Moreover, if you start your turn charmed or frightened, you can expend a Psionic Energy die and end every effect on yourself subjecting you to those conditions."}],
          "15": [{"name": "Bulwark of Force", "description": "You can shield yourself and others with telekinetic force. As a bonus action, you can choose creatures, which can include you, that you can see within 30 feet of you, up to a number of creatures equal to your Intelligence modifier (minimum of one creature). Each of the chosen creatures is protected by half cover for 1 minute or until you're incapacitated."}],
          "18": [{"name": "Telekinetic Master", "description": "Your ability to move creatures and objects with your mind is matched by few. You can cast the Telekinesis spell, requiring no components, and your spellcasting ability for the spell is Intelligence. On each of your turns while you concentrate on the spell, including the turn when you cast it, you can make one attack with a weapon as a bonus action."}]
        }
      },
      {
        "name": "Monster Hunter",
        "description": "Fighters who dedicate themselves to hunting dangerous monsters, learning their weaknesses and developing specialized techniques to bring them down",
        "source": "Hoard of Heroes",
        "featuresByLevel": {
          "3": [{"name": "Hunter's Knowledge", "description": "You gain proficiency in the Survival skill if you don't already have it. Your proficiency bonus is doubled for any ability check you make that uses Survival. Additionally, you learn to identify monsters. As an action, you can study a creature you can see within 60 feet. You learn its creature type, any damage resistances, immunities, or vulnerabilities it has, and any special abilities it has that you could observe."}, {"name": "Monster Slayer", "description": "You can mark a creature you can see as your quarry as a bonus action. For the next hour, you deal an extra 1d6 damage to the marked creature whenever you hit it with a weapon attack. This damage increases to 2d6 at 10th level and 3d6 at 18th level. You can use this feature a number of times equal to your proficiency bonus."}],
          "7": [{"name": "Exploit Weakness", "description": "When you hit a creature marked by your Monster Slayer feature with a weapon attack, you can force it to make a Constitution saving throw (DC = 8 + your proficiency bonus + your Strength or Dexterity modifier). On a failed save, the creature has disadvantage on attack rolls and ability checks until the end of your next turn."}],
          "10": [{"name": "Steel Nerves", "description": "You have advantage on saving throws against being frightened. Additionally, you can't be surprised by creatures of a type you've studied using your Hunter's Knowledge feature."}],
          "15": [{"name": "Slayer's Instinct", "description": "When a creature marked by your Monster Slayer feature hits you with an attack, you can use your reaction to make a weapon attack against that creature. Additionally, when you reduce a marked creature to 0 hit points, you regain one use of your Monster Slayer feature."}],
          "18": [{"name": "Legendary Hunter", "description": "You've become a legend among monster hunters. When you use your Monster Slayer feature, you can mark up to two creatures at once. When you use your Exploit Weakness feature and the creature fails its save, it is also stunned until the end of your next turn. Once a creature is stunned by this feature, it can't be stunned by it again for 24 hours."}]
        }
      }
    ]
  },
  "monk": {
    "name": "Monk",
    "description": "A master of martial arts, harnessing the power of the body in pursuit of physical and spiritual perfection",
    "hitDie": 8,
    "primaryAbility": ["dex", "wis"],
    "dumpStat": "str",
    "savingThrows": ["str", "dex"],
    "skillChoices": 2,
    "skillOptions": ["acrobatics", "athletics", "history", "insight", "religion", "stealth"],
    "armorProficiencies": [],
    "weaponProficiencies": ["simple", "shortswords"],
    "toolProficiencies": ["Choose one type of artisan's tools or one musical instrument"],
    "startingEquipment": {
      "choices": [
        {
          "choose": 1,
          "from": [
            "Shortsword",
            "Any Simple Weapon"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Dungeoneer's Pack",
            "Explorer's Pack"
          ]
        }
      ],
      "given": ["10 Darts"]
    },
    "startingGold": {
      "dice": "5d4",
      "multiplier": 1,
      "average": 12
    },
    "features": [
      "Unarmored Defense - While not wearing armor or wielding a shield, your AC equals 10 + DEX modifier + WIS modifier",
      "Martial Arts - Your practice of martial arts gives you mastery of unarmed strikes and monk weapons",
      "Ki - You can harness the mystic energy of ki to fuel special abilities"
    ],
    "subclasses": [
      {
        "name": "Way of the Open Hand",
        "description": "Master of unarmed combat techniques",
        "featuresByLevel": {
          "3": [{"name": "Open Hand Technique", "description": "Whenever you hit a creature with one of the attacks granted by your Flurry of Blows, you can impose one of the following effects on that target: It must succeed on a Dexterity saving throw or be knocked prone. It must make a Strength saving throw. If it fails, you can push it up to 15 feet away from you. It can't take reactions until the end of your next turn."}],
          "6": [{"name": "Wholeness of Body", "description": "You gain the ability to heal yourself. As an action, you can regain hit points equal to three times your monk level. You must finish a long rest before you can use this feature again."}],
          "11": [{"name": "Tranquility", "description": "You can enter a special meditation that surrounds you with an aura of peace. At the end of a long rest, you gain the effect of a Sanctuary spell that lasts until the start of your next long rest (the spell can end early as normal). The saving throw DC for the spell equals 8 + your Wisdom modifier + your proficiency bonus."}],
          "17": [{"name": "Quivering Palm", "description": "You gain the ability to set up lethal vibrations in someone's body. When you hit a creature with an unarmed strike, you can spend 3 ki points to start these imperceptible vibrations, which last for a number of days equal to your monk level. The vibrations are harmless unless you use your action to end them. When you use this action, the creature must make a Constitution saving throw. If it fails, it is reduced to 0 hit points. If it succeeds, it takes 10d10 necrotic damage."}]
        }
      },
      {
        "name": "Way of Shadow",
        "description": "Ninja-like warrior who uses stealth and shadow magic",
        "featuresByLevel": {
          "3": [{"name": "Shadow Arts", "description": "You can use your ki to duplicate the effects of certain spells. As an action, you can spend 2 ki points to cast Darkness, Darkvision, Pass without Trace, or Silence, without providing material components. Additionally, you gain the Minor Illusion cantrip if you don't already know it."}],
          "6": [{"name": "Shadow Step", "description": "You gain the ability to step from one shadow into another. When you are in dim light or darkness, as a bonus action you can teleport up to 60 feet to an unoccupied space you can see that is also in dim light or darkness. You then have advantage on the first melee attack you make before the end of the turn."}],
          "11": [{"name": "Cloak of Shadows", "description": "You have learned to become one with the shadows. When you are in an area of dim light or darkness, you can use your action to become invisible. You remain invisible until you make an attack, cast a spell, or are in an area of bright light."}],
          "17": [{"name": "Opportunist", "description": "You can exploit a creature's momentary distraction when it is hit by an attack. Whenever a creature within 5 feet of you is hit by an attack made by a creature other than you, you can use your reaction to make a melee attack against that creature."}]
        }
      },
      {
        "name": "Way of the Four Elements",
        "description": "Channel the elements through ki",
        "featuresByLevel": {
          "3": [{"name": "Disciple of the Elements", "description": "You learn magical disciplines that harness the power of the four elements. Some disciplines require you to spend ki points when you use them. You learn the Elemental Attunement discipline and one other elemental discipline of your choice. You learn one additional elemental discipline of your choice at 6th, 11th, and 17th level. Whenever you learn a new elemental discipline, you can also replace one elemental discipline that you already know with a different discipline."}],
          "6": [{"name": "Additional Discipline", "description": "You learn one additional elemental discipline of your choice."}],
          "11": [{"name": "Additional Discipline", "description": "You learn one additional elemental discipline of your choice."}],
          "17": [{"name": "Additional Discipline", "description": "You learn one additional elemental discipline of your choice."}]
        }
      },
      {
        "name": "Way of the Sun Soul",
        "description": "Radiant soul who channels divine light",
        "featuresByLevel": {
          "3": [{"name": "Radiant Sun Bolt", "description": "You gain a new attack option that you can use with the Attack action. This special attack is a ranged spell attack with a range of 30 feet. You are proficient with it, and you add your Dexterity modifier to its attack and damage rolls. Its damage is radiant, and its damage die is a d4. This die changes as you gain monk levels, as shown in the Martial Arts column of the Monk table. When you take the Attack action on your turn and use this special attack as part of it, you can spend 1 ki point to make the special attack twice as a bonus action."}],
          "6": [{"name": "Searing Arc Strike", "description": "You gain the ability to channel your ki into searing waves of energy. Immediately after you take the Attack action on your turn, you can spend 2 ki points to cast the Burning Hands spell as a bonus action. You can spend additional ki points to cast Burning Hands as a higher-level spell. Each additional ki point you spend increases the spell's level by 1. The maximum number of ki points (2 plus any additional points) that you can spend on the spell equals half your monk level."}],
          "11": [{"name": "Searing Sunburst", "description": "You gain the ability to create an orb of light that erupts into a devastating explosion. As an action, you magically create an orb and hurl it at a point you choose within 150 feet, where it erupts into a sphere of radiant light for a brief but deadly instant. Each creature in that 20-foot-radius sphere must succeed on a Constitution saving throw or take 2d6 radiant damage. A creature doesn't need to make the save if the creature is behind total cover that is opaque. You can increase the sphere's damage by spending ki points. Each point you spend, to a maximum of 3, increases the damage by 2d6."}],
          "17": [{"name": "Sun Shield", "description": "You become wreathed in a luminous, magical aura. You shed bright light in a 30-foot radius and dim light for an additional 30 feet. You can extinguish or restore the light as a bonus action. If a creature hits you with a melee attack while this light shines, you can use your reaction to deal radiant damage to the creature. The radiant damage equals 5 + your Wisdom modifier."}]
        }
      },
      {
        "name": "Way of the Drunken Master",
        "description": "Unpredictable fighter using drunken techniques",
        "bonusProficiencies": ["Performance", "Brewer's Supplies"],
        "featuresByLevel": {
          "3": [{"name": "Bonus Proficiencies", "description": "You gain proficiency in the Performance skill if you don't already have it. Your martial arts technique mixes combat training with the precision of a dancer and the antics of a jester. You also gain proficiency with brewer's supplies if you don't already have it."}, {"name": "Drunken Technique", "description": "You learn how to twist and turn quickly as part of your Flurry of Blows. Whenever you use Flurry of Blows, you gain the benefit of the Disengage action, and your walking speed increases by 10 feet until the end of the current turn."}],
          "6": [{"name": "Tipsy Sway", "description": "You can move in sudden, swaying ways. You gain the following benefits: Leap to Your Feet (when you're prone, you can stand up by spending 5 feet of movement, rather than half your speed), Redirect Attack (when a creature misses you with a melee attack roll, you can spend 1 ki point as a reaction to cause that attack to hit one creature of your choice, other than the attacker, that you can see within 5 feet of you)."}],
          "11": [{"name": "Drunkard's Luck", "description": "You always seem to get a lucky bounce at the right moment. When you make an ability check, an attack roll, or a saving throw and have disadvantage on the roll, you can spend 2 ki points to cancel the disadvantage for that roll."}],
          "17": [{"name": "Intoxicated Frenzy", "description": "You gain the ability to make an overwhelming number of attacks against a group of enemies. When you use your Flurry of Blows, you can make up to three additional attacks with it (up to a total of five Flurry of Blows attacks), provided that each Flurry of Blows attack targets a different creature this turn."}]
        }
      },
      {
        "name": "Way of the Kensei",
        "description": "Master of weapons as extensions of the body",
        "featuresByLevel": {
          "3": [{"name": "Path of the Kensei", "description": "Your special martial arts training leads you to master the use of certain weapons. Choose two types of weapons to be your kensei weapons: one melee weapon and one ranged weapon. Each of these weapons can be any simple or martial weapon that lacks the heavy and special properties. You gain the following benefits while wielding kensei weapons: Agile Parry (+2 AC if you make an unarmed strike and are holding a kensei melee weapon), Kensei's Shot (bonus action to add 1d4 damage to ranged attacks this turn), Way of the Brush (you gain proficiency with calligrapher's supplies or painter's supplies)."}],
          "6": [{"name": "One with the Blade", "description": "You extend your ki into your kensei weapons, granting you the following benefits: Magic Kensei Weapons (your attacks with your kensei weapons count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage), Deft Strike (when you hit a target with a kensei weapon, you can spend 1 ki point to cause the weapon to deal extra damage to the target equal to your Martial Arts die)."}],
          "11": [{"name": "Sharpen the Blade", "description": "You gain the ability to augment your weapons further with your ki. As a bonus action, you can expend up to 3 ki points to grant one kensei weapon you touch a bonus to attack and damage rolls when you attack with it. The bonus equals the number of ki points you spent. This bonus lasts for 1 minute or until you use this feature again. This feature has no effect on a magic weapon that already has a bonus to attack and damage rolls."}],
          "17": [{"name": "Unerring Accuracy", "description": "Your mastery of weapons grants you extraordinary accuracy. If you miss with an attack roll using a monk weapon on your turn, you can reroll it. You can use this feature only once on each of your turns."}]
        }
      },
      {
        "name": "Way of Mercy",
        "description": "Masked healer who brings life or death",
        "featuresByLevel": {
          "3": [{"name": "Implements of Mercy", "description": "You gain proficiency in the Insight and Medicine skills, and you gain proficiency with the herbalism kit. You also gain a special mask, which you often wear when using the features of this subclass."}, {"name": "Hand of Healing", "description": "Your mystical touch can mend wounds. As an action, you can spend 1 ki point to touch a creature and restore a number of hit points equal to a roll of your Martial Arts die + your Wisdom modifier. When you use your Flurry of Blows, you can replace one of the unarmed strikes with a use of this feature without spending a ki point for the healing."}, {"name": "Hand of Harm", "description": "You use your ki to inflict wounds. When you hit a creature with an unarmed strike, you can spend 1 ki point to deal extra necrotic damage equal to one roll of your Martial Arts die + your Wisdom modifier. You can use this feature only once per turn."}],
          "6": [{"name": "Physician's Touch", "description": "You can administer even greater cures with a touch, and if you feel it's necessary, you can use your knowledge to cause harm. When you use Hand of Healing on a creature, you can also end one disease or one of the following conditions affecting the creature: blinded, deafened, paralyzed, poisoned, or stunned. When you use Hand of Harm on a creature, you can subject that creature to the poisoned condition until the end of your next turn."}],
          "11": [{"name": "Flurry of Healing and Harm", "description": "You can now mete out a flurry of comfort and hurt. When you use Flurry of Blows, you can now replace each of the unarmed strikes with a use of your Hand of Healing, without spending ki points for the healing. In addition, when you make an unarmed strike with Flurry of Blows, you can use Hand of Harm with that strike without spending the ki point for Hand of Harm. You can still use Hand of Harm only once per turn."}],
          "17": [{"name": "Hand of Ultimate Mercy", "description": "Your mastery of life energy opens the door to the ultimate mercy. As an action, you can touch the corpse of a creature that died within the past 24 hours and expend 5 ki points. The creature then returns to life, regaining a number of hit points equal to 4d10 + your Wisdom modifier. If the creature died while subject to any of the following conditions, it revives with them removed: blinded, deafened, paralyzed, poisoned, and stunned."}]
        }
      },
      {
        "name": "Way of the Astral Self",
        "description": "Manifest your ki as spectral astral arms",
        "featuresByLevel": {
          "3": [{"name": "Arms of the Astral Self", "description": "Your mastery of your ki allows you to summon a portion of your astral self. As a bonus action, you can spend 1 ki point to summon the arms of your astral self. When you do so, each creature of your choice that you can see within 10 feet of you must succeed on a Dexterity saving throw or take force damage equal to two rolls of your Martial Arts die. For 10 minutes, these spectral arms hover near your shoulders or surround your arms. You can use the arms to make unarmed strikes with a reach of 10 feet, using your Wisdom modifier instead of Strength or Dexterity."}],
          "6": [{"name": "Visage of the Astral Self", "description": "You can summon the visage of your astral self. As a bonus action, or as part of the bonus action you take to activate Arms of the Astral Self, you can spend 1 ki point to summon this visage for 10 minutes. It covers your face like a helmet or mask. You gain the following benefits: Astral Sight (you can see normally in darkness to 120 feet), Wisdom of the Spirit (you have advantage on Insight and Intimidation checks), Word of the Spirit (when you speak, you can direct your words to a creature of your choice within 60 feet, making it so only that creature can hear you, or you can amplify your voice so that all creatures within 600 feet can hear you)."}],
          "11": [{"name": "Body of the Astral Self", "description": "When you have both your astral arms and visage summoned, you can cause the body of your astral self to appear (no action required). This spectral body covers your physical form like a suit of armor, connecting with the arms and visage. You are now under the effects of both, and you also gain the following benefits: Deflect Energy (when you take acid, cold, fire, force, lightning, or thunder damage, you can use your reaction to deflect it, reducing the damage by 1d10 + your Wisdom modifier), Empowered Arms (once on each of your turns when you hit with your astral arms, you can deal extra damage to the target equal to your Martial Arts die)."}],
          "17": [{"name": "Awakened Astral Self", "description": "Your connection to your astral self is complete, allowing you to unleash its full potential. As a bonus action, you can spend 5 ki points to summon the arms, visage, and body of your astral self and awaken it for 10 minutes. This awakening ends early if you are incapacitated or die. While your astral self is awakened, you gain the following benefits: Armor of the Spirit (you gain a +2 bonus to Armor Class), Astral Barrage (whenever you use the Extra Attack feature to attack twice, you can instead attack three times if all the attacks are made with your astral arms)."}]
        }
      },
      {
        "name": "Way of the Ascendant Dragon",
        "description": "Emulate the power of dragons",
        "featuresByLevel": {
          "3": [{"name": "Draconic Disciple", "description": "You can touch your ki and channel it to manifest the power of a dragon. You learn to speak, read, and write Draconic or one other language of your choice. You can change the damage type of your unarmed strikes to acid, cold, fire, lightning, or poison."}, {"name": "Breath of the Dragon", "description": "You can channel destructive waves of energy, like those created by the dragons you emulate. When you take the Attack action on your turn, you can replace one of the attacks with an exhalation of draconic energy in either a 20-foot cone or a 30-foot line that is 5 feet wide (your choice). Choose a damage type: acid, cold, fire, lightning, or poison. Each creature in that area must make a Dexterity saving throw, taking damage equal to two rolls of your Martial Arts die on a failed save, or half as much damage on a successful one. You can use this feature a number of times equal to your proficiency bonus."}],
          "6": [{"name": "Wings Unfurled", "description": "When you use your Step of the Wind, you can unfurl spectral draconic wings from your back that vanish at the end of your turn. While the wings exist, you have a flying speed equal to your walking speed. You can use this feature a number of times equal to your proficiency bonus."}],
          "11": [{"name": "Aspect of the Wyrm", "description": "The power of your draconic spirit now radiates from you, warding your allies or inspiring terror in your enemies. As a bonus action, you can create an aura of draconic power that radiates 10 feet from you for 1 minute. For the duration, you gain one of the following effects of your choice: Frightful Presence (when you create this aura, and as a bonus action on subsequent turns, you can choose a creature within the aura. The target must succeed on a Wisdom saving throw or become frightened of you for 1 minute), Resistance (choose a damage type when you activate this aura: acid, cold, fire, lightning, or poison. You and your allies within the aura have resistance to that damage)."}],
          "17": [{"name": "Ascendant Aspect", "description": "Your draconic spirit reaches its peak. You gain the following benefits: Augment Breath (when you use your Breath of the Dragon, you can spend 1 ki point to augment its shape and power. The exhalation of draconic energy becomes either a 60-foot cone or a 90-foot line that is 5 feet wide (your choice), and each creature in that area takes damage equal to four rolls of your Martial Arts die on a failed save, or half as much damage on a successful one). Blindsight (you gain blindsight out to 10 feet. Within that range, you can effectively see anything that isn't behind total cover, even if you're blinded or in darkness). Explosive Fury (when you activate your Aspect of the Wyrm, draconic fury explodes from you. Choose any number of creatures you can see in your aura. Each of those creatures must succeed on a Dexterity saving throw or take 3d10 acid, cold, fire, lightning, or poison damage (your choice))."}]
        }
      },
      {
        "name": "Warrior of the Mystic Arts",
        "description": "A monk who blends martial prowess with arcane magic, wielding spells alongside their fists",
        "source": "Unearthed Arcana",
        "spellcasting": {"ability": "wis", "schools": ["Abjuration", "Divination", "Transmutation"]},
        "featuresByLevel": {
          "3": [{"name": "Mystic Spellcasting", "description": "You augment your martial arts with the ability to cast spells. You learn two cantrips of your choice from the wizard spell list. You learn two 1st-level wizard spells of your choice from the abjuration, divination, or transmutation schools. Wisdom is your spellcasting ability for these spells. You can cast your known spells using ki points instead of spell slots, spending ki points equal to 1 + the spell's level."}, {"name": "Arcane Deflection", "description": "When you are hit by an attack or fail a saving throw, you can use your reaction to gain a +2 bonus to AC against that attack or a +4 bonus to that saving throw. When you use this feature, you can't cast spells other than cantrips until the end of your next turn."}],
          "6": [{"name": "Mystic Strike", "description": "You learn to infuse your unarmed strikes with magical energy. Once per turn when you hit a creature with an unarmed strike, you can expend 1 ki point to deal an extra 1d6 force damage. This damage increases to 2d6 at 11th level and 3d6 at 17th level."}, {"name": "Ki-Fueled Casting", "description": "When you cast a spell using ki points, you can make one unarmed strike as a bonus action."}],
          "11": [{"name": "Spell Reflection", "description": "When you use your Arcane Deflection feature and the triggering effect was a spell, you can spend 2 ki points to reflect the spell back at the caster. The caster must make a saving throw against your ki save DC, taking force damage equal to your Martial Arts die + your Wisdom modifier on a failed save."}],
          "17": [{"name": "Perfect Harmony", "description": "You have achieved perfect balance between martial and magical arts. When you use your action to cast a spell, you can make two unarmed strikes as a bonus action. Additionally, your Mystic Strike damage increases to 4d6."}]
        }
      },
      {
        "name": "Way of Waves",
        "description": "Monks who follow the Way of Waves emulate the fluid, ever-changing nature of water, using flowing movements that can crash with devastating force or flow around obstacles",
        "source": "Hoard of Heroes",
        "featuresByLevel": {
          "3": [{"name": "Fluid Motion", "description": "Your movements become like water. You gain a swimming speed equal to your walking speed, and you can breathe underwater. Additionally, when you use your Step of the Wind feature, you can move through hostile creatures' spaces without provoking opportunity attacks."}, {"name": "Crashing Wave", "description": "When you use your Flurry of Blows, you can push each creature you hit up to 10 feet away from you. If a creature is pushed into a solid surface or another creature, it takes bludgeoning damage equal to your Martial Arts die."}],
          "6": [{"name": "Water's Resilience", "description": "You can use your ki to absorb and redirect kinetic energy. When you take bludgeoning, piercing, or slashing damage, you can use your reaction to spend 1 ki point and reduce the damage by an amount equal to your Martial Arts die + your Wisdom modifier."}, {"name": "Current's Pull", "description": "When a creature within 5 feet of you moves, you can use your reaction to move up to half your speed without provoking opportunity attacks, provided you end this movement within 5 feet of that creature."}],
          "11": [{"name": "Tidal Strike", "description": "Your attacks flow with the power of the tide. Once per turn when you hit a creature with an unarmed strike, you can force it to make a Strength saving throw. On a failed save, the creature is knocked prone and pulled up to 15 feet toward you. You can use this feature a number of times equal to your Wisdom modifier."}],
          "17": [{"name": "Tsunami", "description": "As an action, you can spend 4 ki points to create a wave of force in a 30-foot cone. Each creature in that area must make a Dexterity saving throw. On a failed save, a creature takes 10d6 bludgeoning damage, is pushed 30 feet away from you, and is knocked prone. On a successful save, a creature takes half damage and isn't pushed or knocked prone."}]
        }
      }
    ]
  },
  "paladin": {
    "name": "Paladin",
    "description": "A holy warrior bound to a sacred oath",
    "hitDie": 10,
    "primaryAbility": ["str", "cha"],
    "dumpStat": "int",
    "savingThrows": ["wis", "cha"],
    "skillChoices": 2,
    "skillOptions": ["athletics", "insight", "intimidation", "medicine", "persuasion", "religion"],
    "armorProficiencies": ["light", "medium", "heavy", "shields"],
    "weaponProficiencies": ["simple", "martial"],
    "startingEquipment": {
      "choices": [
        {
          "choose": 1,
          "from": [
            "Martial Weapon and Shield",
            "Two Martial Weapons"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Five Javelins",
            "Any Simple Melee Weapon"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Priest's Pack",
            "Explorer's Pack"
          ]
        }
      ],
      "given": ["Chain Mail", "Holy Symbol"]
    },
    "startingGold": {
      "dice": "5d4",
      "multiplier": 10,
      "average": 125
    },
    "spellcasting": {
      "ability": "cha",
      "spellsKnown": "All prepared",
      "cantripsKnown": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    },
    "features": [
      "Divine Sense - Detect the presence of undead, celestials, and fiends within 60 feet",
      "Lay on Hands - You have a pool of healing power that can restore hit points or cure diseases",
      "Spellcasting - You can cast paladin spells using Charisma as your spellcasting ability"
    ],
    "subclasses": [
      {
        "name": "Oath of Devotion",
        "description": "Paragon of justice and righteousness",
        "oathSpells": {
          "3": ["Protection from Evil and Good", "Sanctuary"],
          "5": ["Lesser Restoration", "Zone of Truth"],
          "9": ["Beacon of Hope", "Dispel Magic"],
          "13": ["Freedom of Movement", "Guardian of Faith"],
          "17": ["Commune", "Flame Strike"]
        },
        "featuresByLevel": {
          "3": [{"name": "Channel Divinity: Sacred Weapon", "description": "As an action, you can imbue one weapon that you are holding with positive energy. For 1 minute, you add your Charisma modifier to attack rolls made with that weapon (minimum +1). The weapon also emits bright light in a 20-foot radius and dim light 20 feet beyond that."}, {"name": "Channel Divinity: Turn the Unholy", "description": "As an action, you present your holy symbol and speak a prayer censuring fiends and undead. Each fiend or undead that can see or hear you within 30 feet must make a Wisdom saving throw. If it fails, it is turned for 1 minute or until it takes damage."}],
          "7": [{"name": "Aura of Devotion", "description": "You and friendly creatures within 10 feet of you can't be charmed while you are conscious. At 18th level, the range of this aura increases to 30 feet."}],
          "15": [{"name": "Purity of Spirit", "description": "You are always under the effects of a Protection from Evil and Good spell."}],
          "20": [{"name": "Holy Nimbus", "description": "As an action, you can emanate an aura of sunlight. For 1 minute, bright light shines from you in a 30-foot radius, and dim light shines 30 feet beyond that. Whenever an enemy creature starts its turn in the bright light, it takes 10 radiant damage. In addition, for the duration, you have advantage on saving throws against spells cast by fiends or undead."}]
        }
      },
      {
        "name": "Oath of the Ancients",
        "description": "Protector of light and life against darkness",
        "oathSpells": {
          "3": ["Ensnaring Strike", "Speak with Animals"],
          "5": ["Moonbeam", "Misty Step"],
          "9": ["Plant Growth", "Protection from Energy"],
          "13": ["Ice Storm", "Stoneskin"],
          "17": ["Commune with Nature", "Tree Stride"]
        },
        "featuresByLevel": {
          "3": [{"name": "Channel Divinity: Nature's Wrath", "description": "You can use your Channel Divinity to invoke primeval forces to ensnare a foe. As an action, you can cause spectral vines to spring up and reach for a creature within 10 feet of you. The creature must succeed on a Strength or Dexterity saving throw or be restrained."}, {"name": "Channel Divinity: Turn the Faithless", "description": "You can use your Channel Divinity to utter ancient words that are painful for fey and fiends to hear. Each fey or fiend within 30 feet that can hear you must make a Wisdom saving throw. On a failed save, the creature is turned for 1 minute or until it takes damage."}],
          "7": [{"name": "Aura of Warding", "description": "You and friendly creatures within 10 feet of you have resistance to damage from spells. At 18th level, the range increases to 30 feet."}],
          "15": [{"name": "Undying Sentinel", "description": "When you are reduced to 0 hit points and are not killed outright, you can choose to drop to 1 hit point instead. Once you use this ability, you can't use it again until you finish a long rest. Additionally, you suffer none of the drawbacks of old age, and you can't be aged magically."}],
          "20": [{"name": "Elder Champion", "description": "You can assume the form of an ancient force of nature, taking on an appearance you choose. Using your action, you undergo a transformation. For 1 minute: you regain 10 hit points at the start of each of your turns, you can cast paladin spells with a casting time of 1 action as a bonus action instead, and enemy creatures within 10 feet have disadvantage on saving throws against your paladin spells and Channel Divinity options."}]
        }
      },
      {
        "name": "Oath of Vengeance",
        "description": "Avenger who punishes wrongdoers",
        "oathSpells": {
          "3": ["Bane", "Hunter's Mark"],
          "5": ["Hold Person", "Misty Step"],
          "9": ["Haste", "Protection from Energy"],
          "13": ["Banishment", "Dimension Door"],
          "17": ["Hold Monster", "Scrying"]
        },
        "featuresByLevel": {
          "3": [{"name": "Channel Divinity: Abjure Enemy", "description": "As an action, you present your holy symbol and speak a prayer of denunciation. Choose one creature within 60 feet. That creature must make a Wisdom saving throw, unless it is immune to being frightened. On a failed save, the creature is frightened for 1 minute or until it takes any damage. Its speed is also 0."}, {"name": "Channel Divinity: Vow of Enmity", "description": "As a bonus action, you can utter a vow of enmity against a creature you can see within 10 feet of you. You gain advantage on attack rolls against the creature for 1 minute or until it drops to 0 hit points or falls unconscious."}],
          "7": [{"name": "Relentless Avenger", "description": "When you hit a creature with an opportunity attack, you can move up to half your speed immediately after the attack and as part of the same reaction. This movement doesn't provoke opportunity attacks."}],
          "15": [{"name": "Soul of Vengeance", "description": "When a creature under the effect of your Vow of Enmity makes an attack, you can use your reaction to make a melee weapon attack against that creature if it is within range."}],
          "20": [{"name": "Avenging Angel", "description": "You can assume the form of an angelic avenger. Using your action, you undergo a transformation. For 1 hour: wings sprout from your back and grant you a flying speed of 60 feet, you emanate a menacing aura in a 30-foot radius (enemies that start their turn there must succeed on a Wisdom save or be frightened of you for 1 minute or until they take damage)."}]
        }
      },
      {
        "name": "Oath of Conquest",
        "description": "Tyrannical warrior who crushes enemies",
        "oathSpells": {
          "3": ["Armor of Agathys", "Command"],
          "5": ["Hold Person", "Spiritual Weapon"],
          "9": ["Bestow Curse", "Fear"],
          "13": ["Dominate Beast", "Stoneskin"],
          "17": ["Cloudkill", "Dominate Person"]
        },
        "featuresByLevel": {
          "3": [{"name": "Channel Divinity: Conquering Presence", "description": "You can use your Channel Divinity to exude a terrifying presence. As an action, you force each creature of your choice within 30 feet to make a Wisdom saving throw. On a failed save, a creature becomes frightened of you for 1 minute."}, {"name": "Channel Divinity: Guided Strike", "description": "When you make an attack roll, you can use your Channel Divinity to gain a +10 bonus to the roll."}],
          "7": [{"name": "Aura of Conquest", "description": "Creatures that are frightened of you have their speed reduced to 0 while within 10 feet of you, and they take psychic damage equal to half your paladin level if they start their turn there. At 18th level, the range increases to 30 feet."}],
          "15": [{"name": "Scornful Rebuke", "description": "Whenever a creature hits you with an attack, that creature takes psychic damage equal to your Charisma modifier (minimum of 1) if you're not incapacitated."}],
          "20": [{"name": "Invincible Conqueror", "description": "You gain the ability to harness extraordinary martial prowess. As an action, you gain the following benefits for 1 minute: you have resistance to all damage, when you take the Attack action, you can make one additional attack, and your melee weapon attacks score a critical hit on a roll of 19 or 20."}]
        }
      },
      {
        "name": "Oath of Redemption",
        "description": "Pacifist who seeks to redeem the wicked",
        "oathSpells": {
          "3": ["Sanctuary", "Sleep"],
          "5": ["Calm Emotions", "Hold Person"],
          "9": ["Counterspell", "Hypnotic Pattern"],
          "13": ["Otiluke's Resilient Sphere", "Stoneskin"],
          "17": ["Hold Monster", "Wall of Force"]
        },
        "featuresByLevel": {
          "3": [{"name": "Channel Divinity: Emissary of Peace", "description": "As a bonus action, you grant yourself a +5 bonus to Charisma (Persuasion) checks for the next 10 minutes."}, {"name": "Channel Divinity: Rebuke the Violent", "description": "Immediately after an attacker within 30 feet deals damage with an attack against a creature other than you, you can use your reaction to force the attacker to make a Wisdom saving throw. On a failed save, the attacker takes radiant damage equal to the damage it just dealt. On a successful save, it takes half as much damage."}],
          "7": [{"name": "Aura of the Guardian", "description": "When a creature within 10 feet of you takes damage, you can use your reaction to magically take that damage instead. This feature doesn't transfer any other effects that might accompany the damage. At 18th level, the range increases to 30 feet."}],
          "15": [{"name": "Protective Spirit", "description": "A holy presence mends your wounds in battle. You regain hit points equal to 1d6 + half your paladin level if you end your turn in combat with fewer than half of your hit points remaining and you aren't incapacitated."}],
          "20": [{"name": "Emissary of Redemption", "description": "You become an avatar of peace. You have resistance to all damage dealt by other creatures. Whenever a creature hits you with an attack, it takes radiant damage equal to half the damage you take from the attack. If you attack a creature, cast a spell on it, or deal damage to it, these benefits are suspended for that creature."}]
        }
      },
      {
        "name": "Oath of Glory",
        "description": "Champion who seeks to achieve legendary deeds",
        "oathSpells": {
          "3": ["Guiding Bolt", "Heroism"],
          "5": ["Enhance Ability", "Magic Weapon"],
          "9": ["Haste", "Protection from Energy"],
          "13": ["Compulsion", "Freedom of Movement"],
          "17": ["Commune", "Flame Strike"]
        },
        "featuresByLevel": {
          "3": [{"name": "Channel Divinity: Peerless Athlete", "description": "As a bonus action, you can use your Channel Divinity to augment your athleticism. For the next 10 minutes, you have advantage on Strength (Athletics) and Dexterity (Acrobatics) checks; you can carry, push, drag, and lift twice as much weight as normal; and the distance of your long and high jumps increases by 10 feet."}, {"name": "Channel Divinity: Inspiring Smite", "description": "Immediately after you deal damage to a creature with your Divine Smite feature, you can use your Channel Divinity as a bonus action and distribute temporary hit points to creatures of your choice within 30 feet of you, which can include you. The total number of temporary hit points equals 2d8 + your paladin level, divided among the chosen creatures however you like."}],
          "7": [{"name": "Aura of Alacrity", "description": "You emanate an aura that fills you and your companions with supernatural speed, allowing you to race across a battlefield. Your walking speed increases by 10 feet. In addition, if you aren't incapacitated, the walking speed of any ally who starts their turn within 5 feet of you increases by 10 feet until the end of that turn. At 18th level, the range increases to 10 feet."}],
          "15": [{"name": "Glorious Defense", "description": "When you or another creature you can see within 10 feet of you is hit by an attack roll, you can use your reaction to grant a bonus to the target's AC equal to your Charisma modifier, potentially causing the attack to miss. If the attack misses, you can make one weapon attack against the attacker as part of this reaction, provided the attacker is within your weapon's range."}],
          "20": [{"name": "Living Legend", "description": "You can empower yourself with the legends—whether true or exaggerated—of your great deeds. As a bonus action, you gain the following benefits for 1 minute: you are blessed with an otherworldly presence, gaining advantage on all Charisma checks; once on each of your turns when you miss with a weapon attack, you can cause that attack to hit instead; and if you fail a saving throw, you can use your reaction to reroll it."}]
        }
      },
      {
        "name": "Oath of the Watchers",
        "description": "Sentinel against extraplanar threats",
        "oathSpells": {
          "3": ["Alarm", "Detect Magic"],
          "5": ["Moonbeam", "See Invisibility"],
          "9": ["Counterspell", "Nondetection"],
          "13": ["Aura of Purity", "Banishment"],
          "17": ["Hold Monster", "Scrying"]
        },
        "featuresByLevel": {
          "3": [{"name": "Channel Divinity: Watcher's Will", "description": "You can use your Channel Divinity to invest your presence with the warding power of your faith. As an action, you choose a number of creatures you can see within 30 feet of you, up to a number equal to your Charisma modifier (minimum of one creature). For 1 minute, you and the chosen creatures have advantage on Intelligence, Wisdom, and Charisma saving throws."}, {"name": "Channel Divinity: Abjure the Extraplanar", "description": "You can use your Channel Divinity to castigate unworldly beings. As an action, you present your holy symbol and each aberration, celestial, elemental, fey, or fiend within 30 feet of you that can hear you must make a Wisdom saving throw. On a failed save, the creature is turned for 1 minute or until it takes damage."}],
          "7": [{"name": "Aura of the Sentinel", "description": "You emit an aura of alertness while you aren't incapacitated. When you and any creatures of your choice within 10 feet of you roll initiative, you each gain a bonus to initiative equal to your proficiency bonus. At 18th level, the range increases to 30 feet."}],
          "15": [{"name": "Vigilant Rebuke", "description": "You've learned how to chastise anyone who dares wield beguilements against you and your wards. Whenever you or a creature you can see within 30 feet of you succeeds on an Intelligence, a Wisdom, or a Charisma saving throw, you can use your reaction to deal 2d8 + your Charisma modifier force damage to the creature that forced the saving throw."}],
          "20": [{"name": "Mortal Bulwark", "description": "You manifest a spark of divine power in defense of the mortal realms. As a bonus action, you gain the following benefits for 1 minute: you gain truesight with a range of 120 feet; you have advantage on attack rolls against aberrations, celestials, elementals, fey, and fiends; when you hit a creature with an attack roll and deal damage to it, you can also force it to make a Charisma saving throw. On a failed save, the creature is magically banished to its native plane of existence if it's not currently there."}]
        }
      },
      {
        "name": "Oathbreaker",
        "description": "Fallen paladin who serves dark powers",
        "oathSpells": {
          "3": ["Hellish Rebuke", "Inflict Wounds"],
          "5": ["Crown of Madness", "Darkness"],
          "9": ["Animate Dead", "Bestow Curse"],
          "13": ["Blight", "Confusion"],
          "17": ["Contagion", "Dominate Person"]
        },
        "featuresByLevel": {
          "3": [{"name": "Channel Divinity: Control Undead", "description": "As an action, you target one undead creature you can see within 30 feet. The target must make a Wisdom saving throw. On a failed save, the target must obey your commands for the next 24 hours, or until you use this Channel Divinity option again."}, {"name": "Channel Divinity: Dreadful Aspect", "description": "As an action, you channel the darkest emotions and focus them into a burst of magical menace. Each creature of your choice within 30 feet of you must make a Wisdom saving throw if it can see you. On a failed save, the target is frightened of you for 1 minute."}],
          "7": [{"name": "Aura of Hate", "description": "You, as well as any fiends and undead within 10 feet of you, gain a bonus to melee weapon damage rolls equal to your Charisma modifier (minimum of +1). At 18th level, the range increases to 30 feet."}],
          "15": [{"name": "Supernatural Resistance", "description": "You gain resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons."}],
          "20": [{"name": "Dread Lord", "description": "You can, as an action, surround yourself with an aura of gloom that lasts for 1 minute. The aura reduces any bright light in a 30-foot radius around you to dim light. Whenever an enemy that is frightened by you starts its turn in the aura, it takes 4d10 psychic damage. Additionally, you and any creatures of your choosing in the aura are draped in deeper shadow. Creatures that rely on sight have disadvantage on attack rolls against creatures draped in this shadow."}]
        }
      },
      {
        "name": "Oath of the Spellguard",
        "description": "Paladins who swear the Oath of the Spellguard dedicate themselves to protecting the world from the misuse of magic and hunting down those who wield arcane power for evil",
        "source": "Unearthed Arcana",
        "oathSpells": {
          "3": ["Detect Magic", "Shield"],
          "5": ["Silence", "See Invisibility"],
          "9": ["Counterspell", "Dispel Magic"],
          "13": ["Arcane Eye", "Otiluke's Resilient Sphere"],
          "17": ["Antimagic Field", "Wall of Force"]
        },
        "featuresByLevel": {
          "3": [{"name": "Channel Divinity: Spellbreaker", "description": "As an action, you can use your Channel Divinity to attempt to end a spell affecting a creature you can touch. Make an ability check using your Charisma modifier. The DC equals 10 + the spell's level. On a success, the spell ends."}, {"name": "Channel Divinity: Arcane Pursuit", "description": "When a creature you can see within 60 feet casts a spell, you can use your reaction and your Channel Divinity to move up to your speed toward that creature. This movement doesn't provoke opportunity attacks. If you end this movement within 5 feet of the creature, you can make one weapon attack against it as part of this reaction."}],
          "7": [{"name": "Aura of the Spellguard", "description": "You and friendly creatures within 10 feet of you have advantage on saving throws against spells. At 18th level, the range of this aura increases to 30 feet."}],
          "15": [{"name": "Spell Resistance", "description": "You have resistance to damage from spells. Additionally, when you succeed on a saving throw against a spell, you take no damage if you would normally take half damage on a successful save."}],
          "20": [{"name": "Champion of the Spellguard", "description": "As an action, you can become an avatar of antimagic for 1 minute. During this time: you are immune to damage from spells and magical effects; you can cast Counterspell at will without expending a spell slot; when you hit a creature with a melee weapon attack, you can end one spell of your choice affecting that creature. Once you use this feature, you can't use it again until you finish a long rest."}]
        }
      },
      {
        "name": "Oath of Resolve",
        "description": "Paladins who take the Oath of Resolve are unwavering in their dedication, standing firm against impossible odds and inspiring others through their unshakeable determination",
        "source": "Hoard of Heroes",
        "oathSpells": {
          "3": ["Heroism", "Shield of Faith"],
          "5": ["Calm Emotions", "Warding Bond"],
          "9": ["Beacon of Hope", "Spirit Guardians"],
          "13": ["Death Ward", "Stoneskin"],
          "17": ["Circle of Power", "Wall of Force"]
        },
        "featuresByLevel": {
          "3": [{"name": "Channel Divinity: Unyielding Stand", "description": "As a bonus action, you plant yourself firmly and invoke your divine resolve. For 1 minute, you can't be moved against your will, you have advantage on saving throws against being knocked prone or stunned, and you add your Charisma modifier to Constitution saving throws."}, {"name": "Channel Divinity: Inspire Courage", "description": "As an action, you can bolster the resolve of your allies. Choose a number of creatures you can see within 30 feet equal to your Charisma modifier (minimum 1). Each creature gains temporary hit points equal to your paladin level + your Charisma modifier and can't be frightened while these temporary hit points remain."}],
          "7": [{"name": "Aura of Determination", "description": "You and friendly creatures within 10 feet of you can't be charmed while you are conscious. Additionally, when an ally within your aura would be reduced to 0 hit points, they can choose to be reduced to 1 hit point instead. Once a creature benefits from this feature, it can't do so again until it finishes a long rest. At 18th level, the range of this aura increases to 30 feet."}],
          "15": [{"name": "Unbreakable Will", "description": "You have advantage on all saving throws. Additionally, when you fail a saving throw, you can choose to succeed instead. Once you use this ability to succeed, you can't do so again until you finish a long rest."}],
          "20": [{"name": "Avatar of Resolve", "description": "As an action, you become an embodiment of unwavering determination for 1 minute. During this time: you are immune to the charmed, frightened, paralyzed, and stunned conditions; you have resistance to all damage; at the start of each of your turns, you regain hit points equal to your Charisma modifier if you have no more than half your hit points remaining. Once you use this feature, you can't use it again until you finish a long rest."}]
        }
      }
    ]
  },
  "ranger": {
    "name": "Ranger",
    "description": "A warrior who uses martial prowess and nature magic to combat threats on the edges of civilization",
    "hitDie": 10,
    "primaryAbility": ["dex", "wis"],
    "dumpStat": "cha",
    "savingThrows": ["str", "dex"],
    "skillChoices": 3,
    "skillOptions": ["animal_handling", "athletics", "insight", "investigation", "nature", "perception", "stealth", "survival"],
    "armorProficiencies": ["light", "medium", "shields"],
    "weaponProficiencies": ["simple", "martial"],
    "startingEquipment": {
      "choices": [
        {
          "choose": 1,
          "from": [
            "Scale Mail",
            "Leather Armor"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Two Shortswords",
            "Two Simple Melee Weapons"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Dungeoneer's Pack",
            "Explorer's Pack"
          ]
        }
      ],
      "given": ["Longbow", "Quiver of 20 Arrows"]
    },
    "startingGold": {
      "dice": "5d4",
      "multiplier": 10,
      "average": 125
    },
    "spellcasting": {
      "ability": "wis",
      "spellsKnown": "Limited known",
      "cantripsKnown": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      "spellsKnownByLevel": [0, 2, 3, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 11, 11]
    },
    "features": [
      "Favored Enemy - You have significant experience studying, tracking, and hunting a certain type of enemy",
      "Natural Explorer - You are particularly familiar with one type of natural environment",
      "Spellcasting - You can cast ranger spells using Wisdom as your spellcasting ability"
    ],
    "subclasses": [
      {
        "name": "Hunter",
        "description": "Master of hunting and tracking prey",
        "featuresByLevel": {
          "3": [{"name": "Hunter's Prey", "description": "Choose one of the following features: Colossus Slayer (once per turn, deal extra 1d8 damage to a creature below its hit point maximum), Giant Killer (reaction attack when a Large+ creature attacks you), or Horde Breaker (make an additional attack against a different creature within 5 feet of original target)."}],
          "7": [{"name": "Defensive Tactics", "description": "Choose one: Escape the Horde (opportunity attacks against you have disadvantage), Multiattack Defense (+4 AC after being hit by a creature until its turn ends), or Steel Will (advantage on saving throws against being frightened)."}],
          "11": [{"name": "Multiattack", "description": "Choose one: Volley (make a ranged attack against any number of creatures within 10 feet of a point within range, with a separate attack roll for each), or Whirlwind Attack (use your action to make a melee attack against any number of creatures within 5 feet of you)."}],
          "15": [{"name": "Superior Hunter's Defense", "description": "Choose one: Evasion (Dexterity saves for half damage become no damage on success, half on failure), Stand Against the Tide (when a creature misses you with melee, you can force it to attack another creature), or Uncanny Dodge (halve an attack's damage as a reaction)."}]
        }
      },
      {
        "name": "Beast Master",
        "description": "Ranger bonded with an animal companion",
        "featuresByLevel": {
          "3": [{"name": "Ranger's Companion", "description": "You gain a beast companion that accompanies you on your adventures and is trained to fight alongside you. Choose a beast that is no larger than Medium and has a challenge rating of 1/4 or lower. The beast obeys your commands as best as it can. It shares your initiative, takes its turn immediately after yours, and can move and use its reaction on its own."}],
          "7": [{"name": "Exceptional Training", "description": "On any of your turns when your beast companion doesn't attack, you can use a bonus action to command the beast to take the Dash, Disengage, or Help action on its turn. In addition, the beast's attacks now count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage."}],
          "11": [{"name": "Bestial Fury", "description": "When you command your beast companion to take the Attack action, the beast can make two attacks, or it can take the Multiattack action if it has that action."}],
          "15": [{"name": "Share Spells", "description": "When you cast a spell targeting yourself, you can also affect your beast companion with the spell if the beast is within 30 feet of you."}]
        }
      },
      {
        "name": "Gloom Stalker",
        "description": "Master of the Underdark and deep shadows",
        "gloomStalkerSpells": {
          "3": ["Disguise Self"],
          "5": ["Rope Trick"],
          "9": ["Fear"],
          "13": ["Greater Invisibility"],
          "17": ["Seeming"]
        },
        "featuresByLevel": {
          "3": [{"name": "Dread Ambusher", "description": "At the start of your first turn of each combat, your walking speed increases by 10 feet, which lasts until the end of that turn. If you take the Attack action on that turn, you can make one additional weapon attack as part of that action. If that attack hits, the target takes an extra 1d8 damage of the weapon's damage type."}, {"name": "Umbral Sight", "description": "You gain darkvision out to a range of 60 feet. If you already have darkvision, its range increases by 30 feet. You are also adept at evading creatures that rely on darkvision. While in darkness, you are invisible to any creature that relies on darkvision to see you in that darkness."}],
          "7": [{"name": "Iron Mind", "description": "You gain proficiency in Wisdom saving throws. If you already have this proficiency, you instead gain proficiency in Intelligence or Charisma saving throws (your choice)."}],
          "11": [{"name": "Stalker's Flurry", "description": "Once on each of your turns when you miss with a weapon attack, you can make another weapon attack as part of the same action."}],
          "15": [{"name": "Shadowy Dodge", "description": "Whenever a creature makes an attack roll against you and doesn't have advantage on the roll, you can use your reaction to impose disadvantage on it. You must use this feature before you know the outcome of the attack roll."}]
        }
      },
      {
        "name": "Horizon Walker",
        "description": "Guardian against threats from other planes",
        "horizonWalkerSpells": {
          "3": ["Protection from Evil and Good"],
          "5": ["Misty Step"],
          "9": ["Haste"],
          "13": ["Banishment"],
          "17": ["Teleportation Circle"]
        },
        "featuresByLevel": {
          "3": [{"name": "Detect Portal", "description": "As an action, you detect the distance and direction to the closest planar portal within 1 mile of you. Once you use this feature, you can't use it again until you finish a short or long rest."}, {"name": "Planar Warrior", "description": "As a bonus action, choose one creature you can see within 30 feet. The next time you hit that creature on this turn with a weapon attack, all damage dealt by the attack becomes force damage, and the creature takes an extra 1d8 force damage (2d8 at 11th level)."}],
          "7": [{"name": "Ethereal Step", "description": "You can cast Etherealness with this feature, without expending a spell slot, but the spell ends at the end of the current turn. Once you use this feature, you can't use it again until you finish a short or long rest."}],
          "11": [{"name": "Distant Strike", "description": "You gain the ability to pass between the planes in the blink of an eye. When you take the Attack action, you can teleport up to 10 feet before each attack to an unoccupied space you can see. If you attack at least two different creatures with the action, you can make one additional attack against a third creature."}],
          "15": [{"name": "Spectral Defense", "description": "When you take damage from an attack, you can use your reaction to give yourself resistance to all of that attack's damage on this turn."}]
        }
      },
      {
        "name": "Monster Slayer",
        "description": "Expert at hunting down dangerous creatures",
        "monsterSlayerSpells": {
          "3": ["Protection from Evil and Good"],
          "5": ["Zone of Truth"],
          "9": ["Magic Circle"],
          "13": ["Banishment"],
          "17": ["Hold Monster"]
        },
        "featuresByLevel": {
          "3": [{"name": "Hunter's Sense", "description": "As an action, choose one creature you can see within 60 feet. You immediately learn whether the creature has any damage immunities, resistances, or vulnerabilities and what they are. If the creature is hidden from divination magic, you sense that it has no damage immunities, resistances, or vulnerabilities. You can use this feature a number of times equal to your Wisdom modifier."}, {"name": "Slayer's Prey", "description": "As a bonus action, you designate one creature you can see within 60 feet as your prey. The first time each turn that you hit that target with a weapon attack, it takes an extra 1d6 damage."}],
          "7": [{"name": "Supernatural Defense", "description": "Whenever the target of your Slayer's Prey forces you to make a saving throw and whenever you make an ability check to escape that target's grapple, add 1d6 to your roll."}],
          "11": [{"name": "Magic-User's Nemesis", "description": "When you see a creature casting a spell or teleporting within 60 feet, you can use your reaction to try to magically foil it. The creature must succeed on a Wisdom saving throw against your spell save DC, or its spell or teleport fails."}],
          "15": [{"name": "Slayer's Counter", "description": "If the target of your Slayer's Prey forces you to make a saving throw, you can use your reaction to make one weapon attack against the quarry. You make this attack immediately before making the saving throw. If your attack hits, your save automatically succeeds."}]
        }
      },
      {
        "name": "Fey Wanderer",
        "description": "Mystical wanderer touched by the Feywild",
        "feyWandererSpells": {
          "3": ["Charm Person"],
          "5": ["Misty Step"],
          "9": ["Dispel Magic"],
          "13": ["Dimension Door"],
          "17": ["Mislead"]
        },
        "featuresByLevel": {
          "3": [{"name": "Dreadful Strikes", "description": "You can augment your weapon strikes with mind-scarring magic. Once per turn, when you hit a creature with a weapon, you can deal an extra 1d4 psychic damage (1d6 at 11th level)."}, {"name": "Otherworldly Glamour", "description": "Your fey qualities give you a supernatural charm. You gain proficiency in one of the following skills: Deception, Performance, or Persuasion. You can also add your Wisdom modifier to any Charisma check you make."}],
          "7": [{"name": "Beguiling Twist", "description": "The magic of the Feywild guards your mind. You have advantage on saving throws against being charmed or frightened. In addition, whenever you or a creature you can see within 120 feet succeeds on a saving throw against being charmed or frightened, you can use your reaction to force a different creature you can see within 120 feet to make a Wisdom save or become charmed or frightened by you for 1 minute."}],
          "11": [{"name": "Fey Reinforcements", "description": "You can cast Summon Fey without a material component. You can also cast it once without a spell slot, and you regain the ability to do so when you finish a long rest. Whenever you start casting the spell, you can modify it so that it doesn't require concentration. If you do so, the spell's duration becomes 1 minute."}],
          "15": [{"name": "Misty Wanderer", "description": "You can cast Misty Step without expending a spell slot. You can do so a number of times equal to your Wisdom modifier, and you regain all expended uses when you finish a long rest. In addition, when you cast Misty Step, you can bring along one willing creature within 5 feet of you."}]
        }
      },
      {
        "name": "Swarmkeeper",
        "description": "Ranger accompanied by a swarm of nature spirits",
        "swarmkeeperSpells": {
          "3": ["Faerie Fire", "Mage Hand"],
          "5": ["Web"],
          "9": ["Gaseous Form"],
          "13": ["Arcane Eye"],
          "17": ["Insect Plague"]
        },
        "featuresByLevel": {
          "3": [{"name": "Gathered Swarm", "description": "A swarm of intangible nature spirits has bonded itself to you. Once per turn, you can cause the swarm to assist you in one of the following ways immediately after you hit a creature with an attack: deal 1d6 piercing damage to the target, the target must succeed on a Strength save or be moved 15 feet horizontally, or you are moved 5 feet horizontally by the swarm. The damage increases to 1d8 at 11th level."}],
          "7": [{"name": "Writhing Tide", "description": "You can condense part of your swarm into a focused mass that lifts you up. As a bonus action, you gain a flying speed of 10 feet and can hover for 1 minute. You can use this feature a number of times equal to your proficiency bonus."}],
          "11": [{"name": "Mighty Swarm", "description": "Your Gathered Swarm grows mightier: the damage of Gathered Swarm increases to 1d8. If a creature fails its saving throw against being moved by Gathered Swarm, you can also knock the creature prone. When you are moved by Gathered Swarm, it gives you half cover until the start of your next turn."}],
          "15": [{"name": "Swarming Dispersal", "description": "When you take damage, you can use your reaction to give yourself resistance to that damage. You vanish into your swarm and then teleport to an unoccupied space that you can see within 30 feet. You can use this feature a number of times equal to your proficiency bonus."}]
        }
      },
      {
        "name": "Drakewarden",
        "description": "Bond with a draconic companion",
        "featuresByLevel": {
          "3": [{"name": "Draconic Gift", "description": "The bond you share with your drake creates a connection to dragonkind. You learn to speak, read, and write Draconic. You learn the Thaumaturgy cantrip, which is a ranger spell for you."}, {"name": "Drake Companion", "description": "As an action, you can summon your drake companion. It appears in an unoccupied space of your choice within 30 feet. The drake is friendly to you and your companions, and it obeys your commands. In combat, the drake shares your initiative count, but takes its turn immediately after yours. It can move and use its reaction on its own, but the only action it takes is the Dodge action, unless you take a bonus action to command it."}],
          "7": [{"name": "Bond of Fang and Scale", "description": "The bond between you and your drake intensifies, granting you new powers: the drake can be Medium or Small (your choice), you can mount the drake if it is Medium, the drake's Infused Strikes damage increases to 1d6, and you gain resistance to the damage type of your drake's Draconic Essence (Acid, Cold, Fire, Lightning, or Poison)."}],
          "11": [{"name": "Drake's Breath", "description": "As an action, you can exhale a 30-foot cone of damaging breath or cause your drake to exhale it. Choose acid, cold, fire, lightning, or poison damage. Each creature in the cone must make a Dexterity saving throw, taking 8d6 damage on a failed save, or half as much on a successful one. Once you use this feature, you can't do so again until you finish a long rest, unless you expend a spell slot of 3rd level or higher to use it again."}],
          "15": [{"name": "Perfected Bond", "description": "Your bond to your drake reaches the pinnacle of its power. The drake can now be Large, its Infused Strikes damage increases to 2d6, and when either you or the drake takes damage while you're within 30 feet of each other, you can use your reaction to give yourself or the drake resistance to that instance of damage. You can use this reaction a number of times equal to your proficiency bonus."}]
        }
      },
      {
        "name": "Stone Singer",
        "description": "Rangers who hear the ancient songs of the earth itself, communing with stone and using its power to protect the natural world",
        "source": "Hoard of Heroes",
        "stoneSingerSpells": {
          "3": ["Earth Tremor"],
          "5": ["Earthbind"],
          "9": ["Meld into Stone"],
          "13": ["Stone Shape"],
          "17": ["Wall of Stone"]
        },
        "featuresByLevel": {
          "3": [{"name": "Stone's Song", "description": "You can hear the whispers of the earth. You gain tremorsense with a range of 30 feet. Additionally, you can spend 1 minute communing with the ground to learn information about the surrounding area within 1 mile, including the location of underground passages, mineral deposits, or creatures touching the ground."}, {"name": "Earth Strike", "description": "When you hit a creature with a weapon attack, you can cause stone to momentarily rise from the ground and strike your target. The creature takes an extra 1d6 bludgeoning damage and must succeed on a Strength saving throw or have its speed reduced by 10 feet until the end of its next turn. This damage increases to 2d6 at 11th level."}],
          "7": [{"name": "Earthen Armor", "description": "As a bonus action, you can call stone to encase your body, granting you a +2 bonus to AC. This armor lasts for 1 hour or until you dismiss it as a bonus action. While wearing this armor, you have disadvantage on Dexterity (Stealth) checks but have advantage on saving throws against being moved against your will. You can use this feature a number of times equal to your proficiency bonus."}],
          "11": [{"name": "Reshape the Land", "description": "You can manipulate the earth around you. As an action, you can raise or lower an area of earth or stone up to 10 feet square by up to 10 feet. Creatures in the area when it changes must succeed on a Dexterity saving throw or fall prone. You can use this feature a number of times equal to your Wisdom modifier."}],
          "15": [{"name": "Heart of the Mountain", "description": "You gain resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks. Additionally, when you use your Earthen Armor feature, the bonus to AC increases to +3, and you have advantage on all saving throws against spells and magical effects."}]
        }
      }
    ]
  },
  "rogue": {
    "name": "Rogue",
    "description": "A scoundrel who uses stealth and trickery to overcome obstacles and enemies",
    "hitDie": 8,
    "primaryAbility": ["dex"],
    "dumpStat": "str",
    "savingThrows": ["dex", "int"],
    "skillChoices": 4,
    "skillOptions": ["acrobatics", "athletics", "deception", "insight", "intimidation", "investigation", "perception", "performance", "persuasion", "sleight_of_hand", "stealth"],
    "armorProficiencies": ["light"],
    "weaponProficiencies": ["simple", "hand crossbows", "longswords", "rapiers", "shortswords"],
    "toolProficiencies": ["Thieves' Tools"],
    "startingEquipment": {
      "choices": [
        {
          "choose": 1,
          "from": [
            "Rapier",
            "Shortsword"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Shortbow and 20 Arrows",
            "Shortsword"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Burglar's Pack",
            "Dungeoneer's Pack",
            "Explorer's Pack"
          ]
        }
      ],
      "given": ["Leather Armor", "Two Daggers", "Thieves' Tools"]
    },
    "startingGold": {
      "dice": "4d4",
      "multiplier": 10,
      "average": 100
    },
    "features": [
      "Expertise - Choose two skills to double your proficiency bonus for ability checks",
      "Sneak Attack - You know how to strike subtly and exploit a foe's distraction",
      "Thieves' Cant - You know thieves' cant, a secret mix of dialect, jargon, and code"
    ],
    "subclasses": [
      {
        "name": "Thief",
        "description": "Master of stealth and cunning",
        "featuresByLevel": {
          "3": [{"name": "Fast Hands", "description": "You can use the bonus action granted by your Cunning Action to make a Dexterity (Sleight of Hand) check, use your thieves' tools to disarm a trap or open a lock, or take the Use an Object action."}, {"name": "Second-Story Work", "description": "You gain the ability to climb faster than normal; climbing no longer costs you extra movement. In addition, when you make a running jump, the distance you cover increases by a number of feet equal to your Dexterity modifier."}],
          "9": [{"name": "Supreme Sneak", "description": "You have advantage on a Dexterity (Stealth) check if you move no more than half your speed on the same turn."}],
          "13": [{"name": "Use Magic Device", "description": "You have learned enough about the workings of magic that you can improvise the use of items even when they are not intended for you. You ignore all class, race, and level requirements on the use of magic items."}],
          "17": [{"name": "Thief's Reflexes", "description": "You have become adept at laying ambushes and quickly escaping danger. You can take two turns during the first round of any combat. You take your first turn at your normal initiative and your second turn at your initiative minus 10. You can't use this feature when you are surprised."}]
        }
      },
      {
        "name": "Assassin",
        "description": "Expert in dealing sudden, lethal strikes",
        "bonusProficiencies": ["Disguise Kit", "Poisoner's Kit"],
        "featuresByLevel": {
          "3": [{"name": "Bonus Proficiencies", "description": "You gain proficiency with the disguise kit and the poisoner's kit."}, {"name": "Assassinate", "description": "You are at your deadliest when you get the drop on your enemies. You have advantage on attack rolls against any creature that hasn't taken a turn in the combat yet. In addition, any hit you score against a creature that is surprised is a critical hit."}],
          "9": [{"name": "Infiltration Expertise", "description": "You can unfailingly create false identities for yourself. You must spend seven days and 25 gp to establish the history, profession, and affiliations for an identity. You can't establish an identity that belongs to someone else. Thereafter, if you adopt the new identity as a disguise, other creatures believe you to be that person until given an obvious reason not to."}],
          "13": [{"name": "Impostor", "description": "You gain the ability to unerringly mimic another person's speech, writing, and behavior. You must spend at least three hours studying these three components of the person's behavior, listening to speech, examining handwriting, and observing mannerisms. Your ruse is indiscernible to the casual observer. If a wary creature suspects something is amiss, you have advantage on any Charisma (Deception) check you make to avoid detection."}],
          "17": [{"name": "Death Strike", "description": "You become a master of instant death. When you attack and hit a creature that is surprised, it must make a Constitution saving throw (DC 8 + your Dexterity modifier + your proficiency bonus). On a failed save, double the damage of your attack against the creature."}]
        }
      },
      {
        "name": "Arcane Trickster",
        "description": "Rogue enhanced by illusion and enchantment magic",
        "spellcasting": {"ability": "int", "schools": ["Illusion", "Enchantment"]},
        "featuresByLevel": {
          "3": [{"name": "Spellcasting", "description": "You learn to cast spells. You learn three cantrips: Mage Hand and two other cantrips of your choice from the wizard spell list. You learn three 1st-level wizard spells of your choice, two of which must be enchantment or illusion spells. Intelligence is your spellcasting ability for these spells."}, {"name": "Mage Hand Legerdemain", "description": "When you cast Mage Hand, you can make the spectral hand invisible, and you can perform the following additional tasks with it: stow or retrieve an object in a container worn or carried by another creature, use thieves' tools to pick locks and disarm traps at range. You can perform one of these tasks without being noticed by a creature if you succeed on a Dexterity (Sleight of Hand) check contested by the creature's Wisdom (Perception) check. Additionally, you can use the bonus action granted by your Cunning Action to control the hand."}],
          "9": [{"name": "Magical Ambush", "description": "If you are hidden from a creature when you cast a spell on it, the creature has disadvantage on any saving throw it makes against the spell this turn."}],
          "13": [{"name": "Versatile Trickster", "description": "You gain the ability to distract targets with your Mage Hand. As a bonus action on your turn, you can designate a creature within 5 feet of the spectral hand created by the spell. Doing so gives you advantage on attack rolls against that creature until the end of the turn."}],
          "17": [{"name": "Spell Thief", "description": "You gain the ability to magically steal the knowledge of how to cast a spell from another spellcaster. Immediately after a creature casts a spell that targets you or includes you in its area of effect, you can use your reaction to force the creature to make a saving throw with its spellcasting ability modifier. On a failed save, you negate the spell's effect against you, and you steal the knowledge of the spell if it is at least 1st level and of a level you can cast. For the next 8 hours, you know the spell and can cast it using your spell slots. The creature can't cast that spell until the 8 hours have passed."}]
        }
      },
      {
        "name": "Swashbuckler",
        "description": "Dashing duelist who uses charm and agility",
        "featuresByLevel": {
          "3": [{"name": "Fancy Footwork", "description": "During your turn, if you make a melee attack against a creature, that creature can't make opportunity attacks against you for the rest of your turn."}, {"name": "Rakish Audacity", "description": "Your confidence propels you into battle. You can give yourself a bonus to your initiative rolls equal to your Charisma modifier. You also gain an additional way to use your Sneak Attack; you don't need advantage on the attack roll to use your Sneak Attack against a creature if you are within 5 feet of it, no other creature is within 5 feet of you, and you don't have disadvantage on the attack roll. All the other rules for Sneak Attack still apply to you."}],
          "9": [{"name": "Panache", "description": "Your charm becomes extraordinarily beguiling. As an action, you can make a Charisma (Persuasion) check contested by a creature's Wisdom (Insight) check. The creature must be able to hear you, and the two of you must share a language. If you succeed and the creature is hostile to you, it has disadvantage on attack rolls against targets other than you and can't make opportunity attacks against targets other than you. If you succeed and the creature isn't hostile to you, it is charmed by you for 1 minute."}],
          "13": [{"name": "Elegant Maneuver", "description": "You can use a bonus action on your turn to gain advantage on the next Dexterity (Acrobatics) or Strength (Athletics) check you make during the same turn."}],
          "17": [{"name": "Master Duelist", "description": "Your mastery of the blade lets you turn failure into success in combat. If you miss with an attack roll, you can roll it again with advantage. Once you do so, you can't use this feature again until you finish a short or long rest."}]
        }
      },
      {
        "name": "Scout",
        "description": "Skirmisher and survivalist who excels in ambushes",
        "featuresByLevel": {
          "3": [{"name": "Skirmisher", "description": "You are difficult to pin down during a fight. You can move up to half your speed as a reaction when an enemy ends its turn within 5 feet of you. This movement doesn't provoke opportunity attacks."}, {"name": "Survivalist", "description": "You gain proficiency in the Nature and Survival skills if you don't already have it. Your proficiency bonus is doubled for any ability check you make that uses either of those proficiencies."}],
          "9": [{"name": "Superior Mobility", "description": "Your walking speed increases by 10 feet. If you have a climbing or swimming speed, this increase applies to that speed as well."}],
          "13": [{"name": "Ambush Master", "description": "You excel at leading ambushes and acting first in a fight. You have advantage on initiative rolls. In addition, the first creature you hit during the first round of a combat becomes easier for you and others to strike; attack rolls against that target have advantage until the start of your next turn."}],
          "17": [{"name": "Sudden Strike", "description": "You can strike with deadly speed. If you take the Attack action on your turn, you can make one additional attack as a bonus action. This attack can benefit from your Sneak Attack even if you have already used it this turn, but you can't use your Sneak Attack against the same target more than once in a turn."}]
        }
      },
      {
        "name": "Phantom",
        "description": "Rogue with a connection to the dead",
        "featuresByLevel": {
          "3": [{"name": "Whispers of the Dead", "description": "Echoes of those who have died cling to you. Whenever you finish a short or long rest, you can gain one skill or tool proficiency of your choice, as a ghostly presence shares its knowledge with you. You lose this proficiency when you use this feature to choose a different proficiency that you lack."}, {"name": "Wails from the Grave", "description": "Immediately after you deal your Sneak Attack damage to a creature on your turn, you can target a second creature that you can see within 30 feet of the first creature. Roll half the number of Sneak Attack dice for your level (round up), and the second creature takes necrotic damage equal to the roll's total, as wails of the dead sound around them for a moment. You can use this feature a number of times equal to your proficiency bonus."}],
          "9": [{"name": "Tokens of the Departed", "description": "When a life ends in your presence, you're able to snatch a token from the departing soul. When a creature you can see dies within 30 feet of you, you can use your reaction to create a soul trinket. You can have a maximum number of soul trinkets equal to your proficiency bonus, and you can't create one while at your maximum. You can use soul trinkets in the following ways: while a soul trinket is on your person, you have advantage on death saving throws and Constitution saving throws; when you deal Sneak Attack damage on your turn, you can destroy one of your soul trinkets to deal extra necrotic damage to the target equal to half your Sneak Attack damage dice, rounded up; as an action, you can destroy a soul trinket to ask the spirit associated with it one question and it answers in a language it knew in life."}],
          "13": [{"name": "Ghost Walk", "description": "You can phase partially into the realm of the dead, becoming like a ghost. As a bonus action, you assume a spectral form. While in this form, you have a flying speed of 10 feet, you can hover, and attack rolls have disadvantage against you. You can also move through creatures and objects as if they were difficult terrain, but you take 1d10 force damage if you end your turn inside a creature or an object. You stay in this form for 10 minutes or until you end it as a bonus action."}],
          "17": [{"name": "Death's Friend", "description": "Your association with death has become so close that you gain the following benefits: When you use your Wails from the Grave, you can deal the necrotic damage to both the first and the second creature. At the end of a long rest, a soul trinket appears in your hand if you don't have any soul trinkets, as the spirits of the dead are drawn to you."}]
        }
      },
      {
        "name": "Soulknife",
        "description": "Rogue who manifests psychic blades",
        "featuresByLevel": {
          "3": [{"name": "Psionic Power", "description": "You harbor a wellspring of psionic energy within yourself. This energy is represented by your Psionic Energy dice, which are each a d6. You have a number of these dice equal to twice your proficiency bonus. You can use them for Psi-Bolstered Knack (add to a failed skill check) or Psychic Whispers (telepathic communication)."}, {"name": "Psychic Blades", "description": "You can manifest your psionic power as shimmering blades of psychic energy. Whenever you take the Attack action, you can manifest a psychic blade from your free hand and make the attack with that blade. This magic blade is a simple melee weapon with the finesse and thrown properties. It vanishes immediately after it hits or misses its target, and it leaves no mark on its target if it deals damage. After you attack with the blade, you can make a melee or ranged weapon attack with a second psychic blade as a bonus action on the same turn, provided your other hand is free."}],
          "9": [{"name": "Soul Blades", "description": "Your Psychic Blades are now an expression of your psi-suffused soul. You gain the following abilities: Homing Strikes (if you make an attack roll with your psychic blade and miss the target, you can roll one Psionic Energy die and add the number rolled to the attack roll) and Psychic Teleportation (as a bonus action, you manifest one of your psychic blades, expend one Psionic Energy die and roll it, and throw the blade at an unoccupied space you can see, up to a number of feet away equal to 10 times the number rolled. You then teleport to that space, and the blade vanishes)."}],
          "13": [{"name": "Psychic Veil", "description": "You can weave a veil of psychic static to mask yourself. As an action, you can magically become invisible, along with anything you are wearing or carrying, for 1 hour or until you dismiss this effect (no action required). This invisibility ends early immediately after you deal damage to a creature or you force a creature to make a saving throw."}],
          "17": [{"name": "Rend Mind", "description": "You can sweep your Psychic Blades directly through a creature's mind. When you use your Psychic Blades to deal Sneak Attack damage to a creature, you can force that target to make a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Dexterity modifier). If the save fails, the target is stunned for 1 minute. The stunned target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."}]
        }
      },
      {
        "name": "Magic Stealer",
        "description": "Rogues who specialize in stealing and disrupting magical power, turning their enemies' spells against them",
        "source": "Unearthed Arcana",
        "featuresByLevel": {
          "3": [{"name": "Arcane Larceny", "description": "You have learned the art of stealing magical energy. When a creature within 30 feet of you casts a spell, you can use your reaction to attempt to siphon some of its power. Make a Dexterity (Sleight of Hand) check contested by the caster's spellcasting ability check. On a success, you gain a number of stolen spell points equal to the level of the spell cast (cantrips count as 0). You can store a maximum number of stolen spell points equal to your proficiency bonus."}, {"name": "Spell Sense", "description": "You can sense the presence of magic within 30 feet of you. You know if there are any spells or magical effects in this area, and their general direction, but not their exact nature or location."}],
          "9": [{"name": "Disruptive Strike", "description": "When you deal Sneak Attack damage to a creature that is concentrating on a spell, the creature has disadvantage on the Constitution saving throw to maintain concentration. Additionally, you can expend stolen spell points to deal extra force damage equal to 1d6 per point spent (maximum of 5d6)."}],
          "13": [{"name": "Spell Redirect", "description": "When you successfully use your Arcane Larceny feature, you can choose to redirect the spell instead of stealing its energy. The spell targets a creature of your choice within its normal range, using the original caster's spell save DC and spell attack bonus. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."}],
          "17": [{"name": "Master Thief of Magic", "description": "Your ability to steal magic reaches its peak. You can now store a maximum of stolen spell points equal to twice your proficiency bonus. When you use your Arcane Larceny feature, you automatically succeed on the contest if the spell is 3rd level or lower. Additionally, as an action, you can expend 5 stolen spell points to cast Counterspell or Dispel Magic without expending a spell slot."}]
        }
      },
      {
        "name": "Slider",
        "description": "Rogues known as Sliders have mastered the art of dimensional manipulation, slipping through the spaces between reality to strike from unexpected angles",
        "source": "Hoard of Heroes",
        "featuresByLevel": {
          "3": [{"name": "Phase Step", "description": "You can slip through the fabric of reality. As a bonus action, you can teleport up to 15 feet to an unoccupied space you can see. After teleporting, you have advantage on the next attack roll you make before the end of your turn. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a short or long rest."}, {"name": "Dimensional Sense", "description": "You can sense disturbances in the fabric of reality. You can detect any teleportation, conjuration magic, or planar portals within 60 feet of you. You also have advantage on saving throws against being banished or teleported against your will."}],
          "9": [{"name": "Slip Strike", "description": "When you deal Sneak Attack damage to a creature, you can choose to partially phase through it. The target must make a Constitution saving throw (DC = 8 + your proficiency bonus + your Dexterity modifier). On a failed save, the creature is disoriented and has disadvantage on attack rolls until the end of its next turn."}],
          "13": [{"name": "Phase Walk", "description": "Your connection to dimensional spaces deepens. You can move through other creatures and objects as if they were difficult terrain. You take 1d10 force damage if you end your turn inside an object. Additionally, your Phase Step range increases to 30 feet."}],
          "17": [{"name": "Dimensional Ambush", "description": "You can strike from impossible angles. When you use your Phase Step feature, you can teleport up to 60 feet and can teleport to a space you cannot see, as long as you've seen it within the last minute. Additionally, attacks you make immediately after using Phase Step are critical hits on a roll of 18-20."}]
        }
      }
    ]
  },
  "sorcerer": {
    "name": "Sorcerer",
    "description": "A spellcaster who draws on inherent magic from a gift or bloodline",
    "hitDie": 6,
    "primaryAbility": ["cha"],
    "dumpStat": "str",
    "savingThrows": ["con", "cha"],
    "skillChoices": 2,
    "skillOptions": ["arcana", "deception", "insight", "intimidation", "persuasion", "religion"],
    "armorProficiencies": [],
    "weaponProficiencies": ["daggers", "darts", "slings", "quarterstaffs", "light crossbows"],
    "startingEquipment": {
      "choices": [
        {
          "choose": 1,
          "from": [
            "Light Crossbow and 20 Bolts",
            "Any Simple Weapon"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Component Pouch",
            "Arcane Focus"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Dungeoneer's Pack",
            "Explorer's Pack"
          ]
        }
      ],
      "given": ["Two Daggers"]
    },
    "startingGold": {
      "dice": "3d4",
      "multiplier": 10,
      "average": 75
    },
    "spellcasting": {
      "ability": "cha",
      "spellsKnown": "Limited known",
      "cantripsKnown": [4, 4, 4, 5, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6],
      "spellsKnownByLevel": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 12, 13, 13, 14, 14, 15, 15, 15, 15]
    },
    "features": [
      "Spellcasting - You can cast sorcerer spells using Charisma as your spellcasting ability",
      "Sorcerous Origin - Choose an origin for your innate magic",
      "Font of Magic - You can tap into your inner wellspring of magic to create spell slots"
    ],
    "subclasses": [
      {
        "name": "Draconic Bloodline",
        "description": "Magic flowing from a draconic ancestor",
        "dragonTypes": ["Black (Acid)", "Blue (Lightning)", "Brass (Fire)", "Bronze (Lightning)", "Copper (Acid)", "Gold (Fire)", "Green (Poison)", "Red (Fire)", "Silver (Cold)", "White (Cold)"],
        "featuresByLevel": {
          "1": [{"name": "Dragon Ancestor", "description": "You choose one type of dragon as your ancestor. The damage type associated with each dragon is used by features you gain later. You can speak, read, and write Draconic. Additionally, whenever you make a Charisma check when interacting with dragons, your proficiency bonus is doubled if it applies to the check."}, {"name": "Draconic Resilience", "description": "As magic flows through your body, it causes physical traits of your dragon ancestors to emerge. Your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class. Additionally, parts of your skin are covered by a thin sheen of dragon-like scales. When you aren't wearing armor, your AC equals 13 + your Dexterity modifier."}],
          "6": [{"name": "Elemental Affinity", "description": "When you cast a spell that deals damage of the type associated with your draconic ancestry, you can add your Charisma modifier to one damage roll of that spell. At the same time, you can spend 1 sorcery point to gain resistance to that damage type for 1 hour."}],
          "14": [{"name": "Dragon Wings", "description": "You gain the ability to sprout a pair of dragon wings from your back, gaining a flying speed equal to your current speed. You can create these wings as a bonus action on your turn. They last until you dismiss them as a bonus action on your turn. You can't manifest your wings while wearing armor unless the armor is made to accommodate them, and clothing not made to accommodate your wings might be destroyed when you manifest them."}],
          "18": [{"name": "Draconic Presence", "description": "You can channel the dread presence of your dragon ancestor, causing those around you to become awestruck or frightened. As an action, you can spend 5 sorcery points to draw on this power and exude an aura of awe or fear (your choice) to a distance of 60 feet. For 1 minute or until you lose your concentration (as if you were casting a concentration spell), each hostile creature that starts its turn in this aura must succeed on a Wisdom saving throw or be charmed (if you chose awe) or frightened (if you chose fear) until the aura ends."}]
        }
      },
      {
        "name": "Wild Magic",
        "description": "Chaotic magic that can surge unexpectedly",
        "featuresByLevel": {
          "1": [{"name": "Wild Magic Surge", "description": "Your spellcasting can unleash surges of untamed magic. Once per turn, the DM can have you roll a d20 immediately after you cast a sorcerer spell of 1st level or higher. If you roll a 1, roll on the Wild Magic Surge table to create a magical effect. If that effect is a spell, it is too wild to be affected by your Metamagic, and if it normally requires concentration, it doesn't require concentration in this case; the spell lasts for its full duration."}, {"name": "Tides of Chaos", "description": "You can manipulate the forces of chance and chaos to gain advantage on one attack roll, ability check, or saving throw. Once you do so, you must finish a long rest before you can use this feature again. Any time before you regain the use of this feature, the DM can have you roll on the Wild Magic Surge table immediately after you cast a sorcerer spell of 1st level or higher. You then regain the use of this feature."}],
          "6": [{"name": "Bend Luck", "description": "You have the ability to twist fate using your wild magic. When another creature you can see makes an attack roll, an ability check, or a saving throw, you can use your reaction and spend 2 sorcery points to roll 1d4 and apply the number rolled as a bonus or penalty (your choice) to the creature's roll. You can do so after the creature rolls but before any effects of the roll occur."}],
          "14": [{"name": "Controlled Chaos", "description": "You gain a modicum of control over the surges of your wild magic. Whenever you roll on the Wild Magic Surge table, you can roll twice and use either number."}],
          "18": [{"name": "Spell Bombardment", "description": "The harmful energy of your spells intensifies. When you roll damage for a spell and roll the highest number possible on any of the dice, choose one of those dice, roll it again and add that roll to the damage. You can use the feature only once per turn."}]
        }
      },
      {
        "name": "Divine Soul",
        "description": "Blessed with divine magic from a celestial source",
        "bonusSpells": ["Access to Cleric spell list"],
        "featuresByLevel": {
          "1": [{"name": "Divine Magic", "description": "Your link to the divine allows you to learn spells from the cleric class. When your Spellcasting feature lets you learn or replace a sorcerer cantrip or a sorcerer spell of 1st level or higher, you can choose the new spell from the cleric spell list or the sorcerer spell list. You must otherwise obey all the restrictions for selecting the spell, and it becomes a sorcerer spell for you. In addition, choose an affinity for the source of your divine power and learn an associated spell (Good: Cure Wounds, Evil: Inflict Wounds, Law: Bless, Chaos: Bane, Neutrality: Protection from Evil and Good)."}, {"name": "Favored by the Gods", "description": "Divine power guards your destiny. If you fail a saving throw or miss with an attack roll, you can roll 2d4 and add it to the total, possibly changing the outcome. Once you use this feature, you can't use it again until you finish a short or long rest."}],
          "6": [{"name": "Empowered Healing", "description": "The divine energy coursing through you can empower healing spells. Whenever you or an ally within 5 feet of you rolls dice to determine the number of hit points a spell restores, you can spend 1 sorcery point to reroll any number of those dice once, provided you aren't incapacitated. You can use this feature only once per turn."}],
          "14": [{"name": "Otherworldly Wings", "description": "You can use a bonus action to manifest a pair of spectral wings from your back. While the wings are present, you have a flying speed of 30 feet. The wings last until you're incapacitated, you die, or you dismiss them as a bonus action. The affinity you chose for your Divine Magic feature determines the appearance of the spectral wings: eagle wings for good or law, bat wings for evil or chaos, or dragonfly wings for neutrality."}],
          "18": [{"name": "Unearthly Recovery", "description": "You gain the ability to overcome grievous injuries. As a bonus action when you have fewer than half of your hit points remaining, you can regain a number of hit points equal to half your hit point maximum. Once you use this feature, you can't use it again until you finish a long rest."}]
        }
      },
      {
        "name": "Shadow Magic",
        "description": "Power drawn from the Shadowfell",
        "featuresByLevel": {
          "1": [{"name": "Eyes of the Dark", "description": "You have darkvision with a range of 120 feet. When you reach 3rd level in this class, you learn the Darkness spell, which doesn't count against your number of sorcerer spells known. In addition, you can cast it by spending 2 sorcery points or by expending a spell slot. If you cast it with sorcery points, you can see through the darkness created by the spell."}, {"name": "Strength of the Grave", "description": "Your existence in a twilight state between life and death makes you difficult to defeat. When damage reduces you to 0 hit points, you can make a Charisma saving throw (DC 5 + the damage taken). On a success, you instead drop to 1 hit point. You can't use this feature if you are reduced to 0 hit points by radiant damage or by a critical hit."}],
          "6": [{"name": "Hound of Ill Omen", "description": "You gain the ability to call forth a howling creature of darkness to harass your foes. As a bonus action, you can spend 3 sorcery points to magically summon a hound of ill omen to target one creature you can see within 120 feet of you. The hound uses the dire wolf statistics, with some changes. It appears in an unoccupied space of your choice within 30 feet of the target. The hound can move through other creatures and objects as if they were difficult terrain. At the start of its turn, the hound automatically knows its target's location. While the hound is within 5 feet of the target, the target has disadvantage on saving throws against any spell you cast."}],
          "14": [{"name": "Shadow Walk", "description": "You gain the ability to step from one shadow into another. When you are in dim light or darkness, as a bonus action, you can magically teleport up to 120 feet to an unoccupied space you can see that is also in dim light or darkness."}],
          "18": [{"name": "Umbral Form", "description": "You can spend 6 sorcery points as a bonus action to magically transform yourself into a shadowy form. In this form, you have resistance to all damage except force and radiant damage, and you can move through other creatures and objects as if they were difficult terrain. You take 5 force damage if you end your turn inside an object. You remain in this form for 1 minute. It ends early if you are incapacitated, if you die, or if you dismiss it as a bonus action."}]
        }
      },
      {
        "name": "Storm Sorcery",
        "description": "Power infused with elemental air",
        "featuresByLevel": {
          "1": [{"name": "Wind Speaker", "description": "The arcane magic you command is infused with elemental air. You can speak, read, and write Primordial. Knowing this language allows you to understand and be understood by those who speak its dialects: Aquan, Auran, Ignan, and Terran."}, {"name": "Tempestuous Magic", "description": "You can use a bonus action on your turn to cause whirling gusts of elemental air to briefly surround you, immediately before or after you cast a spell of 1st level or higher. Doing so allows you to fly up to 10 feet without provoking opportunity attacks."}],
          "6": [{"name": "Heart of the Storm", "description": "You gain resistance to lightning and thunder damage. In addition, whenever you start casting a spell of 1st level or higher that deals lightning or thunder damage, stormy magic erupts from you. This eruption causes creatures of your choice that you can see within 10 feet of you to take lightning or thunder damage (choose each time this ability activates) equal to half your sorcerer level."}, {"name": "Storm Guide", "description": "You gain the ability to subtly control the weather around you. If it is raining, you can use an action to cause the rain to stop falling in a 20-foot-radius sphere centered on you. You can end this effect as a bonus action. If it is windy, you can use a bonus action each round to choose the direction that the wind blows in a 100-foot-radius sphere centered on you."}],
          "14": [{"name": "Storm's Fury", "description": "When you are hit by a melee attack, you can use your reaction to deal lightning damage to the attacker. The damage equals your sorcerer level. The attacker must also make a Strength saving throw against your sorcerer spell save DC. On a failed save, the attacker is pushed in a straight line up to 20 feet away from you."}],
          "18": [{"name": "Wind Soul", "description": "You gain immunity to lightning and thunder damage. You also gain a magical flying speed of 60 feet. As an action, you can reduce your flying speed to 30 feet for 1 hour and choose a number of creatures within 30 feet of you equal to 3 + your Charisma modifier. The chosen creatures gain a magical flying speed of 30 feet for 1 hour."}]
        }
      },
      {
        "name": "Aberrant Mind",
        "description": "Touched by alien psionic power",
        "psionicSpells": {
          "1": ["Arms of Hadar", "Dissonant Whispers", "Mind Sliver (cantrip)"],
          "3": ["Calm Emotions", "Detect Thoughts"],
          "5": ["Hunger of Hadar", "Sending"],
          "7": ["Evard's Black Tentacles", "Summon Aberration"],
          "9": ["Rary's Telepathic Bond", "Telekinesis"]
        },
        "featuresByLevel": {
          "1": [{"name": "Psionic Spells", "description": "You learn additional spells when you reach certain levels in this class. You can replace one psionic spell with a divination or enchantment spell from the sorcerer, warlock, or wizard spell list."}, {"name": "Telepathic Speech", "description": "You can form a telepathic connection between your mind and the mind of another. As a bonus action, choose one creature you can see within 30 feet of you. You and the chosen creature can speak telepathically with each other while the two of you are within a number of miles of each other equal to your Charisma modifier (minimum of 1 mile). The telepathic connection lasts for a number of minutes equal to your sorcerer level."}],
          "6": [{"name": "Psionic Sorcery", "description": "When you cast any spell of 1st level or higher from your Psionic Spells feature, you can cast it by expending a spell slot as normal or by spending a number of sorcery points equal to the spell's level. If you cast the spell using sorcery points, it requires no verbal or somatic components, and it requires no material components, unless they are consumed by the spell."}, {"name": "Psychic Defenses", "description": "You gain resistance to psychic damage, and you have advantage on saving throws against being charmed or frightened."}],
          "14": [{"name": "Revelation in Flesh", "description": "You can unleash the aberrant truth hidden within yourself. As a bonus action, you can spend 1 or more sorcery points to magically transform your body for 10 minutes. For each sorcery point you spend, you can gain one of the following benefits: see invisible creatures within 60 feet, gain a flying speed equal to your walking speed and can hover, gain a swimming speed equal to twice your walking speed and can breathe underwater, or become slimy and pliable so you can squeeze through spaces as narrow as 1 inch without squeezing."}],
          "18": [{"name": "Warping Implosion", "description": "You can unleash your aberrant power as a space-warping anomaly. As an action, you can teleport to an unoccupied space you can see within 120 feet of you. Immediately after you disappear, each creature within 30 feet of the space you left must make a Strength saving throw. On a failed save, a creature takes 3d10 force damage and is pulled straight toward the space you left, ending in an unoccupied space as close to your former space as possible. On a successful save, the creature takes half as much damage and isn't pulled."}]
        }
      },
      {
        "name": "Clockwork Soul",
        "description": "Connected to the plane of absolute order",
        "clockworkSpells": {
          "1": ["Alarm", "Protection from Evil and Good"],
          "3": ["Aid", "Lesser Restoration"],
          "5": ["Dispel Magic", "Protection from Energy"],
          "7": ["Freedom of Movement", "Summon Construct"],
          "9": ["Greater Restoration", "Wall of Force"]
        },
        "featuresByLevel": {
          "1": [{"name": "Clockwork Magic", "description": "You learn additional spells when you reach certain levels in this class. You can replace one clockwork spell with an abjuration or transmutation spell from the sorcerer, warlock, or wizard spell list."}, {"name": "Restore Balance", "description": "Your connection to the plane of absolute order allows you to equalize chaotic moments. When a creature you can see within 60 feet of you is about to roll a d20 with advantage or disadvantage, you can use your reaction to prevent the roll from being affected by advantage and disadvantage. You can use this feature a number of times equal to your proficiency bonus."}],
          "6": [{"name": "Bastion of Law", "description": "You can tap into the grand equation of existence to imbue a creature with a shimmering shield of order. As an action, you can expend 1 to 5 sorcery points to create a magical ward around yourself or another creature you can see within 30 feet of you. The ward lasts until you finish a long rest or until you use this feature again. The ward is represented by a number of d8s equal to the number of sorcery points spent to create it. When the warded creature takes damage, it can expend a number of those dice, roll them, and reduce the damage taken by the total rolled on those dice."}],
          "14": [{"name": "Trance of Order", "description": "You gain the ability to align your consciousness to the endless calculations of Mechanus. As a bonus action, you can enter this state for 1 minute. For the duration, attack rolls against you can't benefit from advantage, and whenever you make an attack roll, an ability check, or a saving throw, you can treat a roll of 9 or lower on the d20 as a 10."}],
          "18": [{"name": "Clockwork Cavalcade", "description": "You summon spirits of order to expunge disorder around you. As an action, you summon the spirits in a 30-foot cube originating from you. The spirits look like constructs of your choice. The spirits are intangible and invulnerable, and they create the following effects within the cube before vanishing: the spirits restore up to 100 hit points, divided as you choose among any number of creatures of your choice in the cube; any damaged objects entirely in the cube are repaired instantly; every spell of 6th level or lower ends on creatures and objects of your choice in the cube."}]
        }
      },
      {
        "name": "Planar Magic",
        "description": "Your innate magic stems from exposure to the raw stuff of the multiverse, granting you the ability to channel the essence of different planes",
        "source": "Hoard of Heroes",
        "planarSpells": {
          "1": ["Detect Evil and Good", "Protection from Evil and Good"],
          "3": ["Arcane Lock", "Misty Step"],
          "5": ["Blink", "Protection from Energy"],
          "7": ["Banishment", "Dimension Door"],
          "9": ["Contact Other Plane", "Planar Binding"]
        },
        "featuresByLevel": {
          "1": [{"name": "Planar Attunement", "description": "You can sense planar boundaries and portals. You know when you are within 60 feet of a planar portal or when a creature near you is from another plane. You learn the Detect Evil and Good spell, which doesn't count against your number of sorcerer spells known."}, {"name": "Elemental Infusion", "description": "You can channel planar energy through your spells. When you cast a spell that deals damage, you can change its damage type to one of the following: acid (Gehenna), cold (Carceri), fire (Nine Hells), lightning (Limbo), necrotic (Shadowfell), psychic (Far Realm), radiant (Upper Planes), or thunder (Elemental Planes)."}],
          "6": [{"name": "Planar Step", "description": "You can slip between planes. As a bonus action, you can spend 2 sorcery points to teleport up to 30 feet to an unoccupied space you can see. When you do so, you briefly pass through the Border Ethereal. You can bring one willing creature within 5 feet of you when you teleport this way."}],
          "14": [{"name": "Planar Resilience", "description": "Your connection to the planes shields you. You have resistance to two damage types of your choice from your Elemental Infusion options. Additionally, you can't be banished or teleported against your will unless you choose to be."}],
          "18": [{"name": "Planar Conduit", "description": "You can become a living conduit to another plane. As an action, you can spend 5 sorcery points to transform for 1 minute. While transformed, you gain a flying speed of 60 feet and can hover. You have immunity to one damage type of your choice from your Elemental Infusion options, and your spells ignore resistance to that damage type. Additionally, you can cast Plane Shift once during this transformation without expending a spell slot or material components."}]
        }
      }
    ]
  },
  "warlock": {
    "name": "Warlock",
    "description": "A wielder of magic that is derived from a bargain with an extraplanar entity",
    "hitDie": 8,
    "primaryAbility": ["cha"],
    "dumpStat": "str",
    "savingThrows": ["wis", "cha"],
    "skillChoices": 2,
    "skillOptions": ["arcana", "deception", "history", "intimidation", "investigation", "nature", "religion"],
    "armorProficiencies": ["light"],
    "weaponProficiencies": ["simple"],
    "startingEquipment": {
      "choices": [
        {
          "choose": 1,
          "from": [
            "Light Crossbow and 20 Bolts",
            "Any Simple Weapon"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Component Pouch",
            "Arcane Focus"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Scholar's Pack",
            "Dungeoneer's Pack"
          ]
        }
      ],
      "given": ["Leather Armor", "Any Simple Weapon", "Two Daggers"]
    },
    "startingGold": {
      "dice": "4d4",
      "multiplier": 10,
      "average": 100
    },
    "spellcasting": {
      "ability": "cha",
      "spellsKnown": "Limited known",
      "cantripsKnown": [2, 2, 2, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4],
      "spellsKnownByLevel": [2, 3, 4, 5, 6, 7, 8, 9, 10, 10, 11, 11, 12, 12, 13, 13, 14, 14, 15, 15]
    },
    "features": [
      "Otherworldly Patron - You have struck a bargain with an otherworldly being",
      "Pact Magic - Your arcane research and patron have given you facility with spells",
      "Eldritch Invocations - Gain supernatural abilities granted by your patron"
    ],
    "subclasses": [
      {
        "name": "The Fiend",
        "description": "Patron from the lower planes of existence",
        "expandedSpells": {
          "1": ["Burning Hands", "Command"],
          "2": ["Blindness/Deafness", "Scorching Ray"],
          "3": ["Fireball", "Stinking Cloud"],
          "4": ["Fire Shield", "Wall of Fire"],
          "5": ["Flame Strike", "Hallow"]
        },
        "featuresByLevel": {
          "1": [{"name": "Dark One's Blessing", "description": "When you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma modifier + your warlock level (minimum of 1)."}],
          "6": [{"name": "Dark One's Own Luck", "description": "You can call on your patron to alter fate in your favor. When you make an ability check or a saving throw, you can use this feature to add a d10 to your roll. You can do so after seeing the initial roll but before any of the roll's effects occur. Once you use this feature, you can't use it again until you finish a short or long rest."}],
          "10": [{"name": "Fiendish Resilience", "description": "You can choose one damage type when you finish a short or long rest. You gain resistance to that damage type until you choose a different one with this feature. Damage from magical weapons or silver weapons ignores this resistance."}],
          "14": [{"name": "Hurl Through Hell", "description": "When you hit a creature with an attack, you can use this feature to instantly transport the target through the lower planes. The creature disappears and hurtles through a nightmare landscape. At the end of your next turn, the target returns to the space it previously occupied, or the nearest unoccupied space. If the target is not a fiend, it takes 10d10 psychic damage as it reels from its horrific experience. Once you use this feature, you can't use it again until you finish a long rest."}]
        }
      },
      {
        "name": "The Archfey",
        "description": "Patron is a lord or lady of the fey",
        "expandedSpells": {
          "1": ["Faerie Fire", "Sleep"],
          "2": ["Calm Emotions", "Phantasmal Force"],
          "3": ["Blink", "Plant Growth"],
          "4": ["Dominate Beast", "Greater Invisibility"],
          "5": ["Dominate Person", "Seeming"]
        },
        "featuresByLevel": {
          "1": [{"name": "Fey Presence", "description": "As an action, you can cause each creature in a 10-foot cube originating from you to make a Wisdom saving throw against your warlock spell save DC. The creatures that fail their saving throws are all charmed or frightened by you (your choice) until the end of your next turn. Once you use this feature, you can't use it again until you finish a short or long rest."}],
          "6": [{"name": "Misty Escape", "description": "When you take damage, you can use your reaction to turn invisible and teleport up to 60 feet to an unoccupied space you can see. You remain invisible until the start of your next turn or until you attack or cast a spell. Once you use this feature, you can't use it again until you finish a short or long rest."}],
          "10": [{"name": "Beguiling Defenses", "description": "You are immune to being charmed, and when another creature attempts to charm you, you can use your reaction to attempt to turn the charm back on that creature. The creature must succeed on a Wisdom saving throw against your warlock spell save DC or be charmed by you for 1 minute or until the creature takes any damage."}],
          "14": [{"name": "Dark Delirium", "description": "As an action, you can choose a creature you can see within 60 feet. It must make a Wisdom saving throw against your warlock spell save DC. On a failed save, it is charmed or frightened by you (your choice) for 1 minute or until your concentration is broken. The target perceives itself in an illusory realm of your creation while in this state. Once you use this feature, you can't use it again until you finish a short or long rest."}]
        }
      },
      {
        "name": "The Great Old One",
        "description": "Patron is an ancient, inscrutable entity",
        "expandedSpells": {
          "1": ["Dissonant Whispers", "Tasha's Hideous Laughter"],
          "2": ["Detect Thoughts", "Phantasmal Force"],
          "3": ["Clairvoyance", "Sending"],
          "4": ["Dominate Beast", "Evard's Black Tentacles"],
          "5": ["Dominate Person", "Telekinesis"]
        },
        "featuresByLevel": {
          "1": [{"name": "Awakened Mind", "description": "You can telepathically speak to any creature you can see within 30 feet of you. You don't need to share a language with the creature for it to understand your telepathic utterances, but the creature must be able to understand at least one language."}],
          "6": [{"name": "Entropic Ward", "description": "When a creature makes an attack roll against you, you can use your reaction to impose disadvantage on that roll. If the attack misses you, your next attack roll against the creature has advantage if you make it before the end of your next turn. Once you use this feature, you can't use it again until you finish a short or long rest."}],
          "10": [{"name": "Thought Shield", "description": "Your thoughts can't be read by telepathy or other means unless you allow it. You also have resistance to psychic damage, and whenever a creature deals psychic damage to you, that creature takes the same amount of damage that you do."}],
          "14": [{"name": "Create Thrall", "description": "You can use your action to touch an incapacitated humanoid. That creature is then charmed by you until a Remove Curse spell is cast on it, the charmed condition is removed from it, or you use this feature again. You can communicate telepathically with the charmed creature as long as the two of you are on the same plane of existence."}]
        }
      },
      {
        "name": "The Celestial",
        "description": "Patron is a powerful being from the Upper Planes",
        "expandedSpells": {
          "1": ["Cure Wounds", "Guiding Bolt"],
          "2": ["Flaming Sphere", "Lesser Restoration"],
          "3": ["Daylight", "Revivify"],
          "4": ["Guardian of Faith", "Wall of Fire"],
          "5": ["Flame Strike", "Greater Restoration"]
        },
        "bonusCantrips": ["Light", "Sacred Flame"],
        "featuresByLevel": {
          "1": [{"name": "Bonus Cantrips", "description": "You learn the Light and Sacred Flame cantrips. They count as warlock cantrips for you, but they don't count against your number of cantrips known."}, {"name": "Healing Light", "description": "You gain the ability to channel celestial energy to heal wounds. You have a pool of d6s that you spend to fuel this healing. The number of dice in the pool equals 1 + your warlock level. As a bonus action, you can heal one creature you can see within 60 feet of you, spending dice from the pool. The maximum number of dice you can spend at once equals your Charisma modifier (minimum of one die). Roll the dice you spend, add them together, and restore a number of hit points equal to the total. Your pool regains all expended dice when you finish a long rest."}],
          "6": [{"name": "Radiant Soul", "description": "You have resistance to radiant damage, and when you cast a spell that deals radiant or fire damage, you can add your Charisma modifier to one radiant or fire damage roll of that spell against one of its targets."}],
          "10": [{"name": "Celestial Resilience", "description": "You gain temporary hit points whenever you finish a short or long rest. These temporary hit points equal your warlock level + your Charisma modifier. Additionally, choose up to five creatures you can see at the end of the rest. Those creatures each gain temporary hit points equal to half your warlock level + your Charisma modifier."}],
          "14": [{"name": "Searing Vengeance", "description": "When you have to make a death saving throw at the start of your turn, you can instead spring back to your feet with a burst of radiant energy. You regain hit points equal to half your hit point maximum, and then you stand up if you so choose. Each creature of your choice within 30 feet of you takes radiant damage equal to 2d8 + your Charisma modifier, and is blinded until the end of the current turn. Once you use this feature, you can't use it again until you finish a long rest."}]
        }
      },
      {
        "name": "The Hexblade",
        "description": "Bound to a sentient weapon from the Shadowfell",
        "expandedSpells": {
          "1": ["Shield", "Wrathful Smite"],
          "2": ["Blur", "Branding Smite"],
          "3": ["Blink", "Elemental Weapon"],
          "4": ["Phantasmal Killer", "Staggering Smite"],
          "5": ["Banishing Smite", "Cone of Cold"]
        },
        "bonusProficiencies": ["Medium Armor", "Shields", "Martial Weapons"],
        "featuresByLevel": {
          "1": [{"name": "Hexblade's Curse", "description": "As a bonus action, choose one creature you can see within 30 feet. The target is cursed for 1 minute. The curse ends early if the target dies, you die, or you are incapacitated. Until the curse ends, you gain bonus to damage rolls against the cursed target equal to your proficiency bonus, any attack roll you make against the cursed target is a critical hit on a roll of 19 or 20, and if the cursed target dies, you regain hit points equal to your warlock level + your Charisma modifier. You can't use this feature again until you finish a short or long rest."}, {"name": "Hex Warrior", "description": "You gain proficiency with medium armor, shields, and martial weapons. When you attack with a weapon you're proficient with, you can use your Charisma modifier instead of Strength or Dexterity for the attack and damage rolls."}],
          "6": [{"name": "Accursed Specter", "description": "When you slay a humanoid, you can cause its spirit to rise from its corpse as a specter. The specter gains temporary hit points equal to half your warlock level. Roll initiative for the specter, which has its own turns. It obeys your verbal commands, and it gains a special bonus to its attack rolls equal to your Charisma modifier. The specter remains in your service until the end of your next long rest, at which point it vanishes."}],
          "10": [{"name": "Armor of Hexes", "description": "If the target cursed by your Hexblade's Curse hits you with an attack roll, you can use your reaction to roll a d6. On a 4 or higher, the attack instead misses you, regardless of its roll."}],
          "14": [{"name": "Master of Hexes", "description": "You can spread your Hexblade's Curse from a slain creature to another creature. When the creature cursed by your Hexblade's Curse dies, you can apply the curse to a different creature you can see within 30 feet of you, provided you aren't incapacitated. When you apply the curse in this way, you don't regain hit points from the death of the previously cursed creature."}]
        }
      },
      {
        "name": "The Fathomless",
        "description": "Patron from the elemental plane of water or deep seas",
        "expandedSpells": {
          "1": ["Create or Destroy Water", "Thunderwave"],
          "2": ["Gust of Wind", "Silence"],
          "3": ["Lightning Bolt", "Sleet Storm"],
          "4": ["Control Water", "Evard's Black Tentacles"],
          "5": ["Bigby's Hand", "Cone of Cold"]
        },
        "featuresByLevel": {
          "1": [{"name": "Tentacle of the Deeps", "description": "You can magically summon a spectral tentacle that strikes at your foes. As a bonus action, you create a 10-foot-long tentacle at a point you can see within 60 feet. It lasts for 1 minute or until you use this feature to create another tentacle. When you create the tentacle, you can make a melee spell attack against one creature within 10 feet of it. On a hit, the target takes 1d8 cold damage, and its speed is reduced by 10 feet until the start of your next turn. You can use this feature a number of times equal to your proficiency bonus."}, {"name": "Gift of the Sea", "description": "You gain a swimming speed of 40 feet, and you can breathe underwater."}],
          "6": [{"name": "Oceanic Soul", "description": "You gain resistance to cold damage. In addition, when you are fully submerged, any creature that is also fully submerged can understand your speech, and you can understand theirs."}],
          "6.1": [{"name": "Guardian Coil", "description": "When you or a creature you can see takes damage while within 10 feet of the tentacle, you can use your reaction to choose one of those creatures and reduce the damage to that creature by 1d8. When you reach 10th level in this class, the damage reduced by the tentacle increases to 2d8."}],
          "10": [{"name": "Grasping Tentacles", "description": "You learn the spell Evard's Black Tentacles. It counts as a warlock spell for you, but it doesn't count against your number of spells known. You can also cast it once without using a spell slot, and you regain the ability to do so when you finish a long rest. Whenever you cast this spell, your patron's magic bolsters you, granting you a number of temporary hit points equal to your warlock level. Moreover, damage can't break your concentration on this spell."}],
          "14": [{"name": "Fathomless Plunge", "description": "As an action, you can magically teleport yourself and up to five other willing creatures that you can see within 30 feet of you. Amid a whirl of tentacles, you all vanish and then reappear up to 1 mile away in a body of water you've seen (pond size or larger) or within 30 feet of it. Once you use this feature, you can't use it again until you finish a short or long rest."}]
        }
      },
      {
        "name": "The Genie",
        "description": "Bound to a noble genie from the Elemental Planes",
        "genieTypes": ["Dao (Earth)", "Djinni (Air)", "Efreeti (Fire)", "Marid (Water)"],
        "expandedSpells": {
          "1": ["Detect Evil and Good", "Varies by Genie Type"],
          "2": ["Phantasmal Force", "Varies by Genie Type"],
          "3": ["Create Food and Water", "Varies by Genie Type"],
          "4": ["Phantasmal Killer", "Varies by Genie Type"],
          "5": ["Creation", "Wish (9th level)"]
        },
        "featuresByLevel": {
          "1": [{"name": "Genie's Vessel", "description": "Your patron gifts you a magical vessel that grants you a measure of the genie's power. The vessel is a Tiny object, and you can use it as a spellcasting focus. You can enter the vessel and remain inside as an extradimensional space. You can remain inside for a number of hours equal to twice your proficiency bonus. While inside, you can hear the area around your vessel. As a bonus action, you can eject yourself from the vessel."}, {"name": "Genie's Wrath", "description": "Once during each of your turns when you hit with an attack roll, you can deal extra damage equal to your proficiency bonus. The type of damage is determined by your patron: bludgeoning (dao), thunder (djinni), fire (efreeti), or cold (marid)."}],
          "6": [{"name": "Elemental Gift", "description": "You gain resistance to a damage type determined by your patron's kind: bludgeoning (dao), thunder (djinni), fire (efreeti), or cold (marid). In addition, as a bonus action, you can give yourself a flying speed of 30 feet that lasts for 10 minutes. You can use this bonus action a number of times equal to your proficiency bonus."}],
          "10": [{"name": "Sanctuary Vessel", "description": "When you enter your Genie's Vessel, you can now choose up to five willing creatures that you can see within 30 feet to enter the vessel with you. As a bonus action, you can eject any number of creatures from the vessel. Anyone who remains inside when you leave exits the vessel and appears in the unoccupied spaces closest to the vessel's exterior. In addition, when you and your allies spend at least 10 minutes inside, you can take a short rest. A creature can benefit from this short rest only once in 24 hours."}],
          "14": [{"name": "Limited Wish", "description": "You entreat your patron to grant you a small wish. As an action, you can speak your desire to your Genie's Vessel, requesting the effect of one spell that is 6th level or lower and has a casting time of 1 action. The spell can be from any class's spell list, and you don't need to meet the requirements in that spell, including costly components; the spell simply takes effect. Once you use this feature, you can't use it again until you finish 1d4 long rests."}]
        }
      },
      {
        "name": "The Undead",
        "description": "Patron is a powerful undead being",
        "expandedSpells": {
          "1": ["Bane", "False Life"],
          "2": ["Blindness/Deafness", "Phantasmal Force"],
          "3": ["Phantom Steed", "Speak with Dead"],
          "4": ["Death Ward", "Greater Invisibility"],
          "5": ["Antilife Shell", "Cloudkill"]
        },
        "featuresByLevel": {
          "1": [{"name": "Form of Dread", "description": "You manifest an aspect of your patron's dreadful power. As a bonus action, you transform for 1 minute. You gain temporary hit points equal to 1d10 + your warlock level. Once during each of your turns, when you hit a creature with an attack roll, you can force it to make a Wisdom saving throw, and if the saving throw fails, the target is frightened of you until the end of your next turn. You are immune to the frightened condition. You can transform a number of times equal to your proficiency bonus."}],
          "6": [{"name": "Grave Touched", "description": "You don't need to eat, drink, or breathe. In addition, once during each of your turns, when you hit a creature with an attack roll and deal necrotic damage to it, you can also roll one of the damage dice an additional time and add it to the damage."}],
          "10": [{"name": "Mortal Husk", "description": "Your connection to undeath and necrotic energy now saturates your body. You have resistance to necrotic damage. If you are reduced to 0 hit points, you can cause your body to explode. Each creature within 30 feet of you takes necrotic damage equal to 2d10 + your warlock level. You then revive with 1 hit point in your previous space. Once you use this ability, you can't use it again until you finish 1d4 long rests."}],
          "14": [{"name": "Spirit Projection", "description": "As an action, you can project your spirit from your body. The body you leave behind is unconscious and in a state of suspended animation. Your spirit can remain outside your body for up to 1 hour. Your spirit has your same abilities and statistics, you have resistance to bludgeoning, piercing, and slashing damage, and you can move through creatures and objects as if they were difficult terrain. While projecting your spirit, you can cast conjuration or necromancy spells that require no material components, and when you deal necrotic damage, you also heal an amount equal to half the necrotic damage dealt."}]
        }
      },
      {
        "name": "The Undying",
        "description": "Patron teaches secrets of eternal life",
        "expandedSpells": {
          "1": ["False Life", "Ray of Sickness"],
          "2": ["Blindness/Deafness", "Silence"],
          "3": ["Feign Death", "Speak with Dead"],
          "4": ["Aura of Life", "Death Ward"],
          "5": ["Contagion", "Legend Lore"]
        },
        "featuresByLevel": {
          "1": [{"name": "Among the Dead", "description": "You learn the Spare the Dying cantrip, which counts as a warlock cantrip for you. You also have advantage on saving throws against any disease. Additionally, undead have difficulty harming you. If an undead targets you directly with an attack or a harmful spell, that creature must make a Wisdom saving throw against your spell save DC. On a failed save, the creature must choose a new target or forfeit targeting someone instead of you."}],
          "6": [{"name": "Defy Death", "description": "You can give yourself vitality when you cheat death or when you help someone else cheat it. You can regain hit points equal to 1d8 + your Constitution modifier (minimum of 1 hit point) when you succeed on a death saving throw or when you stabilize a creature with Spare the Dying. Once you use this feature, you can't use it again until you finish a long rest."}],
          "10": [{"name": "Undying Nature", "description": "You can hold your breath indefinitely, and you don't require food, water, or sleep, although you still require rest to reduce exhaustion and still benefit from finishing short and long rests. In addition, you age at a slower rate. For every 10 years that pass, your body ages only 1 year, and you are immune to being magically aged."}],
          "14": [{"name": "Indestructible Life", "description": "You partake of some of the true secrets of the Undying. On your turn, you can use a bonus action to regain hit points equal to 1d8 + your warlock level. Additionally, if you put a severed body part of yours back in place when you use this feature, the part reattaches. Once you use this feature, you can't use it again until you finish a short or long rest."}]
        }
      },
      {
        "name": "The Vestige",
        "description": "Your patron is a vestige—a powerful entity that once existed but has been forgotten, destroyed, or erased from reality. These beings persist in the spaces between planes, granting power to those who remember them",
        "source": "Unearthed Arcana",
        "expandedSpells": {
          "1": ["Unseen Servant", "Dissonant Whispers"],
          "2": ["Invisibility", "Phantasmal Force"],
          "3": ["Speak with Dead", "Spirit Guardians"],
          "4": ["Greater Invisibility", "Phantasmal Killer"],
          "5": ["Contact Other Plane", "Legend Lore"]
        },
        "featuresByLevel": {
          "1": [{"name": "Vestige's Memory", "description": "You can tap into the fading memories of your vestige patron. When you make an Intelligence check to recall information, you can add your Charisma modifier to the roll. Additionally, you learn the Message cantrip, which doesn't count against your number of cantrips known."}, {"name": "Fading Form", "description": "As a bonus action, you can become partially incorporeal for 1 minute. While incorporeal, you have resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks, and you can move through other creatures and objects as if they were difficult terrain. You take 1d10 force damage if you end your turn inside an object. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."}],
          "6": [{"name": "Forgotten Presence", "description": "You can make yourself forgettable. As an action, you can force one creature you can see within 30 feet to make a Wisdom saving throw against your warlock spell save DC. On a failed save, the creature forgets you exist for 1 minute. The creature can't target you with attacks or harmful spells, and it doesn't remember any interactions with you from before you used this feature. The effect ends if you attack the creature or force it to make a saving throw. Once you use this feature, you can't use it again until you finish a short or long rest."}],
          "10": [{"name": "Echo of Power", "description": "When you cast a warlock spell of 1st level or higher, you can create an echo of the spell. At the start of your next turn, the echo recreates the spell's effect at the same location or targeting the same creature (if applicable), using the same spell level. The echo doesn't require concentration even if the original spell did. Once you use this feature, you can't use it again until you finish a long rest."}],
          "14": [{"name": "Become the Vestige", "description": "You can temporarily become one with your vestige patron. As an action, you transform for 1 minute. While transformed: you become invisible, you can move through solid objects and creatures, you have immunity to all damage except force and psychic, you can't cast spells or make attacks, but you can end the transformation early as a bonus action. When the transformation ends, each creature within 30 feet of you must make a Wisdom saving throw or be frightened of you for 1 minute. Once you use this feature, you can't use it again until you finish a long rest."}]
        }
      },
      {
        "name": "The Ancient Dragon",
        "description": "Your patron is an ancient dragon of immense power, one whose hoard of knowledge rivals its hoard of gold. These primordial wyrms grant their warlocks a fraction of their draconic might",
        "source": "Hoard of Heroes",
        "dragonTypes": ["Black (Acid)", "Blue (Lightning)", "Brass (Fire)", "Bronze (Lightning)", "Copper (Acid)", "Gold (Fire)", "Green (Poison)", "Red (Fire)", "Silver (Cold)", "White (Cold)"],
        "expandedSpells": {
          "1": ["Chromatic Orb", "Absorb Elements"],
          "2": ["Dragon's Breath", "Alter Self"],
          "3": ["Fear", "Protection from Energy"],
          "4": ["Elemental Bane", "Leomund's Secret Chest"],
          "5": ["Dominate Person", "Legend Lore"]
        },
        "featuresByLevel": {
          "1": [{"name": "Dragon's Tongue", "description": "You can speak, read, and write Draconic. Additionally, when you make a Charisma check to interact with dragons, your proficiency bonus is doubled if it applies to the check."}, {"name": "Draconic Aspect", "description": "Choose a dragon type associated with your patron. You gain resistance to the damage type associated with that dragon. Additionally, when you deal damage with a warlock spell or cantrip, you can change the damage type to match your dragon's type."}],
          "6": [{"name": "Frightful Presence", "description": "You channel your patron's terrifying presence. As an action, each creature of your choice within 30 feet must succeed on a Wisdom saving throw against your warlock spell save DC or become frightened of you for 1 minute. A frightened creature can repeat the save at the end of each of its turns. Once a creature succeeds on this save, it is immune to this feature for 24 hours. You can use this feature a number of times equal to your proficiency bonus."}],
          "10": [{"name": "Wyrm's Scales", "description": "Draconic scales emerge to protect you. While you aren't wearing armor, your AC equals 13 + your Dexterity modifier. Additionally, once per long rest when you are reduced to 0 hit points, you can choose to drop to 1 hit point instead."}],
          "14": [{"name": "Dragon Transformation", "description": "You can assume a draconic form. As an action, you transform for 1 minute. While transformed: you grow wings and gain a flying speed of 60 feet, you can use an action to breathe a 30-foot cone of your dragon type's damage, dealing 8d6 damage (Dexterity save for half), and you have immunity to your dragon type's damage. Once you use this feature, you can't use it again until you finish a long rest."}]
        }
      },
      {
        "name": "The Beholder",
        "description": "Your patron is a beholder, an aberrant creature of immense paranoia and power. Through this connection, you gain access to strange eye-based abilities",
        "source": "Hoard of Heroes",
        "expandedSpells": {
          "1": ["Ray of Sickness", "Charm Person"],
          "2": ["Hold Person", "Ray of Enfeeblement"],
          "3": ["Fear", "Slow"],
          "4": ["Confusion", "Phantasmal Killer"],
          "5": ["Dominate Person", "Telekinesis"]
        },
        "featuresByLevel": {
          "1": [{"name": "All-Seeing Eye", "description": "You can see in magical darkness out to 60 feet. Additionally, you gain proficiency in Perception if you don't already have it, and you can add your Charisma modifier to Perception checks."}, {"name": "Minor Eye Ray", "description": "You can project a ray of magical energy from your eye. As an action, choose one creature you can see within 60 feet. The target must succeed on a saving throw of a type you choose (Dexterity, Constitution, or Wisdom) against your warlock spell save DC or take 1d10 force damage and suffer one minor effect: its speed is reduced by 10 feet (Dex), it has disadvantage on its next attack roll (Con), or it has disadvantage on its next saving throw (Wis). The damage increases to 2d10 at 5th level, 3d10 at 11th level, and 4d10 at 17th level."}],
          "6": [{"name": "Paranoid Awareness", "description": "Your patron's paranoia bleeds into you, making you difficult to surprise or deceive. You can't be surprised while you are conscious. Additionally, you have advantage on saving throws against being charmed, and magic can't put you to sleep."}],
          "10": [{"name": "Eye Stalks", "description": "Spectral eye stalks manifest around you briefly when you need them. When you cast a warlock spell of 1st level or higher, you can use a bonus action to also use your Minor Eye Ray feature against a different target."}],
          "14": [{"name": "Antimagic Gaze", "description": "You can project an antimagic cone from your eye. As an action, you create a 60-foot cone of antimagic originating from you. For the duration, no spell or magical effect functions within this cone. The cone lasts until the start of your next turn. You can use this feature a number of times equal to your Charisma modifier, and you regain all expended uses when you finish a long rest."}]
        }
      }
    ]
  },
  "wizard": {
    "name": "Wizard",
    "description": "A scholarly magic-user capable of manipulating the structures of reality",
    "hitDie": 6,
    "primaryAbility": ["int"],
    "dumpStat": "str",
    "savingThrows": ["int", "wis"],
    "skillChoices": 2,
    "skillOptions": ["arcana", "history", "insight", "investigation", "medicine", "religion"],
    "armorProficiencies": [],
    "weaponProficiencies": ["daggers", "darts", "slings", "quarterstaffs", "light crossbows"],
    "startingEquipment": {
      "choices": [
        {
          "choose": 1,
          "from": [
            "Quarterstaff",
            "Dagger"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Component Pouch",
            "Arcane Focus"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Scholar's Pack",
            "Explorer's Pack"
          ]
        }
      ],
      "given": ["Spellbook"]
    },
    "startingGold": {
      "dice": "4d4",
      "multiplier": 10,
      "average": 100
    },
    "spellcasting": {
      "ability": "int",
      "spellsKnown": "All prepared",
      "cantripsKnown": [3, 3, 3, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]
    },
    "features": [
      "Spellcasting - You can cast wizard spells using Intelligence as your spellcasting ability",
      "Arcane Recovery - Once per day during a short rest, you can recover expended spell slots"
    ],
    "subclasses": [
      {
        "name": "School of Abjuration",
        "description": "Specialist in protective magic and warding",
        "featuresByLevel": {
          "2": [
            { "name": "Abjuration Savant", "description": "Gold and time to copy abjuration spells into your spellbook is halved." },
            { "name": "Arcane Ward", "description": "When you cast an abjuration spell of 1st level or higher, you create a magical ward with HP equal to twice your wizard level + Intelligence modifier. When you take damage, the ward takes the damage instead. When you cast an abjuration spell, the ward regains HP equal to twice the spell's level." }
          ],
          "6": [
            { "name": "Projected Ward", "description": "When a creature you can see within 30 feet takes damage, you can use your reaction to have your Arcane Ward absorb that damage. If the ward has 0 HP, you take any remaining damage." }
          ],
          "10": [
            { "name": "Improved Abjuration", "description": "When you cast an abjuration spell requiring an ability check (like counterspell or dispel magic), you add your proficiency bonus to that check." }
          ],
          "14": [
            { "name": "Spell Resistance", "description": "You have advantage on saving throws against spells, and you have resistance to damage from spells." }
          ]
        }
      },
      {
        "name": "School of Conjuration",
        "description": "Master of summoning and teleportation magic",
        "featuresByLevel": {
          "2": [
            { "name": "Conjuration Savant", "description": "Gold and time to copy conjuration spells into your spellbook is halved." },
            { "name": "Minor Conjuration", "description": "As an action, you conjure an inanimate object in your hand or on the ground. The object is no larger than 3 feet on a side and weighs no more than 10 pounds. It is visibly magical and lasts for 1 hour or until it deals or takes damage." }
          ],
          "6": [
            { "name": "Benign Transposition", "description": "As an action, you teleport up to 30 feet to an unoccupied space, or swap places with a willing Small or Medium creature within 30 feet. Once used, you can't use this again until you finish a long rest or cast a conjuration spell of 1st level or higher." }
          ],
          "10": [
            { "name": "Focused Conjuration", "description": "While concentrating on a conjuration spell, your concentration can't be broken by taking damage." }
          ],
          "14": [
            { "name": "Durable Summons", "description": "Creatures you summon or create with a conjuration spell have 30 temporary hit points." }
          ]
        }
      },
      {
        "name": "School of Divination",
        "description": "Seer who peers into the past, present, and future",
        "featuresByLevel": {
          "2": [
            { "name": "Divination Savant", "description": "Gold and time to copy divination spells into your spellbook is halved." },
            { "name": "Portent", "description": "When you finish a long rest, roll two d20s and record the numbers. You can replace any attack roll, saving throw, or ability check made by you or a creature you can see with one of these rolls. Each roll can only be used once." }
          ],
          "6": [
            { "name": "Expert Divination", "description": "When you cast a divination spell of 2nd level or higher using a spell slot, you regain one expended spell slot of a level lower than the spell you cast (maximum 5th level)." }
          ],
          "10": [
            { "name": "The Third Eye", "description": "As an action, choose one: see 60 feet in darkness (including magical), see invisible creatures within 10 feet, read any language, or see into the Ethereal Plane up to 60 feet. Lasts until you finish a short or long rest." }
          ],
          "14": [
            { "name": "Greater Portent", "description": "You roll three d20s for your Portent feature instead of two." }
          ]
        }
      },
      {
        "name": "School of Enchantment",
        "description": "Master of charms and mind-affecting magic",
        "featuresByLevel": {
          "2": [
            { "name": "Enchantment Savant", "description": "Gold and time to copy enchantment spells into your spellbook is halved." },
            { "name": "Hypnotic Gaze", "description": "As an action, choose one creature within 5 feet. If it can see or hear you, it must make a Wisdom save or be charmed until the end of your next turn. The charmed creature is incapacitated and visibly dazed. You can use your action to maintain this effect, extending the duration. The effect ends if you move more than 5 feet away or if the creature takes damage." }
          ],
          "6": [
            { "name": "Instinctive Charm", "description": "When a creature within 30 feet attacks you, you can use your reaction to divert the attack if another creature is within the attack's range. The attacker must make a Wisdom save; on a failure, they attack the closest creature other than you. Creatures immune to charm are immune to this. Once used, you can't use it again until you finish a short or long rest." }
          ],
          "10": [
            { "name": "Split Enchantment", "description": "When you cast an enchantment spell of 1st level or higher that targets only one creature, you can have it target a second creature." }
          ],
          "14": [
            { "name": "Alter Memories", "description": "When you cast an enchantment spell to charm a creature, you can make one creature fail its save automatically. Additionally, when the charm ends, the charmed creature has no memory of being charmed if you spend 1 minute talking to it. You can also make it forget up to 1 + Charisma modifier hours of time (minimum 1)." }
          ]
        }
      },
      {
        "name": "School of Evocation",
        "description": "Master of powerful elemental and combat magic",
        "featuresByLevel": {
          "2": [
            { "name": "Evocation Savant", "description": "Gold and time to copy evocation spells into your spellbook is halved." },
            { "name": "Sculpt Spells", "description": "When you cast an evocation spell that affects other creatures, you can choose a number of them equal to 1 + the spell's level. Those creatures automatically succeed on their saves and take no damage if they would normally take half damage on a successful save." }
          ],
          "6": [
            { "name": "Potent Cantrip", "description": "When a creature succeeds on a saving throw against your cantrip, the creature takes half the cantrip's damage (if any) but suffers no additional effect." }
          ],
          "10": [
            { "name": "Empowered Evocation", "description": "You add your Intelligence modifier to one damage roll of any wizard evocation spell you cast." }
          ],
          "14": [
            { "name": "Overchannel", "description": "When you cast a wizard spell of 1st through 5th level that deals damage, you can deal maximum damage with that spell. If you use this feature again before a long rest, you take 2d12 necrotic damage per spell level immediately after casting. Each additional use before a long rest increases the damage by 1d12 per spell level." }
          ]
        }
      },
      {
        "name": "School of Illusion",
        "description": "Master of deception, misdirection, and phantasms",
        "featuresByLevel": {
          "2": [
            { "name": "Illusion Savant", "description": "Gold and time to copy illusion spells into your spellbook is halved." },
            { "name": "Improved Minor Illusion", "description": "You learn the minor illusion cantrip. When you cast it, you can create both a sound and an image with a single casting." }
          ],
          "6": [
            { "name": "Malleable Illusions", "description": "When you cast an illusion spell with a duration of 1 minute or longer, you can use your action to change the nature of that illusion (within the spell's normal parameters), provided you can see the illusion." }
          ],
          "10": [
            { "name": "Illusory Self", "description": "When a creature makes an attack roll against you, you can use your reaction to create an illusory duplicate. The attack automatically misses, then the illusion dissipates. Once used, you can't use this again until you finish a short or long rest." }
          ],
          "14": [
            { "name": "Illusory Reality", "description": "When you cast an illusion spell of 1st level or higher, you can choose one inanimate, nonmagical object that is part of the illusion and make it real for 1 minute. The object can't deal damage or directly harm anyone." }
          ]
        }
      },
      {
        "name": "School of Necromancy",
        "description": "Master of death magic and undead servants",
        "featuresByLevel": {
          "2": [
            { "name": "Necromancy Savant", "description": "Gold and time to copy necromancy spells into your spellbook is halved." },
            { "name": "Grim Harvest", "description": "Once per turn when you kill a creature with a spell of 1st level or higher, you regain HP equal to twice the spell's level, or three times if it's a necromancy spell. You don't gain this benefit for killing constructs or undead." }
          ],
          "6": [
            { "name": "Undead Thralls", "description": "You add the animate dead spell to your spellbook. When you cast animate dead, you can target one additional corpse or pile of bones. Undead you create with necromancy spells have additional benefits: their HP maximum increases by your wizard level, and they add your proficiency bonus to weapon damage rolls." }
          ],
          "10": [
            { "name": "Inured to Undeath", "description": "You have resistance to necrotic damage, and your HP maximum can't be reduced." }
          ],
          "14": [
            { "name": "Command Undead", "description": "As an action, you can attempt to command an undead you can see within 60 feet. It makes a Charisma save. On failure, it becomes friendly to you and obeys your commands until you use this feature again. Intelligent undead (Int 8+) get advantage, and undead with Int 12+ can repeat the save every hour." }
          ]
        }
      },
      {
        "name": "School of Transmutation",
        "description": "Master of transformative and alchemical magic",
        "featuresByLevel": {
          "2": [
            { "name": "Transmutation Savant", "description": "Gold and time to copy transmutation spells into your spellbook is halved." },
            { "name": "Minor Alchemy", "description": "You can transform one nonmagical object of wood, stone (not gem), iron, copper, or silver into a different one of those materials. For each 10 minutes, you transform up to 1 cubic foot. The transformation lasts 1 hour or until you lose concentration." }
          ],
          "6": [
            { "name": "Transmuter's Stone", "description": "You create a transmuter's stone that grants one benefit to the bearer: darkvision 60 feet, +10 speed, proficiency in Constitution saves, or resistance to acid/cold/fire/lightning/thunder damage. You can change the benefit when you cast a transmutation spell of 1st level or higher." }
          ],
          "10": [
            { "name": "Shapechanger", "description": "You add polymorph to your spellbook. You can cast it without expending a spell slot to transform yourself into a beast with CR 1 or lower. Once used, you can't do this again until you finish a short or long rest." }
          ],
          "14": [
            { "name": "Master Transmuter", "description": "As an action, you can consume your transmuter's stone to cause one effect: transmute a 5-foot-cube nonmagical object into another nonmagical object of similar size and mass, remove all curses/diseases/poisons from a creature and restore all HP, cast raise dead without a spell slot, or reduce a willing creature's apparent age by 3d10 years (minimum 13)." }
          ]
        }
      },
      {
        "name": "Bladesinging",
        "description": "Elven tradition of combining swordplay with magic",
        "featuresByLevel": {
          "2": [
            { "name": "Training in War and Song", "description": "You gain proficiency with light armor and one type of one-handed melee weapon of your choice. You also gain proficiency in the Performance skill if you don't already have it." },
            { "name": "Bladesong", "description": "As a bonus action, you can start a Bladesong that lasts 1 minute. It ends early if you are incapacitated, don medium/heavy armor or a shield, or use two hands for a weapon attack. While active: add Int modifier to AC and Concentration saves, gain +10 walking speed, and advantage on Acrobatics checks. You can use this a number of times equal to your proficiency bonus, regaining uses on a long rest." }
          ],
          "6": [
            { "name": "Extra Attack", "description": "You can attack twice, instead of once, when you take the Attack action. Moreover, you can cast one of your cantrips in place of one of those attacks." }
          ],
          "10": [
            { "name": "Song of Defense", "description": "While your Bladesong is active, when you take damage, you can use your reaction to expend one spell slot and reduce that damage by 5 times the slot's level." }
          ],
          "14": [
            { "name": "Song of Victory", "description": "While your Bladesong is active, you add your Intelligence modifier to melee weapon damage rolls." }
          ]
        }
      },
      {
        "name": "War Magic",
        "description": "Blends combat prowess with magical protection",
        "featuresByLevel": {
          "2": [
            { "name": "Arcane Deflection", "description": "When you are hit by an attack or fail a saving throw, you can use your reaction to gain +2 to AC against that attack or +4 to the saving throw. When you use this, you can only cast cantrips until the end of your next turn." },
            { "name": "Tactical Wit", "description": "You add your Intelligence modifier to your initiative rolls." }
          ],
          "6": [
            { "name": "Power Surge", "description": "You can store magical energy within yourself. You start with one power surge and gain another when you successfully end a spell with dispel magic or counterspell. Maximum surges equal your Int modifier (minimum 1). When you deal damage with a wizard spell, you can spend one surge to deal extra force damage equal to half your wizard level to one target." }
          ],
          "10": [
            { "name": "Durable Magic", "description": "While you maintain concentration on a spell, you have +2 to AC and all saving throws." }
          ],
          "14": [
            { "name": "Deflecting Shroud", "description": "When you use Arcane Deflection, you can cause magical energy to arc from you. Up to three creatures of your choice within 60 feet take force damage equal to half your wizard level." }
          ]
        }
      },
      {
        "name": "Chronurgy Magic",
        "description": "Manipulates time and fate itself",
        "featuresByLevel": {
          "2": [
            { "name": "Chronal Shift", "description": "After you or a creature you can see within 30 feet makes an attack roll, ability check, or saving throw, you can use your reaction to force the creature to reroll. You choose which roll to use. You can use this twice, regaining uses on a long rest." },
            { "name": "Temporal Awareness", "description": "You add your Intelligence modifier to your initiative rolls." }
          ],
          "6": [
            { "name": "Momentary Stasis", "description": "As an action, force a Large or smaller creature within 60 feet to make a Constitution save. On failure, it is incapacitated and speed becomes 0 until the end of your next turn or until it takes damage. You can use this a number of times equal to your Int modifier, regaining uses on a long rest." }
          ],
          "10": [
            { "name": "Arcane Abeyance", "description": "When you cast a spell of 4th level or lower, you can condense it into a mote (a Tiny gray bead). The mote lasts 1 hour. A creature holding it can use an action to release the spell. The spell uses your stats but is otherwise controlled by the creature. Once used, you can't create another mote until you finish a short or long rest." }
          ],
          "14": [
            { "name": "Convergent Future", "description": "When you or a creature you can see within 60 feet makes an attack roll, ability check, or saving throw, you can use your reaction to ignore the die roll and decide whether it succeeds or fails. After using this, you suffer one level of exhaustion that can only be removed by a long rest." }
          ]
        }
      },
      {
        "name": "Graviturgy Magic",
        "description": "Manipulates gravity and the fundamental forces",
        "featuresByLevel": {
          "2": [
            { "name": "Adjust Density", "description": "As an action, you magically alter the density of an object or creature within 30 feet that isn't being worn or carried. The creature must be Large or smaller. For 1 minute (concentration), increase or decrease the weight by up to half. A doubled creature has disadvantage on Strength checks and -10 speed; a halved creature has advantage on Strength checks, can jump twice as far, and takes 1d10 less falling damage." }
          ],
          "6": [
            { "name": "Gravity Well", "description": "Whenever you cast a spell on a creature, you can move it 5 feet to an unoccupied space if it is willing, fails the spell's save, or is hit by the spell attack. The movement doesn't provoke opportunity attacks." }
          ],
          "10": [
            { "name": "Violent Attraction", "description": "When a creature within 60 feet hits with a weapon attack, you can use your reaction to increase the damage by 1d10 (same type as the weapon). Alternatively, when a creature within 60 feet is falling, you can increase the falling damage by 2d10. You can use this a number of times equal to your Int modifier, regaining uses on a long rest." }
          ],
          "14": [
            { "name": "Event Horizon", "description": "As an action, choose a point within 30 feet. For 1 minute (concentration), a 30-foot sphere of difficult terrain forms. Creatures starting their turn in or entering the sphere must make a Strength save. On failure, they take 2d10 force damage and their speed becomes 0 until the start of their next turn. On success, they take half damage and every foot of movement costs 2 extra feet. You can use this once per long rest or by spending a spell slot of 3rd level or higher." }
          ]
        }
      },
      {
        "name": "Order of Scribes",
        "description": "Awakens the sentient magic of their spellbook",
        "featuresByLevel": {
          "2": [
            { "name": "Wizardly Quill", "description": "As a bonus action, you create a Tiny quill with these properties: it doesn't require ink, the time to copy a spell into your spellbook equals 2 minutes per spell level, and you can erase anything written with it as a bonus action if you can see it within 5 feet." },
            { "name": "Awakened Spellbook", "description": "Your spellbook becomes a sentient magical object. When casting a wizard spell with a spell slot, you can temporarily replace its damage type with another type from a spell in your spellbook. You can use your spellbook as a spellcasting focus. When you cast a ritual, you can cast it in its normal casting time rather than adding 10 minutes." }
          ],
          "6": [
            { "name": "Manifest Mind", "description": "As a bonus action, you conjure the mind of your spellbook as a Tiny spectral object within 60 feet. It has 60-foot darkvision and telepathy with you. You can cast wizard spells as though you were in its space. You can move it 30 feet as a bonus action. It can pass through creatures but not objects. You can use this proficiency bonus times per long rest." }
          ],
          "10": [
            { "name": "Master Scrivener", "description": "When you finish a long rest, you can create one spell scroll by touching your Wizardly Quill to blank paper. The scroll contains a 1st or 2nd level spell from your spellbook. Its casting time becomes 1 action if it was longer. The scroll lasts until your next long rest. If you cast the spell from the scroll, the spell slot expended is one level lower (minimum 1st)." }
          ],
          "14": [
            { "name": "One with the Word", "description": "While your spellbook is on your person, you have advantage on all Arcana checks. When you take damage while your Awakened Spellbook's mind is manifested, you can use your reaction to dismiss it and prevent all of that damage. Then roll 3d6; the total equals the number of spell levels that vanish from your spellbook (starting with highest levels). If there aren't enough levels, you drop to 0 HP instead." }
          ]
        }
      },
      {
        "name": "Hedge Mage",
        "description": "Wizards who learn their craft outside of formal academies, often in rural communities where they serve as the local magical expert, healer, and adviser",
        "source": "Hoard of Heroes",
        "featuresByLevel": {
          "2": [
            { "name": "Folk Magic", "description": "You learn magical traditions passed down through generations. You learn the Druidcraft and Spare the Dying cantrips, which count as wizard cantrips for you but don't count against your number of cantrips known. Additionally, you gain proficiency in the Medicine and Nature skills if you don't already have them." },
            { "name": "Practical Spellcasting", "description": "When you cast a wizard spell that restores hit points or removes a condition, you can add your Intelligence modifier to the amount of healing done. Additionally, the gold and time you must spend to copy a spell into your spellbook is halved if the spell is of the abjuration, divination, or transmutation school." }
          ],
          "6": [
            { "name": "Community Guardian", "description": "Your protective magic extends to those around you. When you cast an abjuration spell of 1st level or higher that targets only yourself, you can have it also target one additional creature within 30 feet. At 10th level, you can target two additional creatures. At 14th level, you can target three additional creatures." }
          ],
          "10": [
            { "name": "Resourceful Casting", "description": "You've learned to stretch your magical resources. When you cast a wizard spell using a spell slot, you can choose to cast it at one level lower than the slot expended (minimum 1st level). If you do, you regain a spell slot of that lower level. You can use this feature a number of times equal to your Intelligence modifier, and you regain all expended uses when you finish a long rest." }
          ],
          "14": [
            { "name": "Master of the Hearth", "description": "Your protective magic reaches its peak. You can cast Warding Bond without expending a spell slot and without requiring material components. When you do so, you don't suffer the damage sharing drawback of the spell, though you still share other effects. Additionally, whenever a creature protected by your Community Guardian or Warding Bond takes damage, you can use your reaction to reduce that damage by an amount equal to your wizard level. You can use this reaction a number of times equal to your Intelligence modifier, and you regain all expended uses when you finish a long rest." }
          ]
        }
      }
    ]
  },
  "artificer": {
    "name": "Artificer",
    "description": "A master of magical invention, blending magic and craftsmanship",
    "hitDie": 8,
    "primaryAbility": ["int"],
    "dumpStat": "str",
    "savingThrows": ["con", "int"],
    "skillChoices": 2,
    "skillOptions": ["arcana", "history", "investigation", "medicine", "nature", "perception", "sleight_of_hand"],
    "armorProficiencies": ["light", "medium", "shields"],
    "weaponProficiencies": ["simple"],
    "toolProficiencies": ["Thieves' Tools", "Tinker's Tools", "One type of artisan's tools of your choice"],
    "startingEquipment": {
      "choices": [
        {
          "choose": 1,
          "from": [
            "Light Crossbow and 20 Bolts",
            "Any Simple Weapon"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Studded Leather Armor",
            "Scale Mail"
          ]
        },
        {
          "choose": 1,
          "from": [
            "Dungeoneer's Pack",
            "Explorer's Pack"
          ]
        }
      ],
      "given": ["Thieves' Tools", "Tinker's Tools"]
    },
    "startingGold": {
      "dice": "5d4",
      "multiplier": 10,
      "average": 125
    },
    "spellcasting": {
      "ability": "int",
      "spellsKnown": "Limited known",
      "cantripsKnown": [2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4]
    },
    "features": [
      "Magical Tinkering - You can imbue mundane objects with minor magical effects",
      "Spellcasting - You can cast artificer spells using Intelligence as your spellcasting ability",
      "Infuse Item - You can imbue mundane items with magical infusions",
      "The Right Tool for the Job - You can create artisan's tools with 1 hour of work"
    ],
    "subclasses": [
      {
        "name": "Alchemist",
        "description": "Master of potions and experimental elixirs",
        "bonusProficiencies": ["Alchemist's supplies"],
        "subclassSpells": {
          "3": ["Healing Word", "Ray of Sickness"],
          "5": ["Flaming Sphere", "Melf's Acid Arrow"],
          "9": ["Gaseous Form", "Mass Healing Word"],
          "13": ["Blight", "Death Ward"],
          "17": ["Cloudkill", "Raise Dead"]
        },
        "featuresByLevel": {
          "3": [
            { "name": "Tool Proficiency", "description": "You gain proficiency with alchemist's supplies. If you already have this proficiency, you gain proficiency with one other type of artisan's tools of your choice." },
            { "name": "Alchemist Spells", "description": "You always have certain spells prepared based on your artificer level. These spells count as artificer spells for you but don't count against your number of prepared spells." },
            { "name": "Experimental Elixir", "description": "When you finish a long rest, you can magically produce one experimental elixir in an empty flask you touch. Roll on the Experimental Elixir table or choose the effect. As an action, a creature can drink the elixir or administer it. Creating an elixir requires a 1st-level spell slot. Effects: Healing (2d4+Int HP), Swiftness (+10 speed for 1 hour), Resilience (+1 AC for 10 minutes), Boldness (1d4 to attack and saves for 1 minute), Flight (10 ft flying for 10 minutes), Transformation (alter self for 10 minutes). Elixirs last until your next long rest." }
          ],
          "5": [
            { "name": "Alchemical Savant", "description": "When you cast a spell using your alchemist's supplies as the spellcasting focus, you gain a bonus to one roll of the spell. That roll must restore HP or deal acid, fire, necrotic, or poison damage. The bonus equals your Intelligence modifier (minimum +1)." }
          ],
          "9": [
            { "name": "Restorative Reagents", "description": "You can cast Lesser Restoration without expending a spell slot, doing so a number of times equal to your Intelligence modifier (minimum once). You regain all uses when you finish a long rest. Additionally, when a creature drinks an Experimental Elixir you created, the creature gains temporary HP equal to 2d6 + your Intelligence modifier." }
          ],
          "15": [
            { "name": "Chemical Mastery", "description": "You have resistance to acid and poison damage, and you are immune to the poisoned condition. You can cast Greater Restoration and Heal without expending a spell slot, without having the spell prepared, and without providing the material component. Once you cast either spell with this feature, you can't cast that spell again until you finish a long rest." }
          ]
        }
      },
      {
        "name": "Armorer",
        "description": "Magical armor specialist who becomes one with their suit",
        "bonusProficiencies": ["Heavy armor", "Smith's tools"],
        "subclassSpells": {
          "3": ["Magic Missile", "Thunderwave"],
          "5": ["Mirror Image", "Shatter"],
          "9": ["Hypnotic Pattern", "Lightning Bolt"],
          "13": ["Fire Shield", "Greater Invisibility"],
          "17": ["Passwall", "Wall of Force"]
        },
        "featuresByLevel": {
          "3": [
            { "name": "Tools of the Trade", "description": "You gain proficiency with heavy armor and smith's tools. If you already have a proficiency, you gain proficiency with another artisan's tool of your choice." },
            { "name": "Armorer Spells", "description": "You always have certain spells prepared based on your artificer level. These count as artificer spells for you but don't count against your prepared spells." },
            { "name": "Arcane Armor", "description": "As an action, you turn a suit of armor into Arcane Armor. It expands to cover your entire body, you can use it as a spellcasting focus, it attaches armor gauntlets, the armor can't be removed against your will, it replaces missing limbs, and you ignore Strength requirements." },
            { "name": "Armor Model", "description": "Choose a model: Guardian (Thunder Gauntlets: melee 1d8 thunder, target has disadvantage attacking others; Defensive Field: gain temp HP equal to artificer level as bonus action, uses = proficiency bonus per long rest) or Infiltrator (Lightning Launcher: ranged 90ft 1d6 lightning, +1d6 once per turn; 5 ft walking speed boost; advantage on Stealth). You can change model on short or long rest." }
          ],
          "5": [
            { "name": "Extra Attack", "description": "You can attack twice, rather than once, whenever you take the Attack action on your turn." }
          ],
          "9": [
            { "name": "Armor Modifications", "description": "Your Arcane Armor now counts as separate items for infusion purposes: armor (chest), boots, helmet, and the armor's special weapon. Each piece can bear one of your infusions, and the infusions transfer when you change armor. You can also infuse a new item with no limit to how many items you can infuse at once." }
          ],
          "15": [
            { "name": "Perfected Armor", "description": "Guardian gains Perfected: when a Huge or smaller creature you can see ends its turn within 30 feet, you can use your reaction to magically force it to make a Strength save. On failure, pull it up to 30 feet toward you, and if it ends within 5 feet, deal lightning damage equal to your Intelligence modifier. Infiltrator gains Perfected: any creature that takes lightning damage from your Lightning Launcher glimmers until the start of your next turn. While glimmering, it can't benefit from invisibility, and the next attack against it has advantage." }
          ]
        }
      },
      {
        "name": "Artillerist",
        "description": "Master of magical cannons and explosives",
        "bonusProficiencies": ["Woodcarver's tools"],
        "subclassSpells": {
          "3": ["Shield", "Thunderwave"],
          "5": ["Scorching Ray", "Shatter"],
          "9": ["Fireball", "Wind Wall"],
          "13": ["Ice Storm", "Wall of Fire"],
          "17": ["Cone of Cold", "Wall of Force"]
        },
        "featuresByLevel": {
          "3": [
            { "name": "Tool Proficiency", "description": "You gain proficiency with woodcarver's tools. If you already have this proficiency, you gain proficiency with one other type of artisan's tools of your choice." },
            { "name": "Artillerist Spells", "description": "You always have certain spells prepared based on your artificer level. These count as artificer spells for you but don't count against your prepared spells." },
            { "name": "Eldritch Cannon", "description": "As an action, you create a Small or Tiny magical cannon in an unoccupied space within 5 feet. It has AC 18 and HP equal to 5× your artificer level. It is immune to poison and psychic damage. Choose its type when created: Flamethrower (15 ft cone, Dex save, 2d8 fire), Force Ballista (ranged attack, 2d8 force, push 5 ft), or Protector (10 ft radius, 1d8+Int temp HP). Activate as bonus action; lasts 1 hour. You can create one cannon for free per long rest; additional cannons cost a spell slot." }
          ],
          "5": [
            { "name": "Arcane Firearm", "description": "Using woodcarver's tools, you turn a wand, staff, or rod into an arcane firearm, your spellcasting focus. When you cast an artificer spell through the firearm, roll a d8 and add the result to one of the spell's damage rolls." }
          ],
          "9": [
            { "name": "Explosive Cannon", "description": "Your Eldritch Cannon's damage increases: Flamethrower deals 3d8 fire, Force Ballista deals 3d8 force. Additionally, as an action, you can command the cannon to detonate. Each creature within 20 feet makes a Dex save, taking 3d8 force damage on a failed save (half on success). The cannon is destroyed." }
          ],
          "15": [
            { "name": "Fortified Position", "description": "You and your allies have half cover while within 10 feet of an Eldritch Cannon you created. You can now have two cannons at the same time. If you create a third, one you choose is destroyed. Activating both uses a single bonus action, and each can be a different type." }
          ]
        }
      },
      {
        "name": "Battle Smith",
        "description": "Warrior artificer with a mechanical companion",
        "bonusProficiencies": ["Martial weapons", "Smith's tools"],
        "subclassSpells": {
          "3": ["Heroism", "Shield"],
          "5": ["Branding Smite", "Warding Bond"],
          "9": ["Aura of Vitality", "Conjure Barrage"],
          "13": ["Aura of Purity", "Fire Shield"],
          "17": ["Banishing Smite", "Mass Cure Wounds"]
        },
        "featuresByLevel": {
          "3": [
            { "name": "Tool Proficiency", "description": "You gain proficiency with smith's tools. If you already have this proficiency, you gain proficiency with one other type of artisan's tools of your choice." },
            { "name": "Battle Smith Spells", "description": "You always have certain spells prepared based on your artificer level. These count as artificer spells for you but don't count against your prepared spells." },
            { "name": "Battle Ready", "description": "You gain proficiency with martial weapons. When you attack with a magic weapon, you can use your Intelligence modifier instead of Strength or Dexterity for the attack and damage rolls." },
            { "name": "Steel Defender", "description": "You create a Steel Defender, a loyal construct that accompanies you. It uses your proficiency bonus, has HP equal to 5× your artificer level + your Int modifier + the defender's Con modifier × your artificer level. In combat, it shares your initiative and takes its turn immediately after yours. It can take the Dodge action on its own, but requires your bonus action to command it to take another action (Attack, Dash, Disengage, Help, or Repair - 2d8+proficiency HP healed). If it dies, you can revive it after 1 minute or create a new one during a long rest." }
          ],
          "5": [
            { "name": "Extra Attack", "description": "You can attack twice, rather than once, whenever you take the Attack action on your turn." }
          ],
          "9": [
            { "name": "Arcane Jolt", "description": "Your magic strikes and your Steel Defender become more powerful. When you or your Steel Defender hits with a magic weapon attack or the defender's Force-Empowered Rend, you can channel magical energy to cause extra effects. The target takes an extra 2d6 force damage, OR one creature or object you choose within 30 feet of the target regains 2d6 hit points. You can use this a number of times equal to your Intelligence modifier (minimum once) per long rest." }
          ],
          "15": [
            { "name": "Improved Defender", "description": "Your Arcane Jolt damage and healing increase to 4d6. Your Steel Defender gains a +2 bonus to AC. Additionally, when your Steel Defender uses its Deflect Attack reaction, the attacker takes force damage equal to 1d4 + your Intelligence modifier." }
          ]
        }
      }
    ]
  }
}
