[
  { "name": "Astral Projection", "school": "Necromancy", "castingTime": "1 hour", "range": "10 feet", "duration": "Special", "components": "V, S, M", "classes": ["cleric", "warlock", "wizard"], "description": "You and up to eight willing creatures within range project your astral bodies into the Astral Plane. The material body you leave behind is unconscious and in a state of suspended animation, it doesn't need food or air and doesn't age. Your astral body resembles your mortal form in almost every way, replicating your game statistics and possessions. The principal difference is the addition of a silvery cord that extends from between your shoulder blades and trails behind you, fading to invisibility after 1 foot. This cord is your tether to your material body. If the cord is cut — something that can happen only when an effect specifically states that it does — your soul and body are separated, ending the spell." },
  { "name": "Foresight", "school": "Divination", "castingTime": "1 minute", "range": "Touch", "duration": "8 hours", "components": "V, S, M", "classes": ["bard", "druid", "warlock", "wizard"], "description": "You touch a willing creature and bestow a limited ability to see into the immediate future. For the duration, the target can't be surprised and has advantage on attack rolls, ability checks, and saving throws. Additionally, other creatures have disadvantage on attack rolls against the target for the duration. This spell immediately ends if you cast it again before its duration ends." },
  { "name": "Gate", "school": "Conjuration", "castingTime": "1 action", "range": "60 feet", "duration": "Concentration, up to 1 minute", "components": "V, S, M", "classes": ["cleric", "sorcerer", "wizard"], "description": "You conjure a portal linking an unoccupied space you can see within range to a precise location on a different plane of existence. The portal is a circular opening, which you can make 5 to 20 feet in diameter. You can orient the portal in any direction you choose. The portal lasts for the duration. The portal has a front and a back on each plane where it appears. Travel through the portal is possible only by moving through its front. Anything that does so is instantly transported to the other plane, appearing in the unoccupied space nearest to the portal. When you cast this spell, you can speak the name of a specific creature. If that creature is on a plane other than the one you are on, the portal opens in the named creature's immediate vicinity and draws the creature through it." },
  { "name": "Imprisonment", "school": "Abjuration", "castingTime": "1 minute", "range": "30 feet", "duration": "Until dispelled", "components": "V, S, M", "classes": ["warlock", "wizard"], "description": "You create a magical restraint to hold a creature that you can see within range. The target must succeed on a Wisdom saving throw or be bound by the spell; if it succeeds, it is immune to this spell if you cast it again. While affected by this spell, the creature doesn't need to breathe, eat, or drink, and it doesn't age. Divination spells can't locate or perceive the target. When you cast the spell, you choose one of the following forms of imprisonment: Burial, Chaining, Hedged Prison, Minimus Containment, or Slumber. A Dispel Magic spell can end the spell only if it is cast as a 9th-level spell, targeting either the prison or the special component used to create it." },
  { "name": "Mass Heal", "school": "Evocation", "castingTime": "1 action", "range": "60 feet", "duration": "Instantaneous", "components": "V, S", "healing": "up to 700 hit points", "classes": ["cleric"], "description": "A flood of healing energy flows from you into injured creatures around you. You restore up to 700 hit points, divided as you choose among any number of creatures that you can see within range. Creatures healed by this spell are also cured of all diseases and any effect making them blinded or deafened. This spell has no effect on undead or constructs." },
  { "name": "Meteor Swarm", "school": "Evocation", "castingTime": "1 action", "range": "1 mile", "duration": "Instantaneous", "components": "V, S", "damage": "20d6 fire + 20d6 bludgeoning", "classes": ["sorcerer", "wizard"], "description": "Blazing orbs of fire plummet to the ground at four different points you can see within range. Each creature in a 40-foot-radius sphere centered on each point you choose must make a Dexterity saving throw. The sphere spreads around corners. A creature takes 20d6 fire damage and 20d6 bludgeoning damage on a failed save, or half as much on a successful one. A creature in the area of more than one fiery burst is affected only once. The spell damages objects in the area and ignites flammable objects that aren't being worn or carried." },
  { "name": "Power Word Heal", "school": "Evocation", "castingTime": "1 action", "range": "Touch", "duration": "Instantaneous", "components": "V, S", "healing": "full hit points", "classes": ["bard"], "description": "A wave of healing energy washes over the creature you touch. The target regains all its hit points. If the creature is charmed, frightened, paralyzed, or stunned, the condition ends. If the creature is prone, it can use its reaction to stand up. This spell has no effect on undead or constructs." },
  { "name": "Power Word Kill", "school": "Enchantment", "castingTime": "1 action", "range": "60 feet", "duration": "Instantaneous", "components": "V", "classes": ["bard", "sorcerer", "warlock", "wizard"], "description": "You utter a word of power that can compel one creature you can see within range to perish instantly. If the creature you choose has 100 hit points or fewer, it is slain. Otherwise, the spell has no effect." },
  { "name": "Prismatic Wall", "school": "Abjuration", "castingTime": "1 action", "range": "60 feet", "duration": "10 minutes", "components": "V, S", "classes": ["wizard"], "description": "A shimmering, multicolored plane of light forms a vertical opaque wall — up to 90 feet long, 30 feet high, and 1 inch thick — centered on a point you can see within range. Alternatively, you can shape the wall into a sphere up to 30 feet in diameter centered on a point you choose within range. The wall remains in place for the duration. The wall sheds bright light out to a range of 100 feet and dim light for an additional 100 feet. The wall consists of seven layers, each with a different color. When a creature attempts to reach into or pass through the wall, it does so one layer at a time through all the wall's layers. Each layer can be destroyed by specific means, and a Rod of Cancellation can destroy the wall." },
  { "name": "Shapechange", "school": "Transmutation", "castingTime": "1 action", "range": "Self", "duration": "Concentration, up to 1 hour", "components": "V, S, M", "classes": ["druid", "wizard"], "description": "You assume the form of a different creature for the duration. The new form can be of any creature with a challenge rating equal to your level or lower. The creature can't be a construct or an undead. You assume the hit points and Hit Dice of the new form. When you revert to your normal form, you return to the number of hit points you had before you transformed. You retain your alignment, personality, Intelligence, Wisdom, and Charisma scores. You also retain your skill and saving throw proficiencies. Your game statistics are otherwise replaced by the statistics of the chosen creature, though you retain your class features." },
  { "name": "Storm of Vengeance", "school": "Conjuration", "castingTime": "1 action", "range": "Sight", "duration": "Concentration, up to 1 minute", "components": "V, S", "damage": "2d6 thunder (varies by round)", "classes": ["druid"], "description": "A churning storm cloud forms, centered on a point you can see and spreading to a radius of 360 feet. Lightning flashes in the area, thunder booms, and strong winds roar. Each creature under the cloud when it appears must make a Constitution saving throw. On a failed save, a creature takes 2d6 thunder damage and becomes deafened for 5 minutes. Each round you maintain concentration on this spell, the storm produces different effects on your turn: Round 2 — acid rain (1d6 acid), Round 3 — lightning bolts (10d6 lightning on up to 6 creatures), Round 4 — hailstones (2d6 bludgeoning), Round 5-10 — gusts and freezing rain (1d6 cold, visibility reduced, ranged attacks impossible, concentration difficult)." },
  { "name": "Time Stop", "school": "Transmutation", "castingTime": "1 action", "range": "Self", "duration": "Instantaneous", "components": "V", "classes": ["sorcerer", "wizard"], "description": "You briefly stop the flow of time for everyone but yourself. No time passes for other creatures, while you take 1d4 + 1 turns in a row, during which you can use actions and move as normal. This spell ends if one of the actions you use during this period, or any effects that you create during this period, affects a creature other than you or an object being worn or carried by someone other than you. In addition, the spell ends if you move to a place more than 1,000 feet from the location where you cast it." },
  { "name": "True Polymorph", "school": "Transmutation", "castingTime": "1 action", "range": "30 feet", "duration": "Concentration, up to 1 hour", "components": "V, S, M", "classes": ["bard", "warlock", "wizard"], "description": "Choose one creature or nonmagical object that you can see within range. You transform the creature into a different creature, the creature into a nonmagical object, or the object into a creature (the object must be neither combative nor magical). The transformation lasts for the duration, or until the target drops to 0 hit points or the spell is dispelled. If you concentrate on this spell for the full duration, the spell lasts until it is dispelled. The new form can be any kind whose challenge rating is equal to or less than the target's (or the target's level, if the target doesn't have a challenge rating)." },
  { "name": "True Resurrection", "school": "Necromancy", "castingTime": "1 hour", "range": "Touch", "duration": "Instantaneous", "components": "V, S, M", "classes": ["cleric", "druid"], "description": "You touch a creature that has been gone for no longer than 200 years. If the creature's soul is free and willing, the creature is restored to life with all its hit points. This spell closes all wounds, neutralizes any poison, cures all diseases, and lifts any curses affecting the creature when it perished. The spell replaces damaged or missing organs and limbs. If the creature was undead, it is restored to its non-undead form. The spell can even provide a new body if the original no longer exists, in which case you must speak the creature's name. The creature then appears in an unoccupied space you choose within 10 feet of you." },
  { "name": "Weird", "school": "Illusion", "castingTime": "1 action", "range": "120 feet", "duration": "Concentration, up to 1 minute", "components": "V, S", "damage": "4d10 psychic", "classes": ["wizard"], "description": "Drawing on the deepest fears of a group of creatures, you create illusory creatures in their minds, visible only to them. Each creature in a 30-foot-radius sphere centered on a point of your choice within range must make a Wisdom saving throw. On a failed save, a creature becomes frightened for the duration. The illusion calls on the creature's deepest fears, manifesting its worst nightmares as an implacable threat. At the end of each of the frightened creature's turns, the creature must succeed on a Wisdom saving throw or take 4d10 psychic damage. On a successful save, the spell ends for that creature." },
  { "name": "Wish", "school": "Conjuration", "castingTime": "1 action", "range": "Self", "duration": "Instantaneous", "components": "V", "classes": ["sorcerer", "wizard"], "description": "Wish is the mightiest spell a mortal creature can cast. By simply speaking aloud, you can alter the very foundations of reality in accord with your desires. The basic use of this spell is to duplicate any other spell of 8th level or lower. You don't need to meet any requirements in that spell, including costly components. The spell simply takes effect. Alternatively, you can create effects beyond the scope of normal spells, subject to DM discretion. The stress of casting this spell to produce any effect other than duplicating another spell weakens you, and there is a 33 percent chance you are unable to cast Wish ever again." }
]