[
  { "name": "Animate Dead", "school": "Necromancy", "castingTime": "1 minute", "range": "10 feet", "duration": "Instantaneous", "components": "V, S, M", "classes": ["cleric", "wizard"], "description": "This spell creates an undead servant. Choose a pile of bones or a corpse of a Medium or Small humanoid within range. Your spell imbues the target with a foul mimicry of life, raising it as an undead creature. The target becomes a skeleton if you chose bones or a zombie if you chose a corpse. The creature is under your control for 24 hours, after which it stops obeying any command you've given it. To maintain control for another 24 hours, you must cast this spell on the creature again before the current 24-hour period ends." },
  { "name": "Aura of Vitality", "school": "Evocation", "castingTime": "1 action", "range": "Self (30-foot radius)", "duration": "Concentration, up to 1 minute", "components": "V", "classes": ["paladin"], "healing": "2d6 per bonus action", "description": "Healing energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. You can use a bonus action to cause one creature in the aura to regain 2d6 hit points." },
  { "name": "Beacon of Hope", "school": "Abjuration", "castingTime": "1 action", "range": "30 feet", "duration": "Concentration, up to 1 minute", "components": "V, S", "classes": ["cleric"], "description": "This spell bestows hope and vitality. Choose any number of creatures within range. For the duration, each target has advantage on Wisdom saving throws and death saving throws, and regains the maximum number of hit points possible from any healing." },
  { "name": "Bestow Curse", "school": "Necromancy", "castingTime": "1 action", "range": "Touch", "duration": "Concentration, up to 1 minute", "components": "V, S", "classes": ["bard", "cleric", "wizard"], "description": "You touch a creature, and that creature must succeed on a Wisdom saving throw or become cursed for the duration of the spell. When you cast this spell, choose the nature of the curse from the following options: choose one ability score — the target has disadvantage on ability checks and saving throws made with that ability score; the target has disadvantage on attack rolls against you; the target must make a Wisdom saving throw at the start of each turn or waste its action; or your attacks and spells deal an extra 1d8 necrotic damage to the target. At Higher Levels: duration increases at 4th level and above." },
  { "name": "Blinding Smite", "school": "Evocation", "castingTime": "1 bonus action", "range": "Self", "duration": "Concentration, up to 1 minute", "components": "V", "damage": "3d8 radiant", "classes": ["paladin"], "description": "The next time you hit a creature with a melee weapon attack during this spell's duration, your weapon flares with bright light, and the attack deals an extra 3d8 radiant damage to the target. Additionally, the target must succeed on a Constitution saving throw or be blinded until the spell ends. A blinded creature can make a Constitution saving throw at the end of each of its turns, ending the effect on a success." },
  { "name": "Call Lightning", "school": "Conjuration", "castingTime": "1 action", "range": "120 feet", "duration": "Concentration, up to 10 minutes", "components": "V, S", "damage": "3d10 lightning", "classes": ["druid"], "description": "A storm cloud appears in the shape of a cylinder that is 10 feet tall with a 60-foot radius, centered on a point you can see within range directly above you. If you are outdoors in stormy conditions, the spell's damage increases to 4d10. Each turn you can use your action to call down lightning on a point beneath the cloud. Each creature within 5 feet of that point must make a Dexterity saving throw, taking damage on a failure or half on a success. At Higher Levels: The damage increases by 1d10 for each slot level above 3rd." },
  { "name": "Clairvoyance", "school": "Divination", "castingTime": "10 minutes", "range": "1 mile", "duration": "Concentration, up to 10 minutes", "components": "V, S, M", "classes": ["bard", "cleric", "sorcerer", "wizard"], "description": "You create an invisible sensor within range in a location familiar to you or in an obvious location. The sensor can see or hear (your choice when you cast the spell) as if it were in that space. You can switch between seeing and hearing as an action." },
  { "name": "Conjure Animals", "school": "Conjuration", "castingTime": "1 action", "range": "60 feet", "duration": "Concentration, up to 1 hour", "components": "V, S", "classes": ["druid", "ranger"], "description": "You summon fey spirits that take the form of beasts and appear in unoccupied spaces that you can see within range. Choose one of the following options: one beast of challenge rating 2 or lower, two beasts of challenge rating 1 or lower, four beasts of challenge rating 1/2 or lower, or eight beasts of challenge rating 1/4 or lower. Each beast is considered fey and disappears when it drops to 0 hit points or when the spell ends. The summoned creatures are friendly to you and your companions." },
  { "name": "Conjure Barrage", "school": "Conjuration", "castingTime": "1 action", "range": "Self (60-foot cone)", "duration": "Instantaneous", "components": "V, S, M", "damage": "3d8 (weapon type)", "classes": ["ranger"], "description": "You throw a nonmagical weapon or fire a piece of nonmagical ammunition into the air to create a cone of identical weapons that shoot forward and then disappear. Each creature in a 60-foot cone must make a Dexterity saving throw. A creature takes 3d8 damage on a failed save, or half as much on a successful one. The damage type is the same as the weapon or ammunition used as a component." },
  { "name": "Counterspell", "school": "Abjuration", "castingTime": "1 reaction", "range": "60 feet", "duration": "Instantaneous", "components": "S", "classes": ["sorcerer", "warlock", "wizard"], "description": "You attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a success, the creature's spell fails and has no effect. At Higher Levels: The interrupted spell has no effect if its level is equal to or less than the level of the spell slot you used." },
  { "name": "Create Food and Water", "school": "Conjuration", "castingTime": "1 action", "range": "30 feet", "duration": "Instantaneous", "components": "V, S", "classes": ["cleric", "paladin"], "description": "You create 45 pounds of food and 30 gallons of water on the ground or in containers within range, enough to sustain up to fifteen humanoids or five steeds for 24 hours. The food is bland but nourishing, and spoils if uneaten after 24 hours. The water is clean and doesn't go bad." },
  { "name": "Crusader's Mantle", "school": "Evocation", "castingTime": "1 action", "range": "Self", "duration": "Concentration, up to 1 minute", "components": "V", "damage": "1d4 radiant (per ally hit)", "classes": ["paladin"], "description": "Holy power radiates from you in an aura with a 30-foot radius, awakening boldness in friendly creatures. Until the spell ends, the aura moves with you, centered on you. While in the aura, each nonhostile creature in the aura (including you) deals an extra 1d4 radiant damage when it hits with a weapon attack." },
  { "name": "Daylight", "school": "Evocation", "castingTime": "1 action", "range": "60 feet", "duration": "1 hour", "components": "V, S", "classes": ["cleric", "druid", "paladin", "ranger", "sorcerer"], "description": "A 60-foot-radius sphere of light spreads out from a point you choose within range. The sphere is bright light and sheds dim light for an additional 60 feet. If the point you chose is on an object you are holding or one that isn't being worn or carried, the light shines from the object and moves with it. Completely covering the object with something opaque blocks the light. If any of this spell's area overlaps with magical darkness created by a spell of 3rd level or lower, the spell that created the darkness is dispelled." },
  { "name": "Dispel Magic", "school": "Abjuration", "castingTime": "1 action", "range": "120 feet", "duration": "Instantaneous", "components": "V, S", "classes": ["bard", "cleric", "druid", "paladin", "sorcerer", "warlock", "wizard", "artificer"], "description": "Choose one creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends. At Higher Levels: You automatically end the effects of a spell on the target if the spell's level is equal to or less than the level of the spell slot you used." },
  { "name": "Elemental Weapon", "school": "Transmutation", "castingTime": "1 action", "range": "Touch", "duration": "Concentration, up to 1 hour", "components": "V, S", "classes": ["paladin", "artificer"], "description": "A nonmagical weapon you touch becomes a magic weapon. Choose one of the following damage types: acid, cold, fire, lightning, or thunder. For the duration, the weapon has a +1 bonus to attack rolls and deals an extra 1d4 damage of the chosen type when it hits. At Higher Levels: The bonus increases to +2 and 2d4 at 5th or 6th level, and +3 and 3d4 at 7th level or higher." },
  { "name": "Fear", "school": "Illusion", "castingTime": "1 action", "range": "Self (30-foot cone)", "duration": "Concentration, up to 1 minute", "components": "V, S, M", "classes": ["bard", "sorcerer", "warlock", "wizard"], "description": "You project a phantasmal image of a creature's worst fears. Each creature in a 30-foot cone must succeed on a Wisdom saving throw or drop whatever it is holding and become frightened for the duration. While frightened, a creature must take the Dash action and move away from you by the safest route on each of its turns. A creature can repeat the saving throw at the end of each of its turns, ending the effect on a success." },
  { "name": "Feign Death", "school": "Necromancy", "castingTime": "1 action", "range": "Touch", "duration": "1 hour", "components": "V, S, M", "ritual": true, "classes": ["bard", "cleric", "druid", "wizard"], "description": "You touch a willing creature and put it into a cataleptic state that is indistinguishable from death. For the duration, the target appears dead to all outward inspection and to spells used to determine the target's status. The target is blinded and incapacitated, its speed drops to 0, and it has resistance to all damage except psychic damage. If the target is diseased or poisoned, the disease and poison have no effect for the duration." },
  { "name": "Fireball", "school": "Evocation", "castingTime": "1 action", "range": "150 feet", "duration": "Instantaneous", "components": "V, S, M", "damage": "8d6 fire", "classes": ["sorcerer", "wizard"], "description": "A bright streak flashes from your pointing finger to a point you choose within range and then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot-radius sphere centered on that point must make a Dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much on a successful one. The fire spreads around corners and ignites flammable objects in the area that aren't being worn or carried. At Higher Levels: The damage increases by 1d6 for each slot level above 3rd." },
  { "name": "Fly", "school": "Transmutation", "castingTime": "1 action", "range": "Touch", "duration": "Concentration, up to 10 minutes", "components": "V, S, M", "classes": ["sorcerer", "warlock", "wizard", "artificer"], "description": "You touch a willing creature. The target gains a flying speed of 60 feet for the duration. When the spell ends, the target falls if it is still aloft, unless it can stop the fall. At Higher Levels: You can target one additional creature for each slot level above 3rd." },
  { "name": "Gaseous Form", "school": "Transmutation", "castingTime": "1 action", "range": "Touch", "duration": "Concentration, up to 1 hour", "components": "V, S, M", "classes": ["sorcerer", "warlock", "wizard"], "description": "You transform a willing creature you touch, along with everything it's wearing and carrying, into a misty cloud for the duration. The spell ends if the creature drops to 0 hit points. The creature's only movement is a flying speed of 10 feet. The creature can enter and occupy the space of another creature and has resistance to nonmagical damage. The creature has advantage on Strength, Dexterity, and Constitution saving throws, and can pass through small holes and narrow openings." },
  { "name": "Glyph of Warding", "school": "Abjuration", "castingTime": "1 hour", "range": "Touch", "duration": "Until dispelled or triggered", "components": "V, S, M", "classes": ["bard", "cleric", "wizard", "artificer"], "description": "When you cast this spell, you inscribe a glyph that later unleashes a magical effect. You inscribe it either on a surface or within an object that can be closed to conceal the glyph. If you choose a surface, the glyph can cover an area no larger than 10 feet in diameter. The glyph is nearly invisible and requires a successful Intelligence (Investigation) check against your spell save DC to find. You can set conditions for triggering the glyph. You can choose an explosive runes glyph (5d8 acid, cold, fire, lightning, or thunder damage in 20-foot radius) or a spell glyph that stores a spell of 3rd level or lower." },
  { "name": "Haste", "school": "Transmutation", "castingTime": "1 action", "range": "30 feet", "duration": "Concentration, up to 1 minute", "components": "V, S, M", "classes": ["sorcerer", "wizard", "artificer"], "description": "Choose a willing creature that you can see within range. Until the spell ends, the target's speed is doubled, it gains a +2 bonus to AC, it has advantage on Dexterity saving throws, and it gains an additional action on each of its turns. That action can be used only to take the Attack (one weapon attack only), Dash, Disengage, Hide, or Use an Object action. When the spell ends, the target can't move or take actions until after its next turn, as a wave of lethargy sweeps over it." },
  { "name": "Hunger of Hadar", "school": "Conjuration", "castingTime": "1 action", "range": "150 feet", "duration": "Concentration, up to 1 minute", "components": "V, S, M", "damage": "2d6 cold + 2d6 acid", "classes": ["warlock"], "description": "You open a gateway to the dark between the stars, a region infested with unknown horrors. A 20-foot-radius sphere of blackness and bitter cold appears, centered on a point within range and lasting for the duration. The void is filled with a cacophony of soft whispers and slurping noises. No light, magical or otherwise, can illuminate the area, and creatures fully within the area are blinded. Any creature that starts its turn in the area takes 2d6 cold damage. Any creature that ends its turn in the area must make a Dexterity saving throw or take 2d6 acid damage." },
  { "name": "Hypnotic Pattern", "school": "Illusion", "castingTime": "1 action", "range": "120 feet", "duration": "Concentration, up to 1 minute", "components": "S, M", "classes": ["bard", "sorcerer", "warlock", "wizard"], "description": "You create a twisting pattern of colors that weaves through the air inside a 30-foot cube within range. The pattern appears for a moment and vanishes. Each creature in the area who sees the pattern must make a Wisdom saving throw. On a failed save, the creature becomes charmed for the duration. While charmed, the creature is incapacitated and has a speed of 0. The spell ends for an affected creature if it takes any damage or if someone else uses an action to shake the creature out of its stupor." },
  { "name": "Leomund's Tiny Hut", "school": "Evocation", "castingTime": "1 minute", "range": "Self (10-foot-radius hemisphere)", "duration": "8 hours", "components": "V, S, M", "ritual": true, "classes": ["bard", "wizard"], "description": "A 10-foot-radius immobile dome of force springs into existence around and above you and remains stationary for the duration. Nine creatures of Medium size or smaller can fit inside the dome with you. The spell fails if its area includes a larger creature or more than nine creatures. The atmosphere inside is comfortable and dry. The dome prevents the weather and elements from entering, but creatures and objects can pass freely through it. All other creatures and objects are barred from passing through. Spells and magical effects can't extend through the dome or be cast through it." },
  { "name": "Lightning Arrow", "school": "Transmutation", "castingTime": "1 bonus action", "range": "Self", "duration": "Concentration, up to 1 minute", "components": "V, S", "damage": "4d8 lightning", "classes": ["ranger"], "description": "The next time you make a ranged weapon attack during the spell's duration, the weapon's ammunition, or the weapon itself if it's a thrown weapon, transforms into a bolt of lightning. Make the attack roll as normal. The target takes 4d8 lightning damage on a hit, or half as much on a miss, instead of the weapon's normal damage. Whether you hit or miss, each creature within 10 feet of the target must make a Dexterity saving throw, taking 2d8 lightning damage on a failed save or half on a success. At Higher Levels: Damage increases by 1d8 for each slot level above 3rd." },
  { "name": "Lightning Bolt", "school": "Evocation", "castingTime": "1 action", "range": "Self (100-foot line)", "duration": "Instantaneous", "components": "V, S, M", "damage": "8d6 lightning", "classes": ["sorcerer", "wizard"], "description": "A stroke of lightning forming a line 100 feet long and 5 feet wide blasts out from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 8d6 lightning damage on a failed save, or half as much on a successful one. The lightning ignites flammable objects in the area that aren't being worn or carried. At Higher Levels: The damage increases by 1d6 for each slot level above 3rd." },
  { "name": "Magic Circle", "school": "Abjuration", "castingTime": "1 minute", "range": "10 feet", "duration": "1 hour", "components": "V, S, M", "classes": ["cleric", "paladin", "warlock", "wizard"], "description": "You create a 10-foot-radius, 20-foot-tall cylinder of magical energy centered on a point on the ground that you can see within range. Glowing runes appear wherever the cylinder intersects with the floor or other surface. Choose one or more of the following types: celestials, elementals, fey, fiends, or undead. The circle affects a creature of the chosen type in the following ways: the creature can't willingly enter the area by nonmagical means, the creature has disadvantage on attack rolls against targets within the area, and targets in the area can't be charmed, frightened, or possessed by the creature." },
  { "name": "Major Image", "school": "Illusion", "castingTime": "1 action", "range": "120 feet", "duration": "Concentration, up to 10 minutes", "components": "V, S, M", "classes": ["bard", "sorcerer", "warlock", "wizard"], "description": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot you can see within range and lasts for the duration. It seems completely real, including sounds, smells, and temperature. You can use your action to cause the image to move to any spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. Physical interaction with the image reveals it to be an illusion. At Higher Levels: When cast at 6th level or higher, the spell lasts until dispelled without requiring concentration." },
  { "name": "Mass Healing Word", "school": "Evocation", "castingTime": "1 bonus action", "range": "60 feet", "duration": "Instantaneous", "components": "V", "healing": "1d4 + spellcasting modifier", "classes": ["cleric"], "description": "As you call out words of restoration, up to six creatures of your choice that you can see within range regain hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs. At Higher Levels: The healing increases by 1d4 for each slot level above 3rd." },
  { "name": "Meld into Stone", "school": "Transmutation", "castingTime": "1 action", "range": "Touch", "duration": "8 hours", "components": "V, S", "ritual": true, "classes": ["cleric", "druid"], "description": "You step into a stone object or surface large enough to fully contain your body, melding yourself and all the equipment you carry with the stone for the duration. Using your movement, you step into the stone at a point you can touch. Nothing of your presence remains visible or otherwise detectable by nonmagical senses. While merged with the stone, you can't see what occurs outside it, and any Wisdom (Perception) checks you make to hear sounds outside are made with disadvantage. You remain aware of the passage of time and can cast spells on yourself while merged." },
  { "name": "Nondetection", "school": "Abjuration", "castingTime": "1 action", "range": "Touch", "duration": "8 hours", "components": "V, S, M", "classes": ["bard", "ranger", "wizard"], "description": "For the duration, you hide a target that you touch from divination magic. The target can be a willing creature, a place, or an object no larger than 10 feet in any dimension. The target can't be targeted by any divination magic or perceived through magical scrying sensors." },
  { "name": "Phantom Steed", "school": "Illusion", "castingTime": "1 minute", "range": "30 feet", "duration": "1 hour", "components": "V, S", "ritual": true, "classes": ["wizard"], "description": "A Large quasi-real, horselike creature appears on the ground in an unoccupied space of your choice within range. You decide the creature's appearance, but it is equipped with a saddle, bit, and bridle. The creature uses the statistics for a riding horse but has a speed of 100 feet and can travel 10 miles in an hour, or 13 miles at a fast pace. The creature disappears if it takes any damage or when the spell ends." },
  { "name": "Plant Growth", "school": "Transmutation", "castingTime": "1 action or 8 hours", "range": "150 feet", "duration": "Instantaneous", "components": "V, S", "classes": ["bard", "druid", "ranger"], "description": "This spell channels vitality into plants within a specific area. There are two possible uses for the spell. If you cast this spell using 1 action, choose a point within range. All normal plants in a 100-foot-radius sphere centered on that point become thick and overgrown, making the area difficult terrain. If you cast this spell over 8 hours, you enrich the land. All plants in a half-mile radius centered on a point within range become enriched for 1 year, yielding twice the normal amount of food when harvested." },
  { "name": "Protection from Energy", "school": "Abjuration", "castingTime": "1 action", "range": "Touch", "duration": "Concentration, up to 1 hour", "components": "V, S", "classes": ["cleric", "druid", "ranger", "sorcerer", "wizard", "artificer"], "description": "For the duration, the willing creature you touch has resistance to one damage type of your choice: acid, cold, fire, lightning, or thunder." },
  { "name": "Remove Curse", "school": "Abjuration", "castingTime": "1 action", "range": "Touch", "duration": "Instantaneous", "components": "V, S", "classes": ["cleric", "paladin", "warlock", "wizard"], "description": "At your touch, all curses affecting one creature or object end. If the object is a cursed magic item, its curse remains, but the spell breaks its owner's attunement to the object so it can be removed or discarded." },
  { "name": "Revivify", "school": "Necromancy", "castingTime": "1 action", "range": "Touch", "duration": "Instantaneous", "components": "V, S, M", "healing": "1 hit point", "classes": ["cleric", "paladin", "artificer"], "description": "You touch a creature that has perished within the last minute. That creature returns to life with 1 hit point. This spell can't return to life a creature that has perished of old age, nor can it restore any missing body parts." },
  { "name": "Sending", "school": "Evocation", "castingTime": "1 action", "range": "Unlimited", "duration": "1 round", "components": "V, S, M", "classes": ["bard", "cleric", "wizard"], "description": "You send a short message of twenty-five words or less to a creature with which you are familiar. The creature hears the message in its mind, recognizes you as the sender if it knows you, and can answer in a like manner immediately. The spell enables creatures with Intelligence scores of at least 1 to understand the meaning of your message. You can send the message across any distance and even to other planes of existence." },
  { "name": "Sleet Storm", "school": "Conjuration", "castingTime": "1 action", "range": "150 feet", "duration": "Concentration, up to 1 minute", "components": "V, S, M", "classes": ["druid", "sorcerer", "wizard"], "description": "Until the spell ends, freezing rain and sleet fall in a 20-foot-tall cylinder with a 40-foot radius centered on a point you choose within range. The area is heavily obscured, and exposed flames in the area are doused. The ground in the area is covered with slick ice, making it difficult terrain. When a creature enters the spell's area for the first time on a turn or starts its turn there, it must make a Dexterity saving throw. On a failed save, it falls prone. If a creature starts its turn in the area and is concentrating on a spell, it must make a successful Constitution saving throw against your spell save DC or lose concentration." },
  { "name": "Slow", "school": "Transmutation", "castingTime": "1 action", "range": "120 feet", "duration": "Concentration, up to 1 minute", "components": "V, S, M", "classes": ["sorcerer", "wizard"], "description": "You alter time around up to six creatures of your choice in a 40-foot cube within range. Each target must succeed on a Wisdom saving throw or be affected by this spell for the duration. An affected target's speed is halved, it takes a -2 penalty to AC and Dexterity saving throws, and it can't use reactions. On its turn, it can use either an action or a bonus action, not both. Regardless of the creature's abilities or magic items, it can't make more than one melee or ranged attack during its turn. If the creature attempts to cast a spell with a casting time of 1 action, roll a d20. On an 11 or higher, the spell takes effect on the creature's next turn instead." },
  { "name": "Speak with Dead", "school": "Necromancy", "castingTime": "1 action", "range": "10 feet", "duration": "10 minutes", "components": "V, S, M", "classes": ["bard", "cleric"], "description": "You grant the semblance of life and intelligence to a corpse of your choice within range, allowing it to answer the questions you pose. The corpse must still have a mouth and can't be undead. The spell fails if the corpse was the target of this spell within the last 10 days. You can ask the corpse up to five questions. The corpse knows only what it knew in life, including the languages it knew. Answers are usually brief, cryptic, or repetitive." },
  { "name": "Speak with Plants", "school": "Transmutation", "castingTime": "1 action", "range": "Self (30-foot radius)", "duration": "10 minutes", "components": "V, S", "classes": ["bard", "druid", "ranger"], "description": "You imbue plants within 30 feet of you with limited sentience and animation, giving them the ability to communicate with you and follow your simple commands. You can question plants about events in the spell's area within the past day, gaining information about creatures that have passed, weather, and other circumstances. You can also turn difficult terrain caused by plant growth into ordinary terrain, or turn ordinary terrain into difficult terrain." },
  { "name": "Spirit Guardians", "school": "Conjuration", "castingTime": "1 action", "range": "Self (15-foot radius)", "duration": "Concentration, up to 10 minutes", "components": "V, S, M", "damage": "3d8 radiant or necrotic", "classes": ["cleric"], "description": "You call forth spirits to protect you. They flit around you to a distance of 15 feet for the duration. If you are good or neutral, their spectral form appears angelic or fey. If you are evil, they appear fiendish. When you cast this spell, you can designate any number of creatures you can see to be unaffected by it. An affected creature's speed is halved in the area, and when the creature enters the area for the first time on a turn or starts its turn there, it must make a Wisdom saving throw. On a failed save, the creature takes 3d8 radiant damage (or necrotic if you are evil). On a successful save, the creature takes half as much damage. At Higher Levels: The damage increases by 1d8 for each slot level above 3rd." },
  { "name": "Stinking Cloud", "school": "Conjuration", "castingTime": "1 action", "range": "90 feet", "duration": "Concentration, up to 1 minute", "components": "V, S, M", "classes": ["bard", "sorcerer", "wizard"], "description": "You create a 20-foot-radius sphere of yellow, nauseating gas centered on a point within range. The cloud spreads around corners, and its area is heavily obscured. The cloud lingers in the air for the duration. Each creature that is completely within the cloud at the start of its turn must make a Constitution saving throw. On a failed save, the creature spends its action that turn retching and reeling. Creatures that don't need to breathe or are immune to poison automatically succeed on this saving throw. A moderate wind disperses the cloud after 4 rounds. A strong wind disperses it after 1 round." },
  { "name": "Tongues", "school": "Divination", "castingTime": "1 action", "range": "Touch", "duration": "1 hour", "components": "V, M", "classes": ["bard", "cleric", "sorcerer", "warlock", "wizard"], "description": "This spell grants the creature you touch the ability to understand any spoken language it hears. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says." },
  { "name": "Vampiric Touch", "school": "Necromancy", "castingTime": "1 action", "range": "Self", "duration": "Concentration, up to 1 minute", "components": "V, S", "damage": "3d6 necrotic", "classes": ["warlock", "wizard"], "description": "The touch of your shadow-wreathed hand can siphon life force from others. Make a melee spell attack against a creature within your reach. On a hit, the target takes 3d6 necrotic damage, and you regain hit points equal to half the amount of necrotic damage dealt. Until the spell ends, you can make the attack again on each of your turns as an action. At Higher Levels: The damage increases by 1d6 for each slot level above 3rd." },
  { "name": "Water Breathing", "school": "Transmutation", "castingTime": "1 action", "range": "30 feet", "duration": "24 hours", "components": "V, S, M", "ritual": true, "classes": ["druid", "ranger", "sorcerer", "wizard", "artificer"], "description": "This spell grants up to ten willing creatures you can see within range the ability to breathe underwater until the spell ends. Affected creatures also retain their normal mode of respiration." },
  { "name": "Water Walk", "school": "Transmutation", "castingTime": "1 action", "range": "30 feet", "duration": "1 hour", "components": "V, S, M", "ritual": true, "classes": ["cleric", "druid", "ranger", "sorcerer"], "description": "This spell grants the ability to move across any liquid surface — such as water, acid, mud, snow, quicksand, or lava — as if it were harmless solid ground (creatures crossing molten lava can still take damage from the heat). Up to ten willing creatures you can see within range gain this ability for the duration. If you target a creature submerged in a liquid, the spell carries the target to the surface at a rate of 60 feet per round." },
  { "name": "Wind Wall", "school": "Evocation", "castingTime": "1 action", "range": "120 feet", "duration": "Concentration, up to 1 minute", "components": "V, S, M", "damage": "3d8 bludgeoning", "classes": ["druid", "ranger"], "description": "A wall of strong wind rises from the ground at a point you choose within range. You can make the wall up to 50 feet long, 15 feet high, and 1 foot thick. The wall lasts for the duration. When the wall appears, each creature in its area must make a Strength saving throw. A creature takes 3d8 bludgeoning damage on a failed save, or half on a successful one. The strong wind keeps fog, smoke, and other gases at bay. Small or smaller flying creatures or objects can't pass through the wall. Arrows, bolts, and other ordinary projectiles launched at targets behind the wall are deflected upward and miss automatically." }
]