[
  { "name": "Aid", "school": "Abjuration", "castingTime": "1 action", "range": "30 feet", "duration": "8 hours", "components": "V, S, M", "classes": ["cleric", "paladin"], "description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creatures within range. Each target's hit point maximum and current hit points increase by 5 for the duration. At Higher Levels: For each slot level above 2nd, a target's hit points increase by an additional 5." },
  { "name": "Blindness/Deafness", "school": "Necromancy", "castingTime": "1 action", "range": "30 feet", "duration": "1 minute", "components": "V", "classes": ["bard", "cleric", "sorcerer", "wizard"], "description": "You can blind or deafen a foe. Choose one creature that you can see within range to make a Constitution saving throw. If it fails, the target is either blinded or deafened (your choice) for the duration. At the end of each of its turns, the target can make a Constitution saving throw. On a success, the spell ends." },
  { "name": "Branding Smite", "school": "Evocation", "castingTime": "1 bonus action", "range": "Self", "duration": "Concentration, up to 1 minute", "components": "V", "damage": "2d6 radiant", "classes": ["paladin"], "description": "The next time you hit a creature with a weapon attack before this spell ends, the weapon gleams with astral radiance as you strike. The attack deals an extra 2d6 radiant damage to the target, which becomes visible if it's invisible, and the target sheds dim light in a 5-foot radius and can't become invisible until the spell ends." },
  { "name": "Calm Emotions", "school": "Enchantment", "castingTime": "1 action", "range": "60 feet", "duration": "Concentration, up to 1 minute", "components": "V, S", "classes": ["bard", "cleric"], "description": "You attempt to suppress strong emotions in a group of people. Each humanoid in a 20-foot-radius sphere centered on a point you choose within range must make a Charisma saving throw. You can choose to make a target automatically succeed on its saving throw. On a failed save, you can suppress any effect causing a target to be charmed or frightened, or make a target indifferent about creatures of your choice that it is hostile toward." },
  { "name": "Darkness", "school": "Evocation", "castingTime": "1 action", "range": "60 feet", "duration": "Concentration, up to 10 minutes", "components": "V, M", "classes": ["sorcerer", "warlock", "wizard"], "description": "Magical darkness spreads from a point you choose within range to fill a 15-foot-radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can't see through this darkness, and nonmagical light can't illuminate it." },
  { "name": "Enhance Ability", "school": "Transmutation", "castingTime": "1 action", "range": "Touch", "duration": "Concentration, up to 1 hour", "components": "V, S, M", "classes": ["bard", "cleric", "druid", "sorcerer"], "description": "You touch a creature and bestow upon it a magical enhancement. Choose one of the following effects: Bear's Endurance (advantage on Constitution checks, 2d6 temp HP), Bull's Strength (advantage on Strength checks, carrying capacity doubles), Cat's Grace (advantage on Dexterity checks, no fall damage from 20 feet or less), Eagle's Splendor (advantage on Charisma checks), Fox's Cunning (advantage on Intelligence checks), or Owl's Wisdom (advantage on Wisdom checks)." },
  { "name": "Hold Person", "school": "Enchantment", "castingTime": "1 action", "range": "60 feet", "duration": "Concentration, up to 1 minute", "components": "V, S, M", "classes": ["bard", "cleric", "druid", "sorcerer", "warlock", "wizard"], "description": "Choose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target. At Higher Levels: You can target one additional humanoid for each slot level above 2nd." },
  { "name": "Invisibility", "school": "Illusion", "castingTime": "1 action", "range": "Touch", "duration": "Concentration, up to 1 hour", "components": "V, S, M", "classes": ["bard", "sorcerer", "warlock", "wizard"], "description": "A creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person. The spell ends for a target that attacks or casts a spell. At Higher Levels: You can target one additional creature for each slot level above 2nd." },
  { "name": "Lesser Restoration", "school": "Abjuration", "castingTime": "1 action", "range": "Touch", "duration": "Instantaneous", "components": "V, S", "classes": ["bard", "cleric", "druid", "paladin", "ranger"], "description": "You touch a creature and can end either one disease or one condition afflicting it. The condition can be blinded, deafened, paralyzed, or poisoned." },
  { "name": "Locate Object", "school": "Divination", "castingTime": "1 action", "range": "Self", "duration": "Concentration, up to 10 minutes", "components": "V, S, M", "classes": ["bard", "cleric", "druid", "paladin", "ranger", "wizard"], "description": "Describe or name an object that is familiar to you. You sense the direction to the object's location, as long as that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement. The spell can locate a specific object known to you, or the nearest object of a particular kind." },
  { "name": "Misty Step", "school": "Conjuration", "castingTime": "1 bonus action", "range": "Self", "duration": "Instantaneous", "components": "V", "classes": ["sorcerer", "warlock", "wizard"], "description": "Briefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space that you can see." },
  { "name": "Moonbeam", "school": "Evocation", "castingTime": "1 action", "range": "120 feet", "duration": "Concentration, up to 1 minute", "components": "V, S, M", "damage": "2d10 radiant", "classes": ["druid"], "description": "A silvery beam of pale light shines down in a 5-foot-radius, 40-foot-high cylinder centered on a point within range. Until the spell ends, dim light fills the cylinder. When a creature enters the spell's area for the first time on a turn or starts its turn there, it is engulfed in ghostly flames that cause searing pain, and it must make a Constitution saving throw. It takes 2d10 radiant damage on a failed save, or half as much damage on a successful one. A shapechanger makes its saving throw with disadvantage." },
  { "name": "Prayer of Healing", "school": "Evocation", "castingTime": "10 minutes", "range": "30 feet", "duration": "Instantaneous", "components": "V", "healing": "2d8 + spellcasting modifier", "classes": ["cleric"], "description": "Up to six creatures of your choice that you can see within range each regain hit points equal to 2d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs. At Higher Levels: The healing increases by 1d8 for each slot level above 2nd." },
  { "name": "Scorching Ray", "school": "Evocation", "castingTime": "1 action", "range": "120 feet", "duration": "Instantaneous", "components": "V, S", "damage": "2d6 fire per ray (3 rays)", "classes": ["sorcerer", "wizard"], "description": "You create three rays of fire and hurl them at targets within range. You can hurl them at one target or several. Make a ranged spell attack for each ray. On a hit, the target takes 2d6 fire damage. At Higher Levels: You create one additional ray for each slot level above 2nd." },
  { "name": "Shatter", "school": "Evocation", "castingTime": "1 action", "range": "60 feet", "duration": "Instantaneous", "components": "V, S, M", "damage": "3d8 thunder", "classes": ["bard", "sorcerer", "warlock", "wizard"], "description": "A sudden loud ringing noise, painfully intense, erupts from a point of your choice within range. Each creature in a 10-foot-radius sphere centered on that point must make a Constitution saving throw. A creature takes 3d8 thunder damage on a failed save, or half as much damage on a successful one. A creature made of inorganic material such as stone, crystal, or metal has disadvantage on this saving throw. At Higher Levels: The damage increases by 1d8 for each slot level above 2nd." },
  { "name": "Silence", "school": "Illusion", "castingTime": "1 action", "range": "120 feet", "duration": "Concentration, up to 10 minutes", "components": "V, S", "ritual": true, "classes": ["bard", "cleric", "ranger"], "description": "For the duration, no sound can be created within or pass through a 20-foot-radius sphere centered on a point you choose within range. Any creature or object entirely inside the sphere is immune to thunder damage, and creatures are deafened while entirely inside it. Casting a spell that includes a verbal component is impossible there." },
  { "name": "Spiritual Weapon", "school": "Evocation", "castingTime": "1 bonus action", "range": "60 feet", "duration": "1 minute", "components": "V, S", "damage": "1d8 + spellcasting modifier force", "classes": ["cleric"], "description": "You create a floating, spectral weapon within range that lasts for the duration or until you cast this spell again. When you cast the spell, you can make a melee spell attack against a creature within 5 feet of the weapon. On a hit, the target takes force damage equal to 1d8 + your spellcasting ability modifier. As a bonus action on your turn, you can move the weapon up to 20 feet and repeat the attack against a creature within 5 feet of it. At Higher Levels: The damage increases by 1d8 for every two slot levels above 2nd." },
  { "name": "Suggestion", "school": "Enchantment", "castingTime": "1 action", "range": "30 feet", "duration": "Concentration, up to 8 hours", "components": "V, M", "classes": ["bard", "sorcerer", "warlock", "wizard"], "description": "You suggest a course of activity (limited to a sentence or two) and magically influence a creature you can see within range that can hear and understand you. The suggestion must be worded in such a manner as to make the course of action sound reasonable. Asking the creature to stab itself, throw itself onto a spear, immolate itself, or do some other obviously harmful act ends the spell. The target must make a Wisdom saving throw. On a failed save, it pursues the course of action you described to the best of its ability." },
  { "name": "Warding Bond", "school": "Abjuration", "castingTime": "1 action", "range": "Touch", "duration": "1 hour", "components": "V, S, M", "classes": ["cleric"], "description": "This spell wards a willing creature you touch and creates a mystic connection between you and the target until the spell ends. While the target is within 60 feet of you, it gains a +1 bonus to AC and saving throws, and it has resistance to all damage. Also, each time it takes damage, you take the same amount of damage." },
  { "name": "Web", "school": "Conjuration", "castingTime": "1 action", "range": "60 feet", "duration": "Concentration, up to 1 hour", "components": "V, S, M", "classes": ["sorcerer", "wizard"], "description": "You conjure a mass of thick, sticky webbing at a point of your choice within range. The webs fill a 20-foot cube from that point for the duration. The webs are difficult terrain and lightly obscure their area. Each creature that starts its turn in the webs or that enters them during its turn must make a Dexterity saving throw. On a failed save, the creature is restrained as long as it remains in the webs or until it breaks free." }
]
